[{
  "_id": {
    "$oid": "5fd31d4da22a3e532869542c"
  },
  "body": "Being a fresher as a web developer this course helped me not only to understand web coding in such a easy way but also made each section of the course interesting and enjoyable due to the awesome teaching method by 'Colt Steele'.\n\nBest course to start with as a beginner into Web Development!!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.731Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695436"
  },
  "body": "I would give 10 stars if possible.\n\nOne of the best courses I did (and I've done plenty).\n\nThe instructions given by Colt are very clear, easy to follow along, and the YelpCamp project is really cool, as it gives us an objective to achieve by the end of the training (I am still working on it after finishing the training, to include more features and put in practice everything I've learned).\n\nAnother point that I really appreciated is that all external services (online database, image storage, deploy servers) are free and credit card information is not required.\n\nLastly, the course was entirely reviewed and updated (in 2020). I was literally in the middle of the old one when the update came, but I gladly went through all of it again.\n\nThank you very much Colt for this extrordinary experience.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.740Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695437"
  },
  "body": "Colt is a great instructor and the course is really complete. One downside, I read before starting it, in some forums, that it's out of date, which is true. BUT, Ian made a great job on keeping it up to date. He added a lot of value to it, not only in the course but also with extra material on his YouTube channel and DevSprout, his personal courses website.\n\nThanks Colt and Ian for creating an amazing course, keep up the great work!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.741Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e532869542d"
  },
  "body": "Great course while studying computer science students during summer vacation and I enjoyed each part of the course. Whoever is having passion for web development must pursue this course for having better knowledge about front and back end development.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.732Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e532869542e"
  },
  "body": "Very comprehensive overall. Can be a bit difficult to follow due to the speed the course progresses through all the content, but other than that, I cannot ask for more. Definitely going to check out the advanced course :D",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.733Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e532869542f"
  },
  "body": "good introduction course for web development. Course cover various of web dev essentials such as html, css, javascript, nodejs, api , routes etc. Great support from the TA.\n\nHowever, the course is rather outdated and lots of technology is no longer support / use nowadays such as bootstrap 3 and jQuery, Javascript ES 5 only . Also lots of coding in backend and the tools are also out of date. It makes the TA keeps updating materials, new videos as a supplement to cover those parts and its a bit messy.\n\nI enjoy the course as Colt is really good at teaching. But I personally would not recommend this course simply because the outdated content. It is a course 5 years ago and I end up need to subscribe different courses to supplement those parts.\n\nI hope Colt and the team will revisit my comment and consider to update most of the content in the course include ES6 Javascript syntax, backend sessions etc.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.734Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695430"
  },
  "body": "Not as good as expected. Some of the materials are old and you get a feeling you´ll have to update yourself. The course needs a revamp to make it a 2020 course.\n\nThere are a lot of intermediate comments made by Colt´s assistant Ian that try to help but reflect the fact the course needs to be reviewed. I know that is a lot of work, but that would get you 5 star reviews.\n\nOn the other hand I feel disappointed with the fact that in the end, I wasn´t thought how to create my own website. The deployment part speaks briefly about how to deploy a project in Heroku. Nothing is said about what about if I already have my own website. Or if I want to create a new one. I wanted to learn coding to improve my business website. I have it in wordpress. I'm aware the backend language is php and I can use a control panel to manage it. Nothing in the course is said about this.\n\nSome of the contents are disconnected. At some point you'll be sent to Ian's youtube videos, then comes Ellie to speak about javascript more advanced issues, not announced.\n\nI got to the end and the YelpCamp project that was core to our learning through experience was incomplete. They give you a number of videos from youtube to try and give you the essentials. I only watched one by Ian on google maps, and it was so old I couldn´t follow wit the current Google API environment.\n\nThe promise I was given when I bought the course wasn´t delivered. This is not enough for me to create my own website or project.\n\nAll this said I also need to leave some comments of the positives of this course. First of all the Q&A team. I've asked a couple of things and responses were quick and helpful. On online environment that is very welcome.\n\nThe course is thorough. I think I now have the tools to go deeper into the different technologies and languages if I want.\n\nColt is very clear in his expositions. Some times speaks to quick for a foreigner like myself, but we have the magic of rewind to hear as many times as we wish.\n\nWith all considered this is probably, still one of the best and more complete courses online available on the subject. I feel tempted to search for others though.\n\nThere are many other positive aspects I haven´t focused on. All in all I think 3 stars is the rate applicable at this point in time.\n\nColt and team, please think about updating the materials, or even creating a new whole course.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.734Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695431"
  },
  "body": "This was a great, comprehensive course to learn the basics of web development! Colt, has a engaging and informative teaching style that gives you a great foundation to go into more advanced topics. It kind of ends abruptly without much guidance on how to proceed, but Colt definitely gives all you need to figure it out. The sky is the limit after you take this course! Thanks Colt, Ian, Zarko, Louli, and Akshay for all your hardwork!",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.735Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695432"
  },
  "body": "Frustrating is how I would best describe this course. In the beginning course is alright. It just gets incredibly frustrating towards the end where almost everything is outdated. The slides beforehand are always nice - where it mentions the updated syntax, but having to follow through those videos with outdated syntax where we learned the updated syntax many many slides ago is just frustrating, confusing, and just plain annoying. This course was probably great 5 years ago, but these videos need to be updated properly for it to be truly effective. The few slides many moons ago, don't do this course any justice, and the fact that there are often so many things left out of the videos truly leaves me demotivated to finish the course. I always return to finish, but I can see these frustrations leaving many not wanting code again. Decent course for the price, Colt is a pretty good teacher and I would love to learn from him at one of his other bootcamps, but the material is lacking in 2020.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.736Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695433"
  },
  "body": "Awesome course for all groups , covered almost everything related to WEB Developer ever needed to learn you have to put your effort first in this course there more than enough to learn !!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.737Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695434"
  },
  "body": "The course offers a lot of content! I expected this course to take me from a complete novice to a beginner level web developer and it has. The first half of the course that deals with frontend development is very comprehensive as Colt takes time to explain concepts.\n\nThe second half however left me a bit frustrated; the backend development felt more like bringing the puzzle pieces together rather than understanding the basic of puzzle. The course has given me a good idea of how node works, but I am unsatisfied with the approach taken: most of the time, when we included packages, it felt like we were doing so arbitrarily. On this front, there were too many minor things to take care of and remember; I am not sure if this is inherent to working with node, but it was left unclear.\n\nOverall, the course offers more than what I paid for it and I am happy with what I have learned from this course.\n\nThanks Colt!",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.738Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d4da22a3e5328695435"
  },
  "body": "Very good introducing me to new technologies in more modern web development. A good fit in general, but given my robust experience in previous statistical programming (and occasional web-app-widget creation) in R and Python I think an advanced course would have been slightly more appropriate.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:37.757Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:38.739Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695454"
  },
  "body": "This course is so good, very detailed, Max teaches you the very basics to the requirements you need to build a SPA! There is also, Jost, Max's assistant who always answer all your questions. Thank you for the course!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.559Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695455"
  },
  "body": "This guy is just the best <3 Max will help you understand topics as deep as necessary.\n\nHe also has fun verbal comments :D",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.560Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695456"
  },
  "body": "Basically, this course is great. I split my opinion into 4-star achievement and one star missing.\n\n4-star achievement:\n\nWell organized, most of its content is updated. This course is built in a way that helps the students to practice and internalize the material properly.\n\nHowever:\n\nOne star missing:\n\nThere is no proper introduction for RXJS operators such as map, tap, switchMap, and so on.\n\nThe Angular-Universal section was very bad explained and not updated.\n\nThe last two chapters needed to be presented earlier in this course",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.561Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695457"
  },
  "body": "Max you are rockstar ! Many are shifting now a days to react but there is a solid reason angular exist's and you have done a great job.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.563Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695458"
  },
  "body": "I really love this course. As a web developer, I learned angular for a while, and this is the most clear and nice course I've ever learned.\n\nAlso I have to say Maximilian is really awesome, those bonus courses really useful, hope to learn more from him!\n\nReally helpful, thanks to Maximilian provides me this Angular complete guide!!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.564Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e5328695459"
  },
  "body": "Some parts of the course are still using old versions packages, Feels like, he is just changing the Name of the course only. But overall It is a Great course.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.564Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545a"
  },
  "body": "This course is a comprehensive compendium of knowledge about Angular. Interesting examples, understandable explanation. I recommend this course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.565Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545b"
  },
  "body": "Request you dont mix regular concept teaching and course project.\n\nFollow only once. Course project can be added as bonus.\n\nAs the course is progressing concepts teaching also shifyted to course project. one who dont follow course project they cant understand the advanced topics even if you explain very well.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.753Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.566Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545c"
  },
  "body": "It was amazing towards the beginning, but as it got towards the bonus material some of the information might have been a bit too compressed.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.754Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.566Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545d"
  },
  "body": "I do appreciate the effort Max puts into these videos but I feel there is to many references to \"there\", \"here\" without clearly showing or saying what \"there\" and \"here\" is. Also, in some occasions there is fast scrolling up and down that is next to impossible to track and follow.\n\nTo many \"of course\", \"and there\", \"and then\" and explanations sometimes get tangled without any reason. In addition, better structuring the course would help, using git repo that is properly organized to track Max's progress would help rather than downloading zip files.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.754Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.567Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545e"
  },
  "body": "This is one is indeed ultimate angular course. I am coming from react, and i need angular for my new job. And this is exactly what i have been looking for. I really liked how Max structured the flow of this course so that we get all downsides and features of different approaches in angular. Additional thanks for ssr bonus lectures i learned a lot thanks to them. As always thanks a lot Max. Will be glad to see new courses from you in advance. Take care.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.754Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.568Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d4ea22a3e532869545f"
  },
  "body": "je suis satisfait , malheureusement il n'existe pas une version en français",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:38.754Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:39.569Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e532869547b"
  },
  "body": "The way how Angela explained topics is fantastic, at the same time understandable but also very interesting, this is the reason what kept me not only on topics that are new for me but also on topics on which I'm familiar.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.381Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e532869547c"
  },
  "body": "This course is one of the best for everyone (beginners, intermediates, advance ), Dr.Angela is a good tutor. This course is well designed, taught and explained. I don't have any idea about coding but this course enlightened me. I have also purchased the ios 13 and swift 5, and the complete 2020 flutter development Bootcamp. Just to tell you how much I enjoyed the way she teaches, explains and solves problems/challenges.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.382Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e532869547d"
  },
  "body": "This was an amazing course! I can't say enough good things about this course. Angela is an amazing instructor, and did an extremely great job teaching all that was promised in the course description.\n\nI'm happy \"The Complete 2020 Web Development Bootcamp\" was my FIRST programming course! I feel confident enough to move onto more specific courses. Thank you Angela!!!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.383Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e532869547e"
  },
  "body": "In this course I get more experiences in web development. If I get down, this course gave you motivation to let you get up again and ready to the new journey. Don't let your dream to be web developer down!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.384Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e532869547f"
  },
  "body": "\"I got a magic stick from an angel now I think I am ready to use\". The magic stick is \"The Complete 2020 Web Development Bootcamp\" and the angel is \"Dr. Angela Yu\". You are one of the best teachers in my life, Thank you.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.384Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695480"
  },
  "body": "I've completed the course and hands down by far one of the best courses on Udemy ❤ .\n\nIt offers all you could expect from a Bootcamp course and more.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.385Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695481"
  },
  "body": "This is my first web development course and this course has introduced me to a ton of information that I would definitely use in my career as a software developer and engineer",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.386Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695482"
  },
  "body": "Angela is an amazing instructor. Explains wonderfully. I've learned so much over the course's time. So many useful information takes a little bit of time to soak in, but Angela does a great job at destructuring it into small pieces so it gets easily received by us. Only the best I can say about this whole experience. Keep it up, Angela!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.387Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695483"
  },
  "body": "Este curso desarrollado por Angela es implemente excelente . Su forma de enseñar es muy efectiva. Es una de las mejores instructores que conozco. Felicitaciones a Angela por compartirnos su conocimiento de forma extraordinaria y a Udemy por tenerla como instructora.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.388Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695484"
  },
  "body": "This course is absolutely amazing! It is fantastic value for money and easily the best course on the subject that I have found. I would absolutely recommend this course to anyone thinking about learning web development. I didn't write this review until after I had completed all 50+ hours of the course and I can absolutely say that, from beginning to end, it is extraordinary. You'll be a little amazed at what you can do after completing it.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.390Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695485"
  },
  "body": "Amazing, during this lockdown period I have managed to cover a lot of e-learning and I will without a doubt be purchasing more content from Angela. Thank you",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.391Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d4fa22a3e5328695486"
  },
  "body": "I learned a lot of new technical stuff and the most importantly I got to know about online resources that Angela refers to and encourages us to use to make web development more productive. Moreover, Angela your are an amazing instructor. I didn't find a single chapter in the whole course boring, thanks to your teaching skills!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:39.578Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:40.392Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a2"
  },
  "body": "It is an amazing course, earlier I didn't have the confidence to work on UI but after this course, I have the confidence that I can build and understand the code that is written by any JS developer.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.205Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a3"
  },
  "body": "Awesome course for beginners ,teaches you more than just Javascript,this course teaches you ,what you would do when you actually end up in a Javascript deeveloper job ,all the practical concpets which are used in the companies are taught ,like babel,webpack ,how to setup a localhost, MVC ,HTML DOM manipulation ,ES6 and many such practical real world concepts are covered rather than just the basic syntax of Javascript which you can study from W3schools also,So this is a must do course for a beginner who wants to be a Javascript developer.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.206Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a4"
  },
  "body": "Very Awesome !! explained the java script the way a programmer should think and program , very good , i loved it",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.207Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a5"
  },
  "body": "Yes content is really awesome and way of teaching is very nice. Generally people get bore in short span of time during courses but this is amazing.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.207Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a6"
  },
  "body": "Amazing course! Enjoyed making forkify project and in turn learned a whole lot of new concepts in JS.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.208Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a7"
  },
  "body": "Thank u so much for this amazing flood of knowledge on the topic, really appreciate ur efforts to make coding a real easy hobby.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.208Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a8"
  },
  "body": "I can say this course is may be the best course for JavaScript on Udemy in many aspects. The way Jonas organizes, explains and helps the student to learn is clear and smooth, unlike many course out there. I wish if he can create a new version or even update this course to more JavaScript concepts and make it a Modular complete Guide, because it lacks many aspects especially the advanced ones.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.209Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954a9"
  },
  "body": "This is a very good course it covers the basics part pretty well. Take note, you really have to slow down on the advance parts specially at Section 5. Also those coding challenges are just a pain in the butt so watch out for those :)",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.210Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954aa"
  },
  "body": "Amazing depth and very good teaching style. Absolutely would recommend it to anyone!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.210Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954ab"
  },
  "body": "This course get a very high rating from me as it's pretty easy to follow.\n\nThis could also be down to the fact that I recently learned python and quite a few of the fundamentals are the same.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.211Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954ac"
  },
  "body": "Jonas has a great way of teaching. He has very intelligently structured the whole course and indeed, anyone could learn JavaScript, and that too in very less time. He moves to the next topic very smoothly, and intelligently interrelates the previous topic.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.211Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d50a22a3e53286954ad"
  },
  "body": "Jonas is a great teacher, who explain concepts the best way that you can imagine. Hands up to the teaching assistants who instantly reply to questions. This is a great course that every JS programmer should consider taking!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:40.402Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:41.212Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954c9"
  },
  "body": "The experience was good. All the things that i have learned till now are easily understandable and compatible. Would love to make a big project using all this knowledge.\n\nThank you for sharing such great knowledge.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.018Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954ca"
  },
  "body": "Very good, simple to understand and follow basic rules of css. By attempting more advanced exercises, if i get stuck then i always come back to this site to follow the ground rules which helps me to understand things better.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.018Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954cb"
  },
  "body": "This is a decision I shall never regret.\n\nRob is on point, well explained course.\n\nAlthough I have no previous coding experience I can now try to build a real website. Thanks rob",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.019Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954cc"
  },
  "body": "I will definitely recommend this course to any beginner web developer or anyone who just want to build solid basic web development understanding",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.020Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954cd"
  },
  "body": "The Course was a great introduction to the many aspects of web development. Rob has picked the right mix of coverage to get someone moving in the directions.\n\nThe content and presentation were great!\n\nMy suggestions are;\n\n1. Create a course notes that could be used as reference as well as cover the intricacies of some of the area, ex. debugging php, python, and schematic view of arriving at MVC project.\n\n2. The final section \"where do you go from here\" could include some tips on setting up students own environment for doing web project on their own machines for practice purpose, which includes a webserver and required IDE.\n\nOverall, the course was great to follow and practice. Learnt a lot!!\n\nRegards, Tapan.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.020Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954ce"
  },
  "body": "I enjoyed the course very much, sometimes out of my depth but perhaps if I keep coding things will become easier.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.021Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954cf"
  },
  "body": "All in all I have learned some great skills and managed to create a fully fledged website. There are about 3 or 4 places where a note comes up on screen to say that what is being taught is out of date and to do something else, if you aren't looking at the screen at that point in time (if you are working on what is being said at the time for example) you can end up wasting a few hours, perhaps an audio cue could help. Also would advise taking the exams after completing the course and re-visiting each unit, as for me some of the questions in the exams related to later in the course. I would recommend this course if you are a determined person who can problem solve well (which are skills you need for web development anyway), but think the UX could have been better with refreshed/overhauled content.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.021Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954d0"
  },
  "body": "The main reason I took the course is to add jquery, bootstrap, PHP, APIs, and some python to the other skills that I already have so that I can build a complete website.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.022Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954d1"
  },
  "body": "The firsts sections were pretty good, but I couldn't learn much after the bootstrap section. After that section, I'd just followed along because I couldn't understand the process anymore.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.023Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954d2"
  },
  "body": "This was my first purchase on Udemy and I have to say I was impressed. I have prior experience working in web development, so some subjects were easier for me than most. I thought Rob's way of teaching was done very well and would recommend his course to anyone starting out in web development. The instructional videos with quizzes and the community are top notch. Thank you, Rob, for your knowledge and I look forward to some of your courses in the future.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.023Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954d3"
  },
  "body": "It was an amazing course.I had no prior knowledge related to web development and after completing this course,I am confident to make websites on my own.The explanations where really helpful throughout the course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.024Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d51a22a3e53286954d4"
  },
  "body": "I was really pleased with the course and how available the teacher was in the Q&A section. The only thing that was bad in my opinion is that it lacked more challenging quizes related to the sections.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:41.220Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.024Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f0"
  },
  "body": "It's an amazingly well organized detailed course. It would be great if this course also adds a way typescript is used in building react applications for the basic libraries used here.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.838Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f1"
  },
  "body": "This is a pretty thorough explanation of react. Mr Grider doesn't only help you understand what is happening he also answers the question why.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.839Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f2"
  },
  "body": "Stephen has extraordinary talent in both on the subject and on teaching. He went into minute details of each concept and explained. This is definitely one of the best courses on ReactJS.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.840Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f3"
  },
  "body": "Excelente explicación para las personas que disfrutan estar como \"en una clase\" donde hay una ruta pero no se siente robotizado. Excelentes explicaciones con aplicaciones diversas. Sólo sería conveniente mover parte del material antiguo a otro curso para que no fuera necesario verlo/saltarlo",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.841Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f4"
  },
  "body": "I completed the course except for the legacy parts. This was my first React + Redux course, so I can't compare this to others, but as proven by many other reviews, this was an amazing course. All aspects of react and redux were explained so well I was able to understand the fundamental ideas and advanced knowledge. Also, throughout the course, we built around 10 projects, in which we focused on the react and redux part, not on stylings, which I loved it since we had enough time to discuss all details of react and redux. Thanks so much Stephen and please keep updating the course with the newest content, so that it can be the one top of the React course on Udemy.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.842Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f5"
  },
  "body": "In one sentence: this is the best React and Redux course you can find on Udemy. I've purchased more than 10 courses this year. This is the best of the best!! If you can only learn one course on ReactJS, look no far, this is it! Stephen is also the best instructor on web development (actually on computer science, I'd say). The course is super organized. And the pace of the course is very comfortable. You can follow him step by step with no problem. I'll purchase more courses from Stephen for sure! 100000/100 Recommend!!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.842Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f6"
  },
  "body": "Stephen is an experienced teacher. The coarse starts with the basics, requiring almost no prior experience with JS or React, yet quickly and efficiently builds in complexity. The lessons are pragmatic, yet layered with theory and real-world experience; he explains both the right and wrong way of doing things and hammers it in with repetition. It really includes everything, even free-tier hosting to help get your portfolio started. Highly recommended, I look forward to Stephen's other classes!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.033Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.843Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f7"
  },
  "body": "The best course I have enrolled on Udemy! Stephen explained not only React but also modern Javascript concepts. The sample projects are funny and good for learning.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.034Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.844Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f8"
  },
  "body": "This course contains really detailed clarification of different React concepts. Moreover, the explanations provided by Stephen contain bonus content gained from his experience. I would only criticize the repetitiveness of few topics which were mentioned throughout the course. Although some of them were focused on different versions of the same library, a few of them were simply repeated too many times for the same version of a given library (at least too many times in my opinion). But overall, an amazing course!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.034Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.845Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954f9"
  },
  "body": "A well detailed react course beyond any I've ever watched. If you want a complete react course, this is the best option I've seen so far.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.034Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.846Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954fa"
  },
  "body": "This course is fantastic! Stephen presents the topics by using diagrams that are super easy to understand and gives the details of each topic in a deep way. I really recommend this course.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.034Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.846Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e53286954fb"
  },
  "body": "course is good, too detailed at times, instructor is good, i would improve it by adding more testing and exercises, also could be of shorter length",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.034Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:42.847Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695517"
  },
  "body": "This is one of the best HTML5 and CSS3 courses on the Internet.\n\nJonas is an amazing instructor- He explains all the topics really well together with excellent presentations.\n\nYou get to learn valuable knowledge about web development and web design. You'll learn all the theory stuff and then put them into practice on ONE BIG project. After finishing this course, you will understand the process of building a website- from idea/sketch to production.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.646Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695518"
  },
  "body": "I loved this course. It dove right in to what you need to learn. It taught you the basics of what you need to know for HTML and CSS so that you can start building your own websites right away. What I recommend is to watch bits and pieces of this course and as soon as you learn it, APPLY IT, that way you can commit what you learned to memory.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.646Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695519"
  },
  "body": "Excellent course to gain working knowledge of HTML and CSS. Very detailed, methodical and step-by-step instructions to build a modern, responsive website from scratch. Lot of useful reference site was mentioned. The codinghero site maintained by the author is useful for real-world development. Was extremely happy with the course since it served my purpose. Few tidbits of JS and Jquery was added but it was easy to follow. The final bonus section on flexbox and css grid was not very useful. Few sections are however outdated and might need to be reworked. The ionicons library previously implemented with css no longer work the way it used to. The ionicons are now JS driven. This requires some changes in few sections. Not very difficult changes though.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.647Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551a"
  },
  "body": "very excellent course. i got the fuel what i need to star my carrier. but one thing i should mention that when we ask question regarding any problem i didn't get answered regarding my problem. i had to wait for long time. that is frustrating. otherwise this course is very helpful for the beginner students of webdesign.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.647Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551b"
  },
  "body": "This course has covered a lot of useful information for HTML5 and CSS3. However, the instructor should improve his ability to speak English better. Also, he should explain carefully every property of programming language for students, not just go through. Need more improvement for this course by careful explainations of everything !!!!!!!",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.648Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551c"
  },
  "body": "The material is quite dated and if you didn't take this course five years ago you're going to run into a lot of issues. Also, Jonas's assistant is quite lax in responding to inquiries regarding issues that arise. The Q&A section states it takes 48 hours to respond but it doesn't take long to realize that responses are done at his leisure. In fact, it's because of my last few interactions with his assistant that I won't be finishing.",
  "rating": 2,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.649Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551d"
  },
  "body": "The course is good. At the time of enrollment my target was for HTML5 and CSS3. Lots of area has been covered in a meaningful way. But some of the part like JQuery was not required. As a fair knowledge of JavaScript is required for that. Without that it becomes meaningless. In place of that it would have been good had other areas of HTML and CSS would have covered. Also at many places reference to eBook has been made which has been missing. It has been answered that in place of eBook website URL has been provided. Could not find all things in the website that has been mentioned. Many referenced websites have changed the way of functioning and some of them don’t even exist now. Hope course should have been updated accordingly. But overall happy for it. Only 2 points. 1. Please update where changes have happened. 2. As for this course rather than other topics (like JQuery, PHP), have more area of HTML and CSS covered in it. (This is not in negative sense please).\n\nThank you for the nice course.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.650Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551e"
  },
  "body": "A good course to start into to know about the in and out of html and css if you are just a beginner. It will help you get the feel and idea on how to start coding a website. However, the course might be kind of outdated since some of the things that you will learned will be replaced by a better solution and simpler coding commands or they do simply work but in a redundant way, thus you have to find a better solution by researching yourself or in the Q&A some of the time.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.650Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e532869551f"
  },
  "body": "Great to know about the various concepts of web development and clear cut view of how a webpage is developed as per the customer's expectatitons",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.651Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695520"
  },
  "body": "You Can teach an Old Dog New Tricks!\n\nI was always apprehensive about learning web development in the past.\n\nAfter trying a small nursery course, ‘as I call it’, Jonas’s course came highly rated and regarded in most Google searches for reviews and advice.\n\nThose great ratings were not wrong either. This course is absolutely fantastic.\n\nI love the sections on responsive design for Mobile Phones & Tablets.\n\nSo pleased I chose this course to start me on my way.\n\nThis old dog, (myself), is a 55 year old who should have studied this subject years ago.\n\nHighly recommend this to anyone starting out from scratch.\n\nI am now hooked on every element of the subject and very grateful too.\n\nBravo and Thanks,\n\nFraser.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.652Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695521"
  },
  "body": "Very Informative and learnt a lot, overwelming at times if new to this but Jonas does a good job to make this course as easy as possible to follow. Thanks!",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.652Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d52a22a3e5328695522"
  },
  "body": "The course is understandable, if you do not have experience like me in HTML, CSs and jS this course will help you understand the basic principles. The only problem is that the course is outdated and that makes you feel frustrated because you are wasted a lot of time trying to solve the problems caused by this outdated course.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:42.856Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:43.653Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e532869553c"
  },
  "body": "Je ne peux que recommander ce cours : tant sur le fond que sur la forme.\n\nMaximilian est très compréhensible et son cours est très complet : au niveau théorique c'est parfait, mais les occasions de mettre les connaissances en pratique ne manquent pas.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.449Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e532869553d"
  },
  "body": "Holy moly, I really thought I need to brush up when Vue 3 is released. But Max updated the course... for FREE!\n\nThis is top-notch education right here!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.450Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e532869553e"
  },
  "body": "¡Excelente curso, excelente instructor! Se nota muchísimo la experiencia y conocimiento del instructor, sabe explicar de forma clara y precisa.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.451Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e532869553f"
  },
  "body": "Your efforts are incredible. Thanks",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.451Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695540"
  },
  "body": "Maximilian Schwarzmüller is a great teacher to learn. He has amazing knowledge about Web Development and next-gen technologies in Software Development.\n\nHis course is easy to understand and catch up not only by his deep knowledge but also explaining very mindfully.\n\nDespite of some lessons is confused to me, it is not a big deal. I can still handle in my company projects",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.452Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695541"
  },
  "body": "This course is excellent! It coveres Vue.js theory in full. Information in all modules is well explained and structured. Though some videos should be updated so to keep the course up to date from the very beginning.\n\nMax is really a great, skilled and experienced instructor explaining everything in a very detailed and understandable way! Thanks! :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.452Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695542"
  },
  "body": "Mr. S is an absolutely amazing teacher. He goes in depth into even the smallest details and delves deep into the information, all while keeping the topics interesting and and the lectures engaging. 5/5 stars for sure. PS. His accent is also super cool.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.453Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695543"
  },
  "body": "As the title of the course already says: it is a very complete dive into Vue. The sections are split up into small and easy to follow lectures. Every section is accompanied by good example applications and one big application that can be very useful as a reference project.\n\nI bought this course a few days before the Vue 3 content was released which was added to the same course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.454Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695544"
  },
  "body": "Max explain the material with great patience and detail.\n\nThis course is very professional and deserves only 5 starts!! no less :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.454Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695545"
  },
  "body": "easy understanding, great mentor, gud exercises, useful assignments, and a good start for beginners",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.455Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695546"
  },
  "body": "Very in depth look at Vue 2/3 a as well as Vue Router and Vuex. I love how the course was updated as soon as Vue 3 was released.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.455Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d53a22a3e5328695547"
  },
  "body": "In the updated course I miss the assignments with each lecture. All the explanations are to the point and well structured. Just as a side note, do not expect Max to teach you everything, try and do stuff on your own!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:43.661Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:44.456Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695561"
  },
  "body": "I genuinely and whole heartedly cannot explain just how good this course actually is. I dived in head first, completely unsure on what to expect AND with zero experience of programming. Four weeks later, I emerge the other side, not only blown away by how amazing the content was, but with the confidence to create my own web applications. I honestly don't think I can describe just how worthwhile this course is. I'm already signing up for the senior dev course. Thank you, Andrei and Wolfgang.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.258Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695562"
  },
  "body": "It a good course that touches almost all the fields that is required to be a professional web developer. This course will not give you complete knowledge about everything that is required by the employers, but it will show you the path to reach your destination.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.259Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695563"
  },
  "body": "this course can change my whole life. so many question i have before purchase this course but at the end i found so much valuable skills that so much expensive than what we pay .\n\nAndrew are really really number one Teacher . Thank you so much",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.259Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695564"
  },
  "body": "Great course that covers all the topics you will need to grasp to get into the world of web development. Great instructor that knows how to teach so that we as the students can take out from it as much as we can!!! <3",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.260Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695565"
  },
  "body": "This is not only great course! This is much more: wide society that helps, perfect support, a lot of non-technical information about IT field (so important when you start). It learned how to solve problems not only how to followed the content.\n\nA lot of time, but it worth every minutes.\n\nThanks a lot!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.261Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695566"
  },
  "body": "The best course to understand how the internet and web applications work, without a doubt Andrei is the best teacher I have known throughout this wonderful world of web development.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.261Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695567"
  },
  "body": "I personally loved the course, the only downside is HEROKU. Not That Heroku is not Good. But there more efficient and DIFFERENT Cloud Services Like AWS and GCP which should have been taught in the Project. Heroku was so damn simple that I didn't need the tutorial.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.262Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695568"
  },
  "body": "Thank you Andrei and team for this amazing course! I can say this is more than an introduction to web development. It covers a lot that I think it is gearing towards the advanced stage which is great! I won't lie that there were concepts that I don't grasp at first but it taught me to do some work on my own like checking documentations, searching google/stackoverflow to better understand them. Highly recommended!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.262Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e5328695569"
  },
  "body": "I cannot be more happier that I bought this course, as well as finished it! I like the way Andrei teaches, except had some issues with PostgreSQL, as I was using Windows (would not like to use it on this OS). Detalized, yet still challenging, as so many useful and interesting resources for finding out myself the issues or just reading and learning! Thank you!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.263Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e532869556a"
  },
  "body": "I liked the course alot, Andrei is a good teacher but what i didnt liked he is never there to help students and students cant help other students in advanced things as they are also students . One more things I didnt liked that he attach articles all the time in his videos and always says that read from attached article. He should discuss in details those things as students comes from different background which is not programming. overall Andrei has a very good knowledge no doubt on it . But he should changed his way of teaching a bit.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.263Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e532869556b"
  },
  "body": "while going through the course it feels like i am in one-to-one training, the way you teach is absolutely amazing! Thank you so much Andrei.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.264Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d54a22a3e532869556c"
  },
  "body": "In-depth explanation of course topics. Focuses on the recent and most used skills needed to become a full-stack web developer. Provides a community to connect with other students and open-source projects.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:44.463Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:45.264Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695588"
  },
  "body": "You are a very good teacher that you can explain difficult concepts very well. Appreciate your effort to make animation to illustrate some of the concepts. The last few section on jQuery is quite difficult and I need to watch it a few times to fully grasp how it works. Still, more examples like this are worthwhile.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.063Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695589"
  },
  "body": "very mush worth for time, I would highly recommend this course, Amazing course, with a lot of aha moments, as Tony says.\n\nThe only reason for leaving out one star on the review is \"the course has to be updated\".",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.064Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558a"
  },
  "body": "Learnt a great deal without any prior knowledge of JS. The best course I have found out there. Very well done Tony, thank you :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.064Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558b"
  },
  "body": "This course made me think about JavaScript in a different way. It provided beautiful insight on topics about OOP, functions, execution contexts, lexical environments. The teacher has a big knowledge about JS and helped a lot, helped me to understand the subjects I mentioned above, because of his beautiful way of explaining things. He sounds very confident and clear, and with just a little amount of focus when listening to him, You can understand each topic nicely. I recommend this course to anyone, especially beginners.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.065Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558c"
  },
  "body": "It was a very informative course. I, even as a beginner, was able to understand the topics so well. It was detailed and explained very beautifully. Thank you.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.065Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558d"
  },
  "body": "Desde que vi los primeros conceptos en el video inicial se aclararon muchas dudas, gracias por darnos acceso a esa informacion.\n\ny por supuesto quiero agradecer al profesor Anthony Alicea cuyo excelente estilo y pasion por educar nos lleno de profundos conocimientos.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.066Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558e"
  },
  "body": "Curso bien explicado, con detalles de las cosas que pueden ser complejas y \"obscuras\". Recomendado para principiantes e intermedios.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.066Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e532869558f"
  },
  "body": "I learned a lot about JavaScript! Being JavaScript my first programming language to learn it was challeging but also fun going in depth into the concepts of object oriented programming. For me the content of the course was dense, but being able to understand it finally was satisfying. The teacher is often repeating the same thing using different phrasing, which might help to double check if someting is clear, but for me sometimes it was a little confusing.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.067Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695590"
  },
  "body": "WOW!\n\nThis course is amazing, I've been using javascript for a long time, and this course was the missing piece of the puzzle for me to truly understand how it works.\n\nThis course is not for beginners, you won't waste your time learning how to make a for loop. If you already know the basics, it will take you to a completely different level, even if you think you know javascript well.\n\nThank you!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.068Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695591"
  },
  "body": "Amazing, i have tried to read many books to understand Javascript but end up with many question marks. But this course open up my mind and give me bright undestanding. Make something sound very complex to soo simple. Tanks for you Tony. I hope you make more course around Javascript full stack like MongoDb, Express, React-ReactNative, and Nodejs.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.069Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695592"
  },
  "body": "Me parece que he hecho una excelente elección. Es el curso que buscaba sobre JS. Agradezco a Anthony por todo lo que aquí he aprendido.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.069Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d55a22a3e5328695593"
  },
  "body": "This is by far the best course on Javascript that I have come across. I'm not even halfway through the course and I've had like 9 \"aaaaha\" moments. If I had taken this course sooner. I would have saved myself \"weeks\", literal \"weeks\" worth of time at work (I am a full time web developer coding primarily in JS for a little over the past year) because the concepts discussed in this course are fundamental to debugging (production) code! I'm excited for the rest of this course.\n\nUPDATE: Halfway through the course, it's important to run some of the code in the console to see the differences in how JS works now as compared to when Anthony taught the course. Such a gem of a course, I love how it's focused on the bare bones of how JS works under the hood! Every serious JS programmer should attempt to learn the concepts in this course. Love it!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:45.275Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.070Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955af"
  },
  "body": "Thanks Jose for the in-deep walkthrough web development with Django in python.\n\nI can only provide positive appreciations for this course. well structured, lots of relevant examples and excellent explanation. I recommend this course although further development of skills is needed to be a complete full-stack. Farewell.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.877Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b0"
  },
  "body": "This course gave me a good grasp on Django and kept me engaged the entire time. Jose is an excellent instructor. Highly recommended for anyone interested in Django.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.877Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b1"
  },
  "body": "Very good course, shame it movies are not updated with new versions of django and python, but it actually forces you to search for yourself through the documentation and webpages, to fix some issues, therefor makes you remember and understand more. Well done and thank you! And this is not a big issue, just few minor changes, so it is pretty awsome to encourage to update yourself with new knowledge",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.878Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b2"
  },
  "body": "There is a lot in this course and he covered them all very well. The good part is ,everything he live coded and that make things clear .I feel this course gave me way more knowledge than i paid for this.Thanks a lot jose for publishing this course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.879Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b3"
  },
  "body": "With this course i can make my own site, with a lot of tools and options.\n\nThe didactics of the classes are easy to understand, being a great django course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.879Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b4"
  },
  "body": "Covered all the basics of django And front end components and also touched some of the advanced topics in Django. After taking this course I was able to do anything in django. I made a video blogging website with help of statckoverflow and my django knowledge and also I made a web app for weather by using Apis. After that I took the courses to advance my django Skills like using rest framework. Rest is not included in this course but ITts the basics you require of django. Its filmed on django 1 but I used Django 3 in my time and there was literally no difference except some minor hiccups which is also covered in course notes.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.880Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b5"
  },
  "body": "I was able to get a front to back site up and running on PythonAnywhere. So there is a lot of amazing material. However, since the course is old the tech versions are old and it's in the Django part that it becomes a problem. Many frustrating hours spent trying to figure out syntax.\n\nNow it seems that the Django_Course_2.xx has corrected syntax! Especially URL mappings, Bootstrap versions, Glyphicon classes, django import modules, etc.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.880Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b7"
  },
  "body": "Material is outdated for newer versions of Django and rest of stuff. There should be clear notifications in videos when the method or working procedure has changed. Also the games programmed in this course like connect four and war card game have major flaws in their code. For some reason the author of this course chooses not to answer any of the questions in Q&A regarding those games so students have to figure out the answer themselves.",
  "rating": 2,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.882Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b6"
  },
  "body": "Basically, this course just like 'follow me typing the code'. It doesn't give enough explanation. After all, you need to figure out almost all the theory behind the code by yourself.",
  "rating": 2,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.881Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b8"
  },
  "body": "Lack of explanation in many ways. It's really tedious to watch the tutor type each word during the coding without high level structural guidance. The logic is not clear to me especially in the projects part.\n\nThe Django version is also outdated. There are a lot of updates on the usage but you won't know when you learn along with the course. Not recommend beginner to choice this course.",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.882Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955b9"
  },
  "body": "Thanks Jose! The best part is, the course content is well structured and advanced topics were also covered and the explanation was just WOW!!.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.883Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955ba"
  },
  "body": "So, It was both challenging and exiting, Jose an amazing teacher and he and people what responsible for help in Q&A form really doing great job, especially Abu Sayeed!\n\nAnswering to someone question you sad \"Don't lose your patience. Programming means all of problem and problem needed the patience to solve it.\" - what are great words? ... after that, you and some people started to help with solution of that God Damn it Misaka installation problem! That words really helped me out, to stand up and keep going!\n\nSo guys, I am honestly thankful for support, and help!\n\nYou are my heroes!\n\nReally great course full of knowledges and details!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.079Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:46.884Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955d6"
  },
  "body": "Nice course, he talks a little slow but that's okay. I watched the whole course in 1.25x lol. Great explaining for most of the things. The example projects were really good. My guy really put effort on this course! Feel free to buy!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.686Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955d7"
  },
  "body": "When I started, I did not know anything about CSS except some few terms here and there... Many times it was tough, but now I know a lot in CSS... thanks to Jonas' teaching style and effort he has put in the course, he has made sure that he touches every thing out there and did his best to teach us and I know I have got a very good foundation after completing this course, but still I need to put in hard work to reach a level where it becomes second nature for me. He is really good and taking his course always ensures that we become best in the subject. Looking forward to more newer courses in future from Jonas.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.686Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955d8"
  },
  "body": "One of the highest quality courses I've ever purchased. Thank you, Jonas! You're the man",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.687Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955d9"
  },
  "body": "Amazing course from start to end. Jonas keeps you impressed, I can really say this is the best css and even front-end development resource on the internet. The theories are perfect, the projects and big scale and real world. This course helped me like CSS and I no more struggle with archtecture, responsive design, performance.\n\nThank you Jonas",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.687Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955da"
  },
  "body": "Great course. The explanations were done very well. I would recommend this course to anyone from beginner, or someone wishing to refresh their knowledge and skills.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.688Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955db"
  },
  "body": "I am writing this review while finalizing the 8th section of this course. If you want to really understand CSS, how things work, and why they work the way they do, then this is the course for you! What I specifically liked about this course is its organization, the fact that the instructor does not shy away from explaining the logic and the math behind concepts, and the richness of the proposed projects. I am so glad that I have taken this course and I am satisfied with the immense progress that I have achieved towards my goal.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.689Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955dc"
  },
  "body": "Awesome lecturer as well as awesome course material. Very details explanation and the lecture try do teach as simple as it is to make you understand. He start from simple one and then gradually move onto the complex one. Awesome course, recommended.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.689Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955dd"
  },
  "body": "What an amazing course this was! I thoroughly enjoyed learning it and gaining the bundle of knowledge from it.\n\nThis course contain loads of information and knowledge you can use in building beautiful projects and add values to your portfolio.\n\nFinally, Jonas is a great teacher, explains every small amount of detail and helps clearing your doubt again and again until you understands it. Really worth doing this course and also highly recommends it to everyone. Thanks a lot. Jonas.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.690Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955de"
  },
  "body": "2020 ... my opinion is .. dont think about it buy the course , amazing projects where we you can apply css/sass flexbox, grid css and get good foundations for bootstrap(know your s..it).",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.690Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955df"
  },
  "body": "I truly love this course, and I also really enjoy how Jonas teaches and passes his knowledge to his students.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.691Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955e0"
  },
  "body": "Great course, very good content, nice projects, all is very well explained, I learn a lot of very useful tricks and best practices. Highly recommend.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.692Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d56a22a3e53286955e1"
  },
  "body": "Thank you so much Jonas sir for such an amazing course...",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:46.894Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:47.692Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e53286955fb"
  },
  "body": "The thing made me like this course most is your specify exercise, you are so amazming, I am learning and try my best to complete this course, thank you so much!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.493Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e53286955fc"
  },
  "body": "This has been a really challenging course where I've had to push myself to learn and bridge the gaps.\n\nI would say it isn't exactly a beginner course, it's more of a high level beginner low level intermediate course.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.493Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e53286955fd"
  },
  "body": "An excellent course with a lot of knowledge to share and with a good explanation I like Mosh tutorials because he programs focusing on develop extensible applications including a lot of resources. I hope you put the advanced course in udemy and one of blazor.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.494Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e53286955fe"
  },
  "body": "The working with Data section was frustrating. EF should not be introduced at this stage. In my opinion this was bad decision to put EF in this course.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.494Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e53286955ff"
  },
  "body": "Great explanations!!! Enjoyed. I also use this as a reference.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.495Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695600"
  },
  "body": "It was a nice course and covered all the topics. I didn't give a 5 star because of the lack of explanation on exercises. It will be nice to have step by step explanation. Without explanations, when you stuck on some part and check out the real code, you can make mistakes on implementing.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.495Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695601"
  },
  "body": "I like your way of teaching, It was very helpful to me, by your lecture I know only how to write the program but you didn't teach how the program is internally working, so please focus on that",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.496Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695602"
  },
  "body": "It was extremely good course in terms of content and exercises and material full of technical hands on.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.497Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695603"
  },
  "body": "Thank you so much, Guru G :). It was an amazing course. The contents and presentations are impressive. Just want to say that deployment section could be better with a live example. thanks again!!!",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.498Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695604"
  },
  "body": "I feel the course started with high quality details on every step taken, and ended with poor details and lots of concepts taken for granted. The two final sections were very hard to follow for an ASP.NET MVC course thats starts with the basics.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.498Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695605"
  },
  "body": "Very good for beginners, I gave 4.5 - there are minor confusions with what is presented after exercises in later videos and source on github and also there was no lecture addressing fixing previous migrations (meaning those in development), since a newbie can spend a lot of time googling \"I ran update-database on my broken new migration, help\".",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.499Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d57a22a3e5328695606"
  },
  "body": "I think Mosh is a great instructor and like his presentation style as well as his outline of the big topic, MVC in this case. I would caution others that following his examples step by step can lead to some mistakes on the student's part. For example, I had a leftover @model statement specifying the random movie view model, and when I first tried to do the section 2 exercise, I got a blizzard of errors that were hard to understand. He should give people a basic setup or send-off for exercises with a \"don't forget\" piece of advice or two. That would not compromise the challenge that he wants the student to face.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:47.701Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:48.499Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695622"
  },
  "body": "amazing content..",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.302Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695623"
  },
  "body": "Anthony is amazing is the second course I am taking with him and I hope he will offer more",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.302Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695624"
  },
  "body": "Very good explanation with examples on Node. I liked the focus on concepts and explanations of what is happening behind the scenes.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.303Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695625"
  },
  "body": "I enjoyed the course, as someone who is a beginner like me when it comes to NodeJS this course was a great starter for me. I like how the course didn't just tackle through coding NodeJS, but establishing some basic/fundamentals of JavaScript like the 'inheritance'.\n\nThat kind of approach made me appreciate and understood well how NodeJS works under the hood. Honestly, I bought also a different course but with an advance approach and see if I could follow it, but some of it was a bit confusing to me. But know after taking this course I am now have a pretty good understanding and I am ready to take more advance course because of this. Thank you for making such a great course with good content.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.303Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695626"
  },
  "body": "Course ends abruptly: where is \"Adding a front-end in Angular (Part 2)\"? And despite the fact that this is an extremely outdated course, that was a good experience for me and I learned a lot of new things anyway.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.304Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695627"
  },
  "body": "Course was very well structured and instructor has focused on core concepts in a very good way. Only reason I have not made it a 5 star is that I was expecting Streams and Custom Middleware implementation to be incorporated into the final project. But very well done overall !!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.304Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695628"
  },
  "body": "O curso se aprofunda bastante em como a tecnologia funciona e explica bem claramente a maioria dos conceitos. Porém infelizmente o curso parece que não foi finalizado, faltaram vários itens para finalizar o projeto final.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.305Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e5328695629"
  },
  "body": "This is fantastic course. It offers incredibly clear explanations of underlying concepts that get glossed over in more \"advanced\" courses. Importantly, Anthony builds for you a mental map that maps closely to Node itself, helping you remember, via understanding, the derivative concepts and techniques that you ultimately implement in real-world applications. The explanation of Node's event emitter alone is already worth ten times the price of the course. I wish Anthony would produce other, similar courses on full-stack development. such as in Vue.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.305Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e532869562a"
  },
  "body": "The course was really good as it has really built up a nice foundation for me regarding backend development in Node.js the only downpoint for the course was that it isn't updated to the latest version and/or methodologies that Node has added to itself. Regardless of that this course is really good to have a concrete and basic understanding how Node.js works under the hood.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.306Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e532869562b"
  },
  "body": "This guys is properly one of the best instructors out there.\n\nI hate when instructors don't go into depth on a topic....it infuriates me; as I have to go and dig in deeper on a topic, basically paying money to go do extra research...\n\nThis guys really hones in an every topic, leaving no holes in his lecture. well- done.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.306Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e532869562c"
  },
  "body": "Explained All the Concepts Very Well. This is a very good course. Tony is a great instructor. Thank you Tony for helping the Students, IT Professionals. Stay Blessed.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.307Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d58a22a3e532869562d"
  },
  "body": "it was a nice course, covered many areas I needed and the teaching methods were topnotch.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:48.508Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:49.307Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695647"
  },
  "body": "Learn lots of things regarding micro services and spring cloud. Thanks Ranga! for this excellent tutorial",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.113Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695648"
  },
  "body": "I would like to say thank you for this course. Especially, up to date modification section for updated version. Actually, I have joined for this course because my new project using API at my work place, and this course really helpful to me.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.114Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695649"
  },
  "body": "Many Spring cloud topics are not covered. The course name should be Spring cloud basics and not - \"Mastering\" microservices with cloud. Also, asked few questions but did not receive any response.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.114Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564a"
  },
  "body": "I was anxious when I took the course at the beginning thinking I would understand it intact. But the course exceeds my expectation with hands-on coding and understanding from the elementary to important concepts. Thanks for the course and I really enjoyed studying the course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.115Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564b"
  },
  "body": "Trainer had very well explained through out the course and the course content was also helpful. It helped me a lot to get more knowledge on Spring Boot and Spring Cloud Course. I'm grateful to the trainers Mahi, Ranga,Helen for all your assistance whenever i raised a query. Especially, many many Thanks to Ranga for the great course especially to assist me and providing with an exposure on lot of concepts.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.116Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564d"
  },
  "body": "Instructor is has a good teaching skill and is well versed with spring framework. Video's are short and upto the point.\n\nTitle is misleading... The course is mere introduction to microservices, the core microservices concepts were taught for less than 2 hours. So it lacks depth.\n\nWe can call this course a great introduction to microservices nothing more. Failed to explain different architecture patterns eg. event driven architecture, etc.\n\nFailed to explain the configuration of components like rabbitmq, zuul,etc.\n\nits incomplete, most of the course content appears to be re-purposed videos from previous courses.\n\nYou wouldn't be able to deploy any real world project after this course.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.117Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564c"
  },
  "body": "Very good explanations , would recommend anybody looking to get started with spring microservices / jpa",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.116Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564e"
  },
  "body": "Examples are good. but need to explain why each component designed in spring boot and what are advantages and what components it replaces currently in market",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.117Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e532869564f"
  },
  "body": "It was a great learning experience. I enjoyed the course, it was very detailing. Though I had experience in developing microservices using spring boot, this course helped me to understand the basics in detail. I would recommend this course if you want to understand the basics of spring boot and spring cloud. Thanks Ranga for the amazing course. From my side it is a 5 star.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.118Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695650"
  },
  "body": "Straight forward lectures. Well presented. Use the dependencies he is using even though it is a little out dated. It will make the course easier to follow.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.119Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695651"
  },
  "body": "All the concepts together at one place helps us a lot. One issue is that all the codes are not fully updated like few codes are deprecated and not working and giving error and we are clueless how to fix it easily. Needs updated code in Notes section would have been great.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.120Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d59a22a3e5328695652"
  },
  "body": "I have attended this course after having already studied on my own and worked on most of the topics. The course was very useful to put order in what I have studied and to acquire more confidence in applying this knowledge in the practice and to compare my experience with that of the trainer and other students. I have appreciated the way the course has been prepared, the sequence of the topics, the completeness and the way it is updated following the evolution of the frameworks.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:49.316Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.120Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e532869566e"
  },
  "body": "I really enjoyed this course, especially for its practical setting. After this course, you can do a lot independently.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.922Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e532869566f"
  },
  "body": "Another great class from Brad Traversy. This is the second class of Brad's that I have taken and I have no doubts about taking another. Thanks.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.922Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695670"
  },
  "body": "Brad is the best of the best instructors. He explains in detail to learn, what do, and how to do it. There are many instructors out there but not as good as Brad. Do what is expected of you in terms of instruction and you will be ahead of a lot other programmers in terms of knowledge.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.923Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695671"
  },
  "body": "I purchased this course 2 years ago but finally commited to sitting through it from the beginning to the end. I really wanted to sharpen up my JavaScript skills before learning a framework and I'm glad that I took the time to do it. Brad is a great instructor and he explains things very well.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.924Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695672"
  },
  "body": "This course was great overall. I didn't go for five stars though because there are some areas that I thought were badly explained and I had to go elsewhere for a lot of information (particularly around what prototypes actually are and how promises actually work). Also, it seems that so much of JS is passing parameters into functions, and defining those parameters using arguments wherever that function is called. This distinction between parameters and arguments never actually gets explained on this course: you have to figure it out for yourself. The final two projects were EXTREMELY well explained, and it would have been great if the whole course was explained to this level. Overall though, I'm really happy with what I got out of it.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.924Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695673"
  },
  "body": "The course is very well executed. It was helpful to me as a beginner, it gave me a better understanding of Javascript. Following the mini-projects in the course gave me the confidence to tackle more complex Javascript projects.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.925Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695674"
  },
  "body": "Brad is a really great instructor. He explains everything so well. I loved this course. Thank you so much for taking time to make this course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.925Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695675"
  },
  "body": "Brad knows this material well, and it shows. I'm impressed with his level of knowledge and his innate ability to teach. I'm a professional dev brushing up on my skills, and I can't say enough good things about this instructor. Thank you.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.926Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695676"
  },
  "body": "Positives:\n\nThis course is pretty extensive in terms of the number of topics covered.\n\nSupport provided for this course is pretty decent.\n\nI like Brad's code along approach, because if you write even 10 lines of code just to test out a concept (and save it), then you are more likely to remember it and you can always come back to it for revisions.\n\nWeaknesses:\n\nToo many loose ends, too much googling and mdn browsing in a course i paid for.\n\nSmall errors in explanation here and there can lead to hours (in one case days) wasted on googling\n\nWhats more, Brad very cunningly tiptoes past the topics he wouldn't or couldn't explain like closures. Yeah a JavaScript course without a mention of closures.\n\nNo word about apply, bind or call functions.\n\nHe used filter function late in lecture 98 in a wrong manner which just by luck worked for the example he was working on. So cannot even expect the explanation there.\n\nIncomplete coverage of the the spread operator.\n\nFor...of loop (without any introduction) was used for the first time in the lecture on sets in section 10.\n\nIn the last section, he just tells to download the webpack+babel setup from his GitHub profile without explaining how he created it.\n\nThe list is too long.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.926Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695677"
  },
  "body": "I struggled learning Javascript coming from a career with no programming skills needed or experience. I tried other videos and online courses and to me, it seemed like they were made from the perspective that people had previous programming experience and wanted to learn how to program with Javascript. The focus was mainly on just how to write functions, arrays, and objects and not seeing any results of this outside of logging things on a console. These lessons for the first time showed me how JS can manipulate the DOM, methods for targeting HTML in a webpage, creating OOP, modules, patterns, and lots more so I finally could see what JS was doing when related to working on webpages for front-end work. The small projects are super helpful, and helped me to really understand the language while both coming together and in the final product. I will definitely be revisiting these videos for practice and test how much more I can do independently as I progress.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.927Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695678"
  },
  "body": "Fantastic course. Brad is so knowledgeable and a brilliant teacher. The way the course comes together towards the end and draws everything you have is really great. I am definitely feeling more knowledgeable and comfortable with Javascript and it's concepts.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.928Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31d5aa22a3e5328695679"
  },
  "body": "It is very good course to learn modern javascript. If you don't know anything about js then you can definitely go with this course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:18:50.130Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:18:50.928Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdea"
  },
  "body": "This is the best course I’ve ever attended so far. Angela has taken so much effort to make this an exhaustive course covering all aspects of app development including minute details like Xcode shortcuts, best practices, useful websites etc… I really liked the way Angela talks with her soothing voice.\n\nI would highly recommend this course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.444Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.314Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdeb"
  },
  "body": "Oh my God, taking this course was pretty much like giving a glass of water to somebody living in hell, I mean with all these options you got, going to college, books and all that stuff there is no other person as good as a programming teacher as Angela, I've poured thousands of dollars on trying to learn all this stuff in college but it's been just a waste of money and time. 100% recommended, learning iOS development really changed my life in a big way tbh!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.444Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.315Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdec"
  },
  "body": "Great and simple, will recommend. A lot helper and solution, it teach step by step need to be patience.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.444Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.316Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bded"
  },
  "body": "I loved taking this course. Angela is a great teacher. The only criticism that I have is many of the sections were slightly outdated. I understand that redoing a whole 60 hour long course every time something changes isn't ideal, but there are a few things that could have been done to fix this issue. Maybe in the sections that were outdated, there could be a final video explaining how to solve any issues that we might have had during the section. Of course there was always the assistance provided by the Q&A, but they didn't always help. Overall, a great course with a wonderful teacher that I will be grateful for.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.444Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.317Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdee"
  },
  "body": "Brilliant pace, very clear and easy to understand. Being a student that is foreign to the computer world, I have found it very easy to follow along with these classes.\n\nMy one and only suggestion would be on each section it might be a good idea to do a summary on everything that has been taught in that particular section to summarise the content to the students.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.318Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdef"
  },
  "body": "I loved it! Angela broke down all of the hard concepts that I was struggling with in other courses. The fact that she put in bonus modules such as app design and marketing is incredible. Most courses don't include these topics, so the addition of both modules are very generous of her and her team at App Brewery",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.319Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf0"
  },
  "body": "Just one of the best learning experiences from Udemy.\n\nI particularly love the analogies used by Angela In order to learn new concepts and techniques.\n\nI also believe this is non native English speaker friendly, most of the courses out there speak very fast English and Angela does at a good pace.\n\nOther things that I've loved about the course.\n\nVery fun projects.\n\nGood practices.\n\nReal technology stack used by companies / startups.\n\nAcceptable length per video.\n\nGreat community.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.320Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf1"
  },
  "body": "It was amazing experience for me .The course gave a good refresh of certain aspects of app development . Coming from the android app development background i was able relate and distinguish in most of the sections . It was an all in one package for a beginner in IOS development.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.321Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf2"
  },
  "body": "Ce cours correspond tout à fait à mes attentes. Très bien présenté, très interactif et au combien intéressant. La formation prend du temps mais cela en vaut la peine, un débutant peut en apprendre énormément. Beaucoup de ressources sont mises à votre disposition et cela je pense prépare très bien un lancement de projet ou une idée d'application iOS. Merci Angela.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.322Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf3"
  },
  "body": "Angela's explanation methods are really good(perfect for me!). She for sure tried her best to create this course. Many thanks for creating this course, Angela! :-)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.323Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf4"
  },
  "body": "Amazing course, it doesn’t get much better than this for this price it’s a steal, Angela does a really good job explaining things, worth every cent!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.325Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31daf0ca80d3cdc13bdf5"
  },
  "body": "The materials and the coordination of what to learn, work on, improve upon and retain are remarkable. Angela, and whoever else helped put this course together, did an excellent job and truly understands how a person learns and retains challenging material! The additional Bonus material, was just that, a BONUS! The information provided was worth many times more than what I paid to take this iOS course. Angela, thank you so much for sharing your knowledge, efforts and experiences!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:15.445Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:16.325Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be10"
  },
  "body": "The start of the course was definitely not for a novice. You need to have prior knowledge of react and basic js, html, css and all that. Later on when the course deviates to older version of react-native, which deals with class components and redux, Steven does explain the basics of react-native. So if you are a newbie you should start from there.\n\nLastly I want to say that the Context and useReducer were complicated topics for me. But after doing it 3 - 4 times inside the course, it became clearer. This course was really useful for me and I would highly recommend it. And I would do the advanced version of this course also. ?",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.179Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be11"
  },
  "body": "Contents are very old from the part where Stephen starts React-Native CLI. Most of the things working good and lots of troubleshooting required. Thanks to discussions and tech helpers. They solved everything.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.179Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be12"
  },
  "body": "A must course for any mobile or webdeveloper who is interested to do react native programming.\n\nThe instructor also covered few extra topics including node, express, authentication which were informative. A 38hrs course, but every minute is worth. Also practice while learning.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.180Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be13"
  },
  "body": "All the initial tutorials have demo code attached to it. After that there are lots of tutorials which are outdated and don't have tutorials and hard to find a compatible match on the web.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.182Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be14"
  },
  "body": "Grider's way of teaching is VERY GOOD for me. He clearly lays out the building blocks of each topic in every step of the way and goes through them clearly and effectively. You'll never feel lost. He also likes to make sure you grasp the reason behind doing certain implementations instead of simply showing a how-to.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.184Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be15"
  },
  "body": "This course is not updated. In the last app, I spent most of the time fixing bugs. Its better to go through medium/blogs to build small apps",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.185Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be16"
  },
  "body": "The question asked in qna are not answered, to be precise they are ignored, After you have asked 3 questions. But Stephen has thought this course really well. He is a good course Instructor.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.186Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be17"
  },
  "body": "I did this course time ago and was different at that moment. I really appreciate that Stephen constantly updates his course, because the frameworks and tech also constantly changes. And obviously the content is great",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.186Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be18"
  },
  "body": "so detailed in his explanation of concepts.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.187Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be19"
  },
  "body": "the course is good the instructor explains things very well but after the expo part when the course move towards native CLI it's a really bad experience we should not buy a course in 2020 which say 2020 in its title and learn some ancient code. I didn't expect it its a horrible experience, if you don't know react.js don't take this course if you know react also you are going to have a very hard time",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.190Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be1a"
  },
  "body": "this course is too good, videos are short and to the point. Teaching experience is well and covering every point with detail.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.191Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db00ca80d3cdc13be1b"
  },
  "body": "While the first 50% of the course is good, it uses an old version of react-navigation (v4), the other 50% is just an old course recycled and sold as \"the old way you should know about so companies using deprecated libraries find your profile more attractive\".\n\nDespite Stephen is a great teacher and the course content is worth it for the low price you pay for it, I felt a little bit disappointed finding out once you reach 50% progress of the course you are done with it. I think this should be more detailed in the course description, saying that half the course is deprecated.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:16.348Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:17.192Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be35"
  },
  "body": "Good course, Angela is the best online teacher that I've ever found!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.210Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.030Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be36"
  },
  "body": "It was such a fun course! The course covered such a wide base of the foundational tools and concepts that you will be able to expand to develop any app.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.032Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be37"
  },
  "body": "While it's now kinda out of date, I took it a few years back and it does an amazing job of introducing beginners to Mobile Application Development. The projects are incredibly helpful and the instructor is engaging.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.033Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be38"
  },
  "body": "I was really impressed with not only the programming aspects of this course, but also the design theory, business development and self improvement aspects as well. Angela is a very impressive instructor and after seeing how great this course was, I would not hesitate to take any of her other courses.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.033Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be39"
  },
  "body": "Angela explica muy bien y de manera didáctica. El curso está bien estructurado de lo mas simple a lo complejo abarcando un montón de temas. Cualquier persona puede aprender sin importar su nivel de conocimiento en programación. Muy recomendable!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.034Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3a"
  },
  "body": "Too much talking about stuff that is not really about the coding. Also sometimes the to do and logic isn't presented in a smooth order, having to redo code is just annoying.\n\nWould be better if there was an overview of the code first, so one knows which steps there will be, not just seeing the end product of the app.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.035Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3b"
  },
  "body": "Angela is hands down the best coding instructor I've had on Udemy. Her lessons and course exercises are structured in such a way that it is easy to understand, without being too slow or too fast-paced to follow along with. She breaks down really complex concepts into simple, understandable chunks. As icing on the cake, her sense of humor is delightful!\n\nThis course not only demystifies Swift and XCode, but also teaches really important concepts like the Model/View/Controller pattern and Github. Good lord, THANK YOU Angela for including Git in this tutorial. It's ridiculous how many coding courses Ive taken with no mention of it at all.\n\nMy only problems with this course are that sometimes the audio cuts and repeats, or sometimes she dives into using a concept that she has not yet explained and then goes back to explain it in a later lesson. ALSO- I would recommend grabbing the latest version of the course for iOS 13 if you can, because some things are out of date in this course.\n\nOther than that, I have no complaints. Angela is truly awesome and if you have the discipline to get through the course, you will learn a ton even in the first 20 hours. My only other wish is that there would be some bonus lectures on NFC encoding but I can understand why its omitted since you need an iPhone X or later plus NFC cards/wristbands to read and write NFC with an app.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.036Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3c"
  },
  "body": "Keeping the focus on the understanding of the concept and allowing the more technical skills to raise naturally by doing the codes.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.036Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3d"
  },
  "body": "I am learning a tremendous amount from this course work and have been overall very happy with what I am getting out of it. I have had some difficulty with some of the lessons not working since it looks like I am using Xcode v 11.0 but I have still managed to learn quite a bit. I think Angela is a very clear communicator and I have enjoyed her videos very much! I will plan to take more classes once I have this completed.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.037Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3e"
  },
  "body": "I am enjoying the content. Learning here is really interesting and easy to catch. Thank you.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.038Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be3f"
  },
  "body": "Done till Section 9, so far has been 5 *s. Thank you!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.039Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db10ca80d3cdc13be40"
  },
  "body": "This instructor makes me feel like I’m taking a class in person. She doesn’t just give definitions of concepts but explains them with real world scenarios. She, by far, goes more in-depth then any other online instructions I’ve scene, meaning coding in swift for iOS is just not coding, she dives in to swift UI apple playground API the whole thing and she does it one step at a time. I really love this curse.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:17.211Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.039Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5a"
  },
  "body": "This is a perfect flutter course. I took this course last year and it is the only course I have taken on flutter. I got an offer as a flutter developer last month. Max is a perfect teacher. I always go back to his courses whenever I want to learn or refresh my memory.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.859Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5b"
  },
  "body": "Excellent course. There were one of two moments I felt the didactic wasn't clear enough, but these were really an exception. Overall, a great course. Highly recommended! Thank you, Maximillian Schwartzmuller!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.861Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5c"
  },
  "body": "This course is amazing. It took me from zero to one in Flutter. The way the instructor teaches is so amazing and things were on point. Great course.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.862Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5d"
  },
  "body": "Very in depth course covering a lot of concepts. the instructor takes time time to go into details and offers great explanations.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.863Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5e"
  },
  "body": "i also take other flutter course which give me good flutter understanding but this course is more advance in nature according to me some more effort could be given to clear basic thing like in Map , List and there function which are base for any flutter project but overall it is good course\n\nso THANK YOU SIR for this awesome course",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.864Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be5f"
  },
  "body": "Firstly Max is expert and he is always updating the course so i don't have to worry if there is something new and i don't know about it, plus Max always shows us an alternative ways so we can be more into the flutter and dart language.\n\nSecondly sometimes Max speaks too fast when he should say it as slow as he can so we can get what he means in the same time we can understand it .\n\nBut Overall the course is unique :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.864Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be60"
  },
  "body": "Overall course is good and gives complete overview of the flutter app development. This course will give heads up to start app development on your own.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.865Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be61"
  },
  "body": "I have taken a few different courses on Flutter now, but I have to say that Max has gone above and beyond. His recent updates have made it an excellent resource and the best course overall for learning Flutter. Be prepared to be challenged, but if you work through the course you will be quite knowledgable by the time you are done.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.865Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be62"
  },
  "body": "It' s a good course content however i would suggest you incorporate lesson challenges at each interval instead of just coding all along. It helps challenge we the students",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.866Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be63"
  },
  "body": "It was really good as I had little knowledge of Java but still, I learnt a lot. I would have loved you to include editing and category in expense planner, and one to one chat in chat app",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.867Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be64"
  },
  "body": "Fantastic course! The videos were incredibly in-depth and covered a breadth of topics that are enough to make one feel confident building their own apps. The only suggestion I would make is to include a short module on automated testing.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.867Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be65"
  },
  "body": "Well, I am a pharmacist and i am taking this course because i am interested in this field. The instructor is highly professional in delivering this kind of knowledge. I strongly recommend this course to anyone who wants to be professional at developing mobile apps.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.055Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:18.868Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be81"
  },
  "body": "This is one of the most complex and useful Udemy course for Android development. Even if most of the projects are no more compatible with the actual Android Studio 4.x version, you can still follow the videos with some workaround. For anyone who wants to follow this great course I saved my projects source code fully compatible with Android Studio 4x at this link: https://github.com/mathexa/Complete-Android-N-Udemy-course-for-Android-Studio-4",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.882Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.692Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be82"
  },
  "body": "It was an Amazing course. Just Loved It......??\n\nAt the beginning had not much idea of android. But after this course with confidence i am able to build my android apps.\n\n#Just Android things.\n\nThanks to all the instructors for guiding!!!!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.882Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.694Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be83"
  },
  "body": "awesome experience in learning, highly recommend to any learner across globe :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.694Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be84"
  },
  "body": "This is a best course I have learned on this platform \"Udemy\" thank you so much Rob Percival for your effort and your care\n\n:) شكرا جزيلا",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.695Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be85"
  },
  "body": "Great course. I actually understand what is presented to me.\n\nI was a total beginner some 95 lectures ago. Now I am confident that I will be able to create the App that I had in mind when taking the course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.696Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be86"
  },
  "body": "Very knowledgeable, Rob's way of teaching is very good, I got to learn a lot of things about Android from this course. Highly recommended for all who are starting their career in Android Development.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.696Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be87"
  },
  "body": "So far this course has been great. I waited a little too long to start it, so some of the information is outdated, but with a little extra research I've been able to figure out the current ways to do things. The lessons are relatively simple, but the challenges are fun to figure out, and there's no worry if you can't do it, as the explanations are always clear. Definitely a great starting point for someone who hasn't done app development. It might be harder for someone who hasn't programmed in java before.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.697Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be88"
  },
  "body": "This is a horrible app development training. It teaches you all the worst practices in coding. He is con man. He uses big name to promote his class but he never really teaches you anything worth while. For example his \"WhatsApp Clone\" section is just a dial box with no features at all. That goes for everything else. I went though the whole thing and it is not worth a penny. Don't waist your time nor money",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.698Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be89"
  },
  "body": "It does not include best practices of code and standards. This course is relatively Android N and Location Service upgraded to Fused Location Client. It does not have what are the updated API in the Android N version.",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.698Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be8a"
  },
  "body": "Cons:\n\nAverage, not all concepts are updated, faced many problems with outdated versions.\n\nPros:\n\nMany real life apps are created in this course.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.699Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be8b"
  },
  "body": "There is almost no information on how to build a modern (or any proper) user interface, with smooth transitions and data movement. Applications in the examples are non-scalable :/\n\nSuitable for total beginners only.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.700Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db20ca80d3cdc13be8c"
  },
  "body": "If is someone winning at final(the last sign r x y) ... it throw us the draw pop-up.... + we don't recieve any answers to the question we've put ....",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:18.883Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:19.701Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13bea6"
  },
  "body": "I would like to geniunely thank Dr. Angela for this course, she has really nailed this one. Just from finishing this course, I'm confident with my Flutter skills. I believe some familiarity with OOP would help you with this one though.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.713Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.521Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13bea7"
  },
  "body": "This course felt simply amazing! The pacing was spot-on, and I felt the ramp in difficulty was never unfair. Angela does a great job of explaining complex systems and functions for those who are new to computer programming. The only issues I had with this course were with some of the provided app files being outdated, causing some functions to break.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.713Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.523Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beaa"
  },
  "body": "Ich war mit dem Kurs sehr zufrieden. Frau Yu versteht es großartig, komplizierte Sachverhalte einfach zu erklären. Möchte mich herzlich für Ihr Engagement bedanken.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.713Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.525Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beab"
  },
  "body": "I really enjoyed taking this course and have gained much knowledge. I think the simplicity of this course and the way you and the team designed it really work well to help students process the information and maintain it. Overall I had a lot of fun taking this course and I will definitely be taking more online courses from you. Thank you very much Dr. Angela Yu\n\nI RECOMMED THIS COURSE TO ANYONE WHO WANTS TO LEARN WHILE HAVING FUN!!!!!!!!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.525Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beac"
  },
  "body": "This is the first Flutter course as well as the first Coding course and I don't have any experience in coding. Undoubtedly, Dr Angela has done a fantastic job. The analogies she chooses while explaining a new topic are very catchy. Her teaching speed is decent and challenges in between are helpful.\n\nThe best part is her interest in pushing students towards documentation and repetitively explaining topics when they are revisited is very helpful.\n\nBefore buying this course, I have subscribed for some other course on Udemy. No doubt it is good but I couldn't catch up with the tutor. But in this course, there is no such issue.\n\nI totally recommend this course to students with little or no coding experience.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.526Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13bead"
  },
  "body": "The instructor has done a really good job by using amazing slides and animations to make sure the students understand well. There are challenges where the student will create apps on their own to use what they have learnt to revise the previous modules. Best instructor I have come across so far.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.527Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13bea8"
  },
  "body": "I went into this course with zero app development skills, although I had 2 years of experience coding in other languages. It seemed daunting at first learning all the important concepts, but as time passed by I was able to get a hang of it thanks to Angela's unique way of explaining difficult concept. The course is rich in content and I'll advice anyone reading this and is still skeptical on if they should take the course or not to enroll.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.713Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.524Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beae"
  },
  "body": "Fantastic mentor and very helpful to learn some topics like animations, providers, and some short cuts with this course. I can easily understand flutter due to Angela. Nice Bootcamp.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.528Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13bea9"
  },
  "body": "learned everything that needs to start, before that course I wasn't familiar with Object-Oriented Programing languages but Angela thought me very well so it was a great journey before I was starting the course I thought I will complete it in one or two weeks but it took me two months to complete with constantly learning it was great experience Thank you Angela.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.713Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.524Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beaf"
  },
  "body": "Sehr durchdachter und gut strukturierter Kurs. Inhaltlich erhält man auch alles was nötig ist, um programmieren zu können. Zwischendurch erhält man sogar paar Motivationsvideos mit paar allgemeinen Tipps. Das einzige, was ich mir noch wünschen würde wäre mehr Inhalt bzgl. Software-Architekturen und wie diese in Flutter umgesetzt werden.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.529Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beb0"
  },
  "body": "The overall course was really enjoyable and perfect with Angela who is a very energetic and encouraging person! I really really enjoyed her everyday smile and passion into this course. Some things are outdated but the community is awesome for helping us finding the solution out.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.529Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db30ca80d3cdc13beb1"
  },
  "body": "Amazing tutor. Highly recommend. Her voice is the main factor that made me complete this course. Although I don't know her Chinese name, her English name is quite apt. She is indeed an Angel in my life.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:19.714Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:20.530Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13becb"
  },
  "body": "Great course for React Native. Learned a lot and the instructor was great. Wish there was a section on working with SQL and bigger structured mobile apps.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.341Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13becc"
  },
  "body": "Maximilian Schwarzmüller, has been one of my favorite tutors online, through whom I have learned so many amazing things about programming. This course also keeps his standard so well.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.342Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13becd"
  },
  "body": "Absolutely amazing! I bought this because I wanted to start a company. And my God it was a huge learning curve but I couldn’t ask for a better teacher! Worth every penny",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.343Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bece"
  },
  "body": "This course is awesome even if you dont know english perfectly. The explanation and examples are so clear. Also I want to say that here you can find good community that covers any special issues that you can get during study process. Big thanks to Max. Great thanks to Academymind.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.344Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13becf"
  },
  "body": "Detailed and as always highly professional course. I have learned a lot from it. and I did my first Native mobile app !!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.344Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed0"
  },
  "body": "It’s a good course to kick start the react native learning by having fun developing some mobile applications and pushing them to apple and play stores. ‘Code and learn as you go with example apps’ is the approach that Max uses to teach us react native is quite intuitive.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.345Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed1"
  },
  "body": "I wish to provide 5 star but this course doesn't cover all the API and components of React-Native. Flatlist is the component has been used entirely in this course instead might have applied all other Components at least one place. Also, widely using API is not covered in this course like SMS, audio and video recording and accessing device details through PHONE_STATE is missing. Important missing piece is React-Native CLI developing. This major concept is covered at single video where should have spent at least a section. I have learned most of the concepts of React-Native and will expect that above limitations will be added into course. Thank You Max.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.345Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed2"
  },
  "body": "The course is perfect! I learned all about react native and I recommend it to everyone! Thanks Max!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.346Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed3"
  },
  "body": "This was a great course for learning React Native. Thanks to Max for all his effort and energy in the course. I liked very much the idea of have many different small applications in the course, that helped me a lot in understanding the concepts, ideas, and tricks of React Native. I will use all the knowledge learned here very soon. See you in the next course that I will take. Thank you.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.347Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed4"
  },
  "body": "Exceptional course. Where stuff didn't work because syntax changed, the updates were there in the lecture or adjacent, and the explanations were great for all of the content. I also liked how the Shopping App was expanded out more and more throughout the course, because it was a nice way of teaching us new concepts, while allowing us hands-on experience in applying those new concepts to an app we already built.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.347Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed5"
  },
  "body": "Excellent Course and Excellent Teacher!!\n\nI really enjoyed learning React Native!\n\nThank you Maximilian for such a detailed and well explained course!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.348Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db40ca80d3cdc13bed6"
  },
  "body": "In general, this course it alright to take if you are completely new to React Native.\n\nHowever instructor overcomplexing things a lot, most of the logic introduced in this course apps could be way more straight forward.\n\nFirebase were not correctly wired to the project, instructor decides to not follow docs recommendations and uses firebase in weird way, which leads to overcomplexity as well.\n\nThat spirit of doing things from rear to top are feels everywhere through the course, a lot of anti-logical approaches and sticks throwing in your own wheels.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:20.542Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:21.348Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef0"
  },
  "body": "please don't buy this course in 2020, I am using android studio 4 and 40% apps from this course are not working because this is very old course and instructors are very good but they are not updating this course, please go with the latest android development course.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.167Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef1"
  },
  "body": "It's a pretty good course overall, but projects too old to run.\n\nA lot of projects I need to change some codes, update some tools or do other things. Otherwise, I can't run them.\n\nIf a new version of projects instead of the old, it can help learning a lot.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.168Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef2"
  },
  "body": "Thank you Rob, for providing a perfect course for Android O Development.\n\nIt has been a great coding journey!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.169Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef3"
  },
  "body": "This Course is not what is shown in the content... They are not cloning actual application its just a duplicate with one or two features and NO UI. UI functionalities are not taught properly. Also, for database they focused on parser which is not used now instead of firebase\n\nWas this review helpful?\n\nReport\n\nRob Percival\n\nInstructor response\n•\n3 months ago\n\nHi Somya, thanks for your comment and I hope you enjoyed the course. The project replicates the app and puts to use all the skills students have learned in the preceding lectures, but I'm sorry if you felt it wasn't comprehensive enough. The course is a little older now, which if why I use parser in database, but I'll take your feedback on board. Thanks, and happy coding.",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.170Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef4"
  },
  "body": "Nice explanation for each and every line of code, your way of teaching is very excellent. I can easily understand the connection between Android studio and java and how codes operate the application. Now I got the confidence to develop the app.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.170Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef5"
  },
  "body": "Great course! I already have some background experience with programming, so I was able to fast forward a little bit. However all lectures were somehow usefull and of course there is a lot you can do on your own after this to improve learning. If you do all the excercises properly it might take a few months to complete, but it would be totally worth it. Thanks to COVID-19 I was able to find the time (and price discount) to finish it.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.171Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef6"
  },
  "body": "The course was good,taking it slowly in the beginning so the the students got familiarised with the environment.\n\nHowever, a lot of updates need to be made like teaching to use the new Firebase-Firestore instead of Firebase-RealTime Databse.\n\nAlso a lot of important essential topics related to app development are completely left out in the course like notifications.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.172Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef7"
  },
  "body": "It's been a great journey for me in android development. In the beginning, I didn't know about a little of it, after a few lectures by consistently following the instructor the things would be going well. In the end, I could be able to design a full flesh android application.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.172Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef8"
  },
  "body": "Great course. I did not give full 5 stars, because some things were outdated and presented code did not work. Fortunately other users were helpful in Q&A section. Overall I recommend it for the start of your journey with android development.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.173Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13bef9"
  },
  "body": "great course. I know the target is for beginners, even though it would be great if they can avoid silly code, better than that, never show this kind of code. despite this it is very interesting",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.173Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13befa"
  },
  "body": "there have many things which i did not understand because of you explain things too short. you write code but you did not explain that what does this line of code and what does that line of code. i am not satisfy with this course . any way i love this course but if you explained things in details then i love very much..................thank you for the course rob.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.174Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db50ca80d3cdc13befb"
  },
  "body": "Learn Very Well & Good For Begginers But The Course Is Little Bit Outdated And Needs To Updated.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:21.363Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.174Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf15"
  },
  "body": "It's cool lesson.Thank you",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.989Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf16"
  },
  "body": "One of the instructors is clearly way less experienced. The section with Caleb is awful. He doesn't have mastery of the subject and fumbles through XCode. Really throws off the entire learning flow. Feels like you're learning from someone who took a course and is just trying to re-teach from limited experience. Want my money back",
  "rating": 1.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.989Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf17"
  },
  "body": "Very good and amazing course, explains all the steps of how to create an iOS app, and it starts from beginning to the professional level. Thanks, Mark.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.990Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf18"
  },
  "body": "It is a well explained course. Covered almost everything from ground zero to the end.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.991Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf19"
  },
  "body": "Jess Rascal video and sound was very poor quality...plus I'm from the North of England and I still found his accent hard to follow",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.993Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1a"
  },
  "body": "Still getting started but i like how the program looks to be set up and topics covered.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.993Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1b"
  },
  "body": "I learnt how to make the first iOS app. Thank you so much.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.994Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1c"
  },
  "body": "I like Mark's teaching style. Good humour. But most importantly his step by step progressive examples are just what I need. Especially 'Optionals'. No other instructor has taken the time to really explain what optionals are all about and how to use optionals in your code. I finally get it!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.994Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1d"
  },
  "body": "Prolific to say the least.one problem tho I have windows not a MacBook so it’s not as easy",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.995Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1e"
  },
  "body": "Clear instruction! Meaningful and inspiring method!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.996Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf1f"
  },
  "body": "It is a great course for a beginner as well as a professional. Like the attitude of the teachers in this course. Have learnt much more than expected.\n\nThanks!!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.187Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.996Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db60ca80d3cdc13bf20"
  },
  "body": "Amazing so far",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:22.188Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:22.997Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf3c"
  },
  "body": "Fantastic very detailed lesson! However, please create a tutorial that isn't heavily project based. An example would be how to retrieve from firebase part 1, how to update part2. I feel that for beginners like myself would be a little bit confusing at first with all the other codes that are part of the project. >:)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.807Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf3d"
  },
  "body": "The instructor is vert knowledgeable on the subject. He breaks it down with ease for others to understand. Well planned to teach the subject plus gotchas and more then ionic.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.808Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf3e"
  },
  "body": "Yes this is the best place to learn new things.\n\nMax is the best tutor. I hope that Max will teach more and more courses like this\n\n.\n\nThanks Max and Thanks Udemy!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.808Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf3f"
  },
  "body": "I would love to see a lot more Native phone Plugins to be used. I would change my rating to 5 starts if there more focus on the Plugins.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.809Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf40"
  },
  "body": "Course is amazing , I am going to repeat it after 150th lecture , I skipped the practicing at my local so going to do that on my own.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.810Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf41"
  },
  "body": "In general the course is well done but, towards the end, it becomes very hasty, as if you had little time to illustrate the too many concepts needed to run a mini application like this; it becomes a simple \"write code\" very fast and explained even worse. Sin.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.810Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf42"
  },
  "body": "An excellent course provided by Max!, explained complex concepts in a simple way, and developing it into a side by side course project, like a real time one, gives more confidence while learning the topics. Thank you so much Max!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.811Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf43"
  },
  "body": "This course is going very good and i'm having more interest to learn. I would like to thanks to the author, who making me more interest to move on.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.812Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf44"
  },
  "body": "great course... most of the technics are explained in details.... some cannot follow because I don't have deep knowledge of Angular.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.812Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf45"
  },
  "body": "It is the only course I could find, where I have reached half-way through solving all the bugs and errors and understanding everything step by step.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.813Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf46"
  },
  "body": "Great course that covers most of what Ionic offers aswell as other technologies (i.e: Google maps...). I feel like having the necessary tools to build an entire app and deploy it on any device. Keep up the amazing work!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.813Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf47"
  },
  "body": "It was a very good course. I have learned and practiced everything you have taught and made it quite far. Thank you",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.009Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:23.814Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf61"
  },
  "body": "So much fun, easy to understand and really inspiring with the real examples",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.627Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf62"
  },
  "body": "The video lessons are clear simple and explain all what you need to start develop your apps!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.627Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf63"
  },
  "body": "arouiche\nRating: 4.5 out of 5\n10 months ago\n\nGood explanations and examples to practice. Would be nice if you explain some of the errors that xcode gives.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.628Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf64"
  },
  "body": "I have started working on developing the app that I had in mind for a while now, and this course has definitely helped me setup the initial steps for it. It is definitely worth it! thank you Rob!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.628Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf65"
  },
  "body": "They have not updated the Xcode programm, so the filenames of the files in the \"hello World\" start project in video \"8. Navigating The Xcode interface\" It's not the same names as in the newest version of Xcode. So i got really confussed now and i still trying to figure it out what files he have in the video look like the new files with different names. But otherwise, he explains it good",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.629Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf66"
  },
  "body": "Great match !",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.630Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf67"
  },
  "body": "The presenter is very clear, energetic, and to the point. Love this course!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.631Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf68"
  },
  "body": "Does not match xCode which makes it very hard to follow",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.631Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf69"
  },
  "body": "Easy step by step instructions",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.632Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf6a"
  },
  "body": "I'm just starting to learn coding so I am excited to learn more.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.632Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf6b"
  },
  "body": "this is outdated in parts and not everything ties up with the demo - would be great if there were mini updates like they do in Onemonth",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.633Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db70ca80d3cdc13bf6c"
  },
  "body": "Outdated material",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:23.825Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:24.633Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf86"
  },
  "body": "Its been amazing to go through this course, I started as beginner and with help of this course, I got to know a lot of basic stuff and it shows improvement in my development",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.448Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf87"
  },
  "body": "Good course, was not too happy about some of the exercises... Had a lot of extra pieces that were not explained well. Also did not like how images were explained that much. We are told to do embedded images but were not shown later on, even in solutions.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.449Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf88"
  },
  "body": "I learned something new skills on xamarin.Forms; which is not available in youtube or google.... Explanation was Amazing,\n\nThanks for sharing Knowledge...\n\nCould you please provide your Git hub id...i do follow",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.449Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf89"
  },
  "body": "Like all mosh courses very effective, with best practices and without larges theorical and unused samples. The samples are Good to start. The only disadvantage is a bit outdated",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.450Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8a"
  },
  "body": "Mosh has a very good style to explain the concepts and covers a lot of related concepts while explaining the core concept.\n\nHe provides enough concepts and hands on practice, enabling the learner delve deeper and use all the learning as springboard to create amazing things.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.451Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8b"
  },
  "body": "This course goes through the most important behaviours of Xamarin framework. You are also going to get informations about the MVVM=>automated testing. These skills you can improve in his other courses. He has a great English level, he is easy to understand. Some technics mentioned here is old (e. g. OnPlatform), but on Google you will find a new solution in a few seconds. If you want to learn Xamarin development, this course is a great point where to start.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.451Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8c"
  },
  "body": "This is a good course but some examples made for IOS don't work so well for Android. Some topics like persistence data, file storage, didn't have a good explanation. I have no regrets about this course, but I did the EntityFramework course from Mosh and I liked more than this. Points to improve this course are, better Android examples, more exercises, examples about peripherals, Storage Data and customize screens.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.452Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8d"
  },
  "body": "It was greatly presented and the order in which the topics were taught made it easier to grasp the content. The exercises were helpful as well.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.453Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8e"
  },
  "body": "Very good indeed. Although, he should have explained the concepts of PCL Storage and SQLite in bit more depth and with examples. Still, a great place to learn at, and a great person to learn from. Thanks.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.453Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf8f"
  },
  "body": "It's a great course! Mosh explains everything in detail and keep clearly all ideas. Rich exercises, solutions and Cheat Sheets, that helps a lot for your own continuous developing! Very happy with this course!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.454Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf90"
  },
  "body": "This is a good course for persons that has knowledge in C# and that are beginners in Xamarin (Or has no knowledge in Xamarin).\n\nThe unique problem is that it isn't updated, and you can have some issues in some lessons to make it works.\n\nAt the final of the course, it isn't possible build an real life application. For this reason, a recommend the course only as an introdution in Xamarin Forms, and not as a completed course to build apps with Xamarin.\n\nThanks for sharing your knowlege Mosh. It is possible to see that you have domain in the subjet.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.454Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db80ca80d3cdc13bf91"
  },
  "body": "too many obsolete sections, either update material or remove course entirely.\n\nOtherwise the format with small exercices in each section was interesting.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:24.646Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:25.455Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfab"
  },
  "body": "Many thanks for a very interesting course. One really learns a lot. Unfortunately, a few things are no longer up to date - but this has the advantage that you get more involved with the topic. From my point of view 2 aspects are not well solved. The TaskTimer app is very complex. It would have been better to teach some concepts in smaller projects. Furthermore, the TaskTimer App was not programmed completely. The chapter for settings is missing. Nevertheless, anyone who wants to learn programming should take a look at this course. Some programming experience would be helpful.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.268Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfac"
  },
  "body": "It was a very good course for beginners who want to start learning android programming the right way. I learned a lot specially the fundamentals of building an android app.\n\nThere were some lectures that are a little bit outdated but if you research them online, you can find a workaround on it. The instructors are also responsive if you have any questions so there's no reason not to ask them. Thank you Tim and Jean for this very good course!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.269Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfad"
  },
  "body": "Great course, I've learned a ton, and while I've not built my own apps yet (...having just finished the course), I'm already using the info Tim has provided to be a better programmer.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.269Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfae"
  },
  "body": "It was really awesome! Topics were explained really good. I like the the tips the he gave in the courses.\n\nOne suggestion, it would have been really good if it was told like what we are going to achieve in each lesson before the lesson start with some examples.\n\nThank you!",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.270Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfaf"
  },
  "body": "The course is really good! But with \"but\"s.\n\n+ The content of this course is VERY big, valuable, lots of useful techniques, unobvious approaches, Android lifehacks and design tricks.\n\n+ Jean-Paul usually replies questions very fast and this is a great support!\n\n+ Tim speaks on video with optimal speed: many lecturers speek too slow and make course too long, not in this case. This means, more information is packed in these 60 hours of lectures.\n\n- MANY times I was like, \"what`s going on?\" because the explanation style is: \"coding on screen, telling what the code does\". This is master class, yes, not a definitive course of lectures, but more visual material (e.g. illustrating how different parts of Android ecosystem work) would be of great help. Tables with app structure helped a lot, but there are just a few of them.\n\n- Course has a cliffhanger \"we will make app settings in the next video\" and there`s no next video, it is the end of the course. (as of 31.07.2020). I hope it will be finished.\n\nConclusion: I would recommend this course to any person who is gonna be Android developer, though not as a first, \"introduction\" course.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.271Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb0"
  },
  "body": "Unfortunately, in 2020 this course is completely outdated and in fact it teaches to do things in a wrong, unnecessarily complicated way.\n\nOn top of that, if anyone thinks seriously about Android development then Kotlin is the language to go for.\n\nI loved Tim's Java Masterclass course, in my opinion he is a great teacher, but unless there is a new course, like from scratch new, with JETPACK, MVVM, Android Studio 4.0+ features I would discourage anyone from buying the courses (both Java and Kotlin).",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.272Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb1"
  },
  "body": "Fantastic course!\n\nI have followed quite a few classes on Udemy for Android Developpement and this is, by far the best in my opinion. It is better maintained than some courses that were created more recently. If you are not sure about getting this course because of the Android constant updates, don't hesitate! The teachers are very responsive and the entire Learn Programming Academy keeps working to this day to bring new content to its courses.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.272Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb2"
  },
  "body": "One of the Best Course for the People, Who are Really Interested in Android app Development, Special Thanks to Sir Tim Buchalka and the rest of Supporting Instructors and really appreciate their work...",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.273Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb3"
  },
  "body": "After the course I understood the main concepts while making and APP. Understanding the Content Provider and Adapter classes are still little difficult for me. However the other concepts are OK. Looking forward to learning, creating Apps with Kotlin. Since I do not know Kotlin, I will most probably take up the begineer level course.",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.273Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb4"
  },
  "body": "He has very knowledge and experience in the programming life. Therefore, When he explain some codes or write code, he tells us very briefly and we can pick up quickly. Of course, Lots of libraries is old and it causes to get errors while program is running. But if you write codes by typing, you can't get any error. I think this course doesn't include things about gaming coding but (I think) if you want to get a job as Android Developer, it is very useful course to reach your goal.Just have a problem that we need to code \"Setting\" menu in last lecture but he finished this course and There is no make sense to creating \"Duration\" column in Durations Report menu. Because we just get random duration and Making counter for duration and notifying to user would be nice. Everything else is good. Thanks for everything Tim...",
  "rating": 4,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.274Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb5"
  },
  "body": "99% informative and easy to understand so far. Tim is an excellent instructor and JP is excellent with support. Some things seems like they might not be the most current practices (i.e. Google seems to recommend NavContainerHost instead of FrameLayout and Nav Graphs for fragment usage?) but I imagine it's near impossible to update courses at the rate that Android are updating content. I have been contacted by two recruiters now too after doing this course so hopefully I can secure a position from this. Cheers fellas.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.275Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31db90ca80d3cdc13bfb6"
  },
  "body": "The course has taught me almost all the basics of Android Development, which I greatly appreciate. One thing I wish the course had was a section about the current technologies and libraries being used on the market, for ex. Android Room, LiveData, ViewModel, Dagger, and that sort of stuff. Then again, I do understand that this is a course mainly targeted towards beginners, so it might be great to put the andvanced libraries I've mentioned into an Intermedia Course maybe.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:25.467Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:26.276Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd2"
  },
  "body": "Really a good course for beginners and intermediates to develop and Launch there own app",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.090Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd3"
  },
  "body": "The course is not suitable for those who want to learn programming for Android. Half of the lessons were devoted to marketing, and the programming lessons themselves were uninformative. Also, teachers never answer questions.",
  "rating": 1.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.092Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd4"
  },
  "body": "Android development, which I know nothing about before, proved to be a very impressing setup of technology. Course introduces it right on so very nice. I will benefit gratelly of my earlier knowings of all of XML, Java, Gradle and GIT. Hurray! Additional Feedback, This course is getting even more exciting and the Android technology is impressing. Hurray! Again, also this course showed me how to marketing and targeting my app. Very impressive.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.093Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd5"
  },
  "body": "This course is amazing! Thank you a lot.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.093Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd6"
  },
  "body": "The course was absolutely great! Speakers are doing the job perfectly well. As of May 2020 a little bit out of date. But good anyway! Highly recommend. Hope we'll update it in future though.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.094Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd7"
  },
  "body": "I loved this course a lot and liked Angela. Providing information in a useful and easy way. Not boring, quite the opposite, sitting for an enjoyable long time. Everything was great until chapter 20 and beyond. I wished that the focus was greater on the Play Store, because the idea of ​​the course is based on developing applications using Java and Android. Note\n\nThere is a lot of old information, as well as links and websites that do not exist, or a different version has been issued for it. In the end, I want to thank the curators for their efforts, and I am very happy with the results.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.094Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd8"
  },
  "body": "the course is really good, even though its a bit old still useful training.\n\nit covers everything from A-Z about app development which is great.\n\nOnce thing though some of the coding tutorials were difficult to follow, may be things were not explain as well as they could have been. the bitcoin and chat app tutorials.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.095Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfd9"
  },
  "body": "very little of actual coding and code explanation..and so full of app marketing..not very gd at all",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.096Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfda"
  },
  "body": "It was a really good course and I enjoyed it. However even after finishing the course I still wished I got to build more apps with Philip's help. Also the teaching style is great however the explanations were not always thorough. For example, he'd put down a line of code and explain why he did that but never explained how he got to know that that's how you're supposed to do it. Also I would of loved an in depth lesson of how to use the android developer documentation. I feel that would of been a really strong addition and also how to read API documentations of companies out there.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.096Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfdb"
  },
  "body": "Once we reach the quizzler app, he explains the methods and code writing as if we know what he is talking about. he starts to go really fast specially on complicated matters. i was enjoying the course fully in the beginning but then it feels like he just wants to finish the section even though detailed explanations are needed now more than before. Moreover, we learn by practicing, downloading a premade designed app with strings and codes written already is a big NO. am here to learn to do it even though we've done it once in the beginning where it was very basic. I need to design now more than the Dicee app as its getting complicated.",
  "rating": 2,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.097Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfdc"
  },
  "body": "Okay so I bought the course and at start it was Ok,he was learning you how to build simple apps,in my first application,the simplest one,I had a problem that I didn't manage to solve by myself so I sent him a message and asked for help.\n\nIn the meantime,I used google to solve my problem untill he replay.\n\nI BOUGHT THE COURSE ABOUT A MONTH AGO AND I STILL DIDN'T GOT ANY MESSAGE FROM HIM!!\n\nThere is no support,only from the Q&A.\n\nThe weather project is a BIG BIG BIG disaster,he is not really explaining what happen,he just write non-stop and expect you to understand him.\n\nIn addition,the weather app is not working,the API is old and not working,and no matter what I tried I didn't manage to make it work(I downloaded his complete file and changed the API for test but it didn't help)\n\nNow I know that some people will say that its easy to fix and things.\n\nWell,English is not my first language and I have watched all the videos in 0.75x ,In addition,I would expect some support or an update for some things!\n\nIf I could go back in time I wouldn't take this class again.\n\nnot recomended.",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.097Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31dba0ca80d3cdc13bfdd"
  },
  "body": "Sometimes explanations are not clear, also some features in the course are outdated. Many of the courses are full of bugs and complete code at the end is not the same as the one shown in the course. Spent hours to debug chat app",
  "rating": 2,
  "createdAt": {
    "$date": "2020-12-11T07:20:26.290Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.098Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bff9"
  },
  "body": "Overall nice experience to learn for first timer. Its quite easy to understand and straightforward information.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.916Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bffa"
  },
  "body": "คอร์สนี้วิทยากรสอนเข้าใจ และนำไปใช้ได้จริงครับ",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.917Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bffb"
  },
  "body": "it was satisfactory",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.917Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bffc"
  },
  "body": "The course was very interesting because of the structure of the topics, however, it is very outdated, and some of the functions/components are no longer used, so I will highly recommend to update it to help the beginners follow more easily the course (in my case I managed to do the hw but I struggle a lot). Also many questions of students are still unanswered. Overall it was a great experience to learn many (or most ) of the features that work in Android. Thanks!",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.918Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bffd"
  },
  "body": "very nice tutorial",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.919Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bffe"
  },
  "body": "Its a good course..but language of speaker is not that fluent some words are not clearly understand ,it should be have a better fluenter so that listener can easily understand..",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.919Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13bfff"
  },
  "body": "This is more a course about how to do android app in the worst possible way.\n\n- The code is horrible. The author creates methods and attributes as needed, without following any order structure.\n\n- Kotlin? Half. Use kotlin to program and it works. But it constantly uses expressions that it shouldn't use. For example, he uses the second constructor instead of the main one, he is constantly using !! to avoid checking nulls, he doesn't use data classes either ... it's one after another\n\n- Some apps don't even finish them, because they get so confusing that even he doesn't seem to know how to go on. Like the TicTacToe example.\n\n- Many applications do not work, for example the alarm. Or anyone that involves using external services (weather application, Maps application ...)\n\n- He does not answer questions or have someone to answer them. Basically you have access to these videos and code, but nothing else.\n\nI am disappointed with the course.",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.920Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c000"
  },
  "body": "can't hear the audio well and really hard to understand basic fundamental concepts. not very good but one of the only few Kotlin courses out there ..",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.920Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c001"
  },
  "body": "+ Instructor's English language : very bad\n\n+ Kotlin explanation from section 1 to 11 : good\n\n+ Android projects implementation from section 12 to 31 : very bad\n\n+ Overall : very bad",
  "rating": 1,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.921Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c002"
  },
  "body": "This would have been a good match, however the course had technical issues, with poor application of the Kotlin language, especially an overzealous use of the not null assertion operator (!!), which defeats the point of Kotlin's null safety.\n\nThe explanations were not clear in some parts, I replied to 9 questions in the course, 7 of which were to help out other confused students (I also was compelled to re-write some of the applications).\n\nRegarding section 29 and 30:\n\n29 was in effect a duplicate of 24, and both sections (29 and 30) dealt with technologies, outside the remit of this course! This is an Android + Kotlin course, yet, PHP, node.js and C# development was involved, when Kotlin could have been used instead.",
  "rating": 2.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.921Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c003"
  },
  "body": "If you you enjoy debugging ugly chunks of code, look for resources by yourself... trying to understand poorly taken English. This is your course. Kotlin and SDK are so poorly used i am embarrassed. When it comes to PHP and MySQL, steps are skipped. Most of the concepts are poorly and some wrongly explained.",
  "rating": 1.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.922Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c004"
  },
  "body": "Der Kurs gibt eine gute Einführung in Kotlin und welche Möglichkeiten Android-Studio zur App-Programmierung bietet. Es fehlt aber eine grundlegende Einführung in die GUI-Programmierung.\n\nDer Kurs leidet manchmal unter Sound-Problemen (verzerrt) und unscharfen Bildern. Für nicht Englisch-Muttersprachler ist das Englisch manchmal schwierig zu verstehen, da die Aussprache von der normalen abweicht z.B. string - cittering, empty - empeti.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.110Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:27.922Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c020"
  },
  "body": "Good for basics, But i feel that as we started to develop advance things, it wasn't very helpful.",
  "rating": 3,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.739Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4da22a3e5328695438"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c021"
  },
  "body": "I like the way you are teaching . It is a long complete journey , i learnt deeply and uses by knowledge to add additional features in the app.Looking forward to learn further courses with you.\n\nThank You Paulo for an amazing experience.",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.740Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695439"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c022"
  },
  "body": "This course made me easy to get enough skills, I developed my confidence .",
  "rating": 4.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.741Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543a"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c023"
  },
  "body": "Excellent course! I really like how Paulo teaches!\n\nVery well put together, nicely chained.\n\nI learned a lot from the many examples.\n\nI am Hungarian and the first language is not English, but I speak very well, I understand every word!\n\nI will take my next course because from then on I will only develop in your teaching!\n\nThank you Paulo!",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.741Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543b"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c024"
  },
  "body": "It was Wonderful. The teaching is excellent\n\nWould recommend this course to others.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.742Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543c"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c025"
  },
  "body": "It's a brilliant course. Paulo repeats techniques in a way that we can practice well. A very comprehensive course.\n\nI didn't follow the Java part as I already new it, however I skipped through it, and it's well organised.\n\nI also skipped the Parse sections as it seems the app clone facilities are not more on the Parse website.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.742Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543d"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c026"
  },
  "body": "If tutors of such courses can put some efforts to dig deep into the 'whys' behind the code they write, that is, provide the breakdown of such big chunks of code, it will become a bit more easier to understand why and how things work the way they do.\n\nHowever, the course was fun and pretty useful!",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.743Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543e"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c027"
  },
  "body": "Very good course, It helps you to understand a lot of Android environment, unfortunately the android system has change and you must re-make some codes to work now days, besides that its a very good course that opens you the doors to be an android developer.",
  "rating": 3.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.743Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e532869543f"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c028"
  },
  "body": "So far so good. All is going well, I have learnt a lot. I am excited at how much I've learnt and looking forward to building my project and bringing my other app ideas to life.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.744Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695440"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c029"
  },
  "body": "Take much time and can't answer my question. I already drop a question in QandA box",
  "rating": 1.5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.744Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695441"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c02a"
  },
  "body": "I'm new to Android, the class really helped me understanding basics and explore it myself. Loved step-by-step process and explaining them. The tips are very useful. It is really a complete course to develop an application.\n\nThanks for putting together this wonderful course.",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.745Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695442"
  }
},{
  "_id": {
    "$oid": "5fd31dbb0ca80d3cdc13c02b"
  },
  "body": "this course is amazing, i am very new to programming and all the stuff but he taught very well , dont know about next lectures but till now i understood everything, i have completed half of the course in last 7 months as i am a working person so i dont get much time. i want to make my own apps, i hope one day i will do it :)",
  "rating": 5,
  "createdAt": {
    "$date": "2020-12-11T07:20:27.936Z"
  },
  "updatedAt": {
    "$date": "2020-12-11T07:20:28.745Z"
  },
  "__v": 0,
  "author": {
    "$oid": "5fd31d4ea22a3e5328695443"
  }
}]