{
    "field": {
        "name": "programming-languages",
        "courses": []
    },
    "course": {
        "title": "Learn Python Programming Masterclass",
        "subtitle": "This Python For Beginners Course Teaches You The Python Language Fast. Includes Python Online Training With Python 3",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/629302_8a2d_2.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/629302_8a2d_2.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/629302_8a2d_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "Really good course, Tim is very knowledgeable and walks through each lesson step by step. It can occasionally get tough once you start getting to the more intermediate/advanced lectures, but stick with it and go over previous lectures so you're in step with what Tim is trying to teach. My only snag is that when I went through the course, it was/is in the process of being remastered. At the crossover point, where it goes back to the older videos, it was a little confusing and the lectures were quite long. That being said, I recommend this course whatever level you're at with Python, it will teach you a lot. Thanks for the great course Tim - I'm feeling a lot more confident with Python, I have a deeper understanding and I've learnt a lot from this course.",
            "rating": 4.5
        },
        {
            "body": "This course has genuinely helped me. I started having a basic knowledge of Python, but now I'm able to build programs using OOP and other advanced skills that make my programming usable in a professional setting. Thanks Tim!",
            "rating": 5
        },
        {
            "body": "When I took the course, it was incomplete and seem not to have been updated for a quite long time. Later during the same year I've seen that the content was updated with improvements in the narrating difficulties. Well done for that!",
            "rating": 4.5
        },
        {
            "body": "It's a comprehensive course and I found in it more than what I have expected and it's a very good reference for python.",
            "rating": 5
        },
        {
            "body": "My experience with this course has been phenomenal. From basics to advanced everything was so well taught and embraced with precious advise from Tim's and Jean Paul's own experience.\n\nEvery doubt of mine was answered so well and that too within 1-2 days. I feel so lucky that I found this course.",
            "rating": 5
        },
        {
            "body": "This course is professional and intelligible; visually and aurally it is easy enough to follow and comprehend. The only problem with it is that it is currently being redone, and just like a road that's under construction it can be a hassle and hard to recommend. Material gets repeated and the presentation changes back and forth. Still a decent experience and quite informative though, and it'll be a five star course one the revamp is done.",
            "rating": 3.5
        },
        {
            "body": "The remastered sections are well done, but unfortunately they neither finished the original section nor actively upload remastered sections.",
            "rating": 3.5
        },
        {
            "body": "Very well done course! It's a little bit confusing the remastering of some of the sections.. you don't know exactly in which order to cover them and when..",
            "rating": 4
        },
        {
            "body": "It's one of the best courses I've found online. The remastered content highlights the expertise and dedication of Tim. I highly recommend the course.",
            "rating": 5
        },
        {
            "body": "Classes are well explained and the challenges are hard enough to force you to understand what you need to know to complete them. However, the structure seems to be a bit confusing. I understand that the remastering of the course is an incredible extra, but I think a cleaner structure of the chapters/classes would make everything perfect. Since the course is a bit extensive, is quite hard to understand when we reach the end of the course or if what we are watching is something that was already seem in the past, on an improved video.",
            "rating": 4
        },
        {
            "body": "Good for learning Python basics from scratch. However with lot of content being revised currently, the course becomes too theoretical and confusing towards the end. Better to understand the initial topics & then switch over to more practical uses with Numpy, Pandas, et all.",
            "rating": 4
        },
        {
            "body": "Overall, the course was marvellous. However, some of the old videos were quite hard to follow but the remastered section was really good. I learnt a lot from this course!\n\nThank you Tim and the other instructors for making this course an awesome journey for me!",
            "rating": 4.5
        }
    ],
    "students": [
        {
            "name": "Rahan",
            "email": "rahan@gmail.com",
            "password": "rahan",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ben Kuhn",
            "email": "benkuhn@gmail.com",
            "password": "benkuhn",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Argiris Kechagias",
            "email": "argiriskechagias@gmail.com",
            "password": "argiriskechagias",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Yara Abdalla",
            "email": "yaraabdalla@gmail.com",
            "password": "yaraabdalla",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Divyansh Mittal",
            "email": "divyanshmittal@gmail.com",
            "password": "divyanshmittal",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Larson Long",
            "email": "larsonlong@gmail.com",
            "password": "larsonlong",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Christof Mueller",
            "email": "christofmueller@gmail.com",
            "password": "christofmueller",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Adriana Urse",
            "email": "adrianaurse@gmail.com",
            "password": "adrianaurse",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Santhosh Sankar",
            "email": "santhoshsankar@gmail.com",
            "password": "santhoshsankar",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Marcos Rafael Lopes do Adro",
            "email": "marcosrafaellopesdoadro@gmail.com",
            "password": "marcosrafaellopesdoadro",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ritesh",
            "email": "ritesh@gmail.com",
            "password": "ritesh",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ninaad Mathur",
            "email": "ninaadmathur@gmail.com",
            "password": "ninaadmathur",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Tim Buchalka",
        "email": "timbuchalka@gmail.com",
        "password": "timbuchalka",
        "role": "i",
        "briefIntroduction": "<p>Tim's been a professional software developer for over 35 years.&nbsp; During his career, he has worked for major companies such as Fujitsu, Mitsubishi, and Saab.<br><br>His video courses are used to train developers in major companies such as Mercedes-Benz, Paypal, VW, Pitney Bowes, IBM, and T-Mobile just to name a few (via the Udemy for Business program).<br><br>What makes Tim unique is his professional programming career - many instructors have never programmed professionally, let alone had a distinguished professional development career like Tim.<br><br>Tim has trained over 851,000 students how to program, way more than a typical IT&nbsp;Professor at a college does in a lifetime.<br><br>In fact, Tim's courses are often purchased by students struggling to get through college programming courses.</p><p>\"I am learning a lot about Java very quickly. I wish my college courses worked this way, they drag the same amount of material out over months.\" - Thomas Neal<br><br>\"I love this guy. I'm in school for java right now at a local college and I bought this course hoping it would help clarify the fuzzy areas of my coursework. There's no comparison. Every time I get lost in my textbook, I watch a couple more of these videos and I'm right back on track. He explains everything so perfectly. It sinks right in.\" - Kristen Andreani<br><br>\"Tim is a great instructor, I have more courses from him and all are great. This one really helped me with my understanding of Java from the very beginnings. In fact, I was able to find a job as Java developer with the knowledge gained from this course, so I basically owe Mr. Buchalka my career\" - Daniel Kubányi<br><br>Tim's mission is simple:&nbsp; to make a difference in your life by helping you to become a software developer. &nbsp;Tim does that through his Java, Python, C#, Spring Framework, and Android development courses.</p><p>When Tim started programming over thirty-five years ago, there was no online&nbsp;video training. &nbsp;</p><p>There was no \"easy\" way to learn. &nbsp;The Internet, in its current form, didn't exist, and as a result, Tim&nbsp;couldn't \"Google\" for help, or watch videos on Youtube.</p><p>After learning the hard way, Tim&nbsp;was determined to become the best teacher he could, and to make his training&nbsp;as painless as possible, so that you, or anyone else with the desire to&nbsp;become a software developer, could become one.</p><p>In between doing that, Tim&nbsp;spent the best part of those years as a professional software developer writing applications in Java and a variety of other languages. &nbsp;In addition, he spent many years with J2EE&nbsp;(as it was then known), now known as Java Enterprise Edition (JEE), designing and developing enterprise applications.</p><p>Tim is&nbsp;relatively unique, in that<strong>&nbsp;he is&nbsp;a professional, experienced software developer </strong>who also has <strong>exceptional teaching skills</strong>. &nbsp;<br><br>Many instructors have no work experience in the field. &nbsp;Make sure the person you trust with your education is a real expert with substantial previous professional experience.<br></p><p><strong>The bottom line for you is, when taking any of Tim's&nbsp;courses, is that&nbsp;you will learn the right way to do things from an expert, in the shortest possible amount of time.</strong></p><p>Tim's Java, Android, and Python courses, here on Udemy are of the highest quality as reviewed by his students. &nbsp;<strong> Ten's of thousands of students, just like you,&nbsp;have taken his&nbsp;classes,</strong> <strong>thousands have left glowing reviews,</strong> and many&nbsp;have gone on to full-time jobs, or consulting/freelancing opportunities after completing one of his&nbsp;courses.</p><p>Tim&nbsp;recently placed in the top ten Udemy instructors as voted for by his students and&nbsp;Udemy themselves. &nbsp;</p><p><strong>What does all of this mean for you?</strong></p><p>You can have full confidence that Tim's courses are of exceptional quality, and that he<strong>&nbsp;can teach you to become a software developer</strong> if you have the desire to become one.</p><p>Are you ready to start? &nbsp;You can get started today. &nbsp;No previous experience is necessary.</p><p>In 2020, video training is the quickest way to learn, and with Tim's experience and training, it is possible for you to become a software developer. &nbsp;You can do this.</p><p>Why not start today? &nbsp;Click one of his&nbsp;courses below, and watch his&nbsp;introductory video, to find out more about who he is&nbsp;and what he&nbsp;can offer you.</p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Course Introduction",
            "unitNames": [
                "Introduction To The Course",
                "Remaster in Progress",
                "Video Quality",
                "Subtitles",
                "How to Get Help",
                "Important Tip - Source Code"
            ]
        },
        {
            "sectionName": "Install and Setup",
            "unitNames": [
                "Python for Windows",
                "Installing IntelliJ IDEA for Windows",
                "Python for Mac",
                "Install IntelliJ IDEA for Mac",
                "Python for Linux",
                "Install IntelliJ IDEA for Linux",
                "Configuring IntelliJ IDEA - WINDOWS, MAC and LINUX"
            ]
        },
        {
            "sectionName": "Stepping into the World of Python",
            "unitNames": [
                "Introduction",
                "Our First Python Program",
                "Printing in Python",
                "Printing text",
                "Printing the result of a calculation",
                "Strings in Python",
                "The Escape Character",
                "Printing tabs",
                "More on Escape Characters in Strings",
                "Variables and Types",
                "Python is a Strongly Typed Language",
                "Numeric Data Types in Python",
                "Numeric Operators",
                "Expressions",
                "Integer division",
                "Operator Precedence",
                "The str String Data Type",
                "Negative Indexing in Strings",
                "Slicing",
                "Slicing with Negative Numbers",
                "Using a Step in a Slice",
                "Slicing Backwards",
                "Challenge Solution and Slicing Idioms",
                "String Operators",
                "String Replacement Fields",
                "String Formatting",
                "f-strings",
                "Python 2 String Interpolation",
                "Section Summary",
                "The Basics of Python"
            ]
        },
        {
            "sectionName": "Program Flow Control in Python",
            "unitNames": [
                "Introduction to Blocks and Statements",
                "if Statements",
                "elif",
                "Using a Debugger in IntelliJ or Pycharm",
                "More on if, elif and else",
                "if, elif, and else in the Debugger",
                "Using if with strings",
                "Simple condition",
                "Adding a Second Guess",
                "Conditional Operators",
                "Challenge Solution",
                "Using and, or, in Conditions",
                "Simplify Chained Comparison",
                "Boolean Expression True and False",
                "Truthy Values",
                "in and not in",
                "if Challenge",
                "Solution to if Challenge",
                "for loops",
                "Stepping through a for loop",
                "for loops Extracting Values from User Input",
                "Extracting capitals",
                "Iterating Over a Range",
                "For loop",
                "More About Ranges",
                "For loop with step",
                "Nested for loops",
                "continue",
                "break",
                "Initialising Variables and None",
                "while loops",
                "More on while loops",
                "Break in a while loop",
                "Break",
                "Continue",
                "The Random Module and Import",
                "Challenge Solution",
                "Binary Search",
                "Hi Lo Game",
                "Pass Statement and Complete the Hi Lo Game",
                "Testing the Hi Lo Game",
                "Augmented Assignment",
                "augmented assignment in a loop",
                "PEP8: The Python Style Guide",
                "Refactoring Code",
                "else in a loop",
                "else in the Hi Lo Game",
                "Conditional Debugging",
                "Another else Example",
                "Section Summary and Challenge",
                "Section Challenge Solution",
                "Optional Extra Challenge Solution",
                "Changing the Condition",
                "Flow Control Quiz"
            ]
        },
        {
            "sectionName": "Lists and Tuples",
            "unitNames": [
                "Introduction to Sequence Types",
                "Lists",
                "Immutable Objects",
                "Mutable Objects",
                "Binding Multiple Names to a List",
                "Common Sequence Operations",
                "Operations on Mutable Sequences",
                "Appending to a List",
                "Mini Challenge Solution",
                "Iterating Over a List",
                "The enumerate Function",
                "Improving our Code",
                "Adding items to lists",
                "Removing Items from a List",
                "Sorting Lists",
                "Built-in Functions",
                "Sorting Things",
                "Case-Insensitive Sorting",
                "Creating Lists",
                "Replacing a slice",
                "Deleting Items from a List",
                "Safely removing values from a list",
                "Removing the High Values",
                "Test, Test and Test. Then Test Again!",
                "Testing the Program",
                "Removing Items from a List Backwards",
                "The Reversed Function",
                "Algorithms Performance",
                "Summary so far",
                "Nested Lists & Code Style",
                "Processing Nested Lists",
                "Solution to nospam Challenge",
                "Function Signatures",
                "print revisited",
                "The join Method",
                "The split Method",
                "Solution to Mini Challenge",
                "The Magical Adder",
                "Tuples",
                "Tuples are Immutable",
                "Unpacking a Tuple",
                "Practical uses for Unpacking Tuples",
                "More Unpacking",
                "Nested Tuples and Lists",
                "Solution to Unpacking Challenge",
                "Nesting Further",
                "Nested Data Structures",
                "Nested Indexing",
                "Nested indexing",
                "Simple Jukebox - Demonstration",
                "Simple Jukebox - Importing Data",
                "Simple Jukebox - The Code",
                "Constants in Python",
                "Finishing the Code",
                "Challenge",
                "Challenge Solution",
                "Summary"
            ]
        },
        {
            "sectionName": "Functions - An Introduction",
            "unitNames": [
                "Introduction",
                "Defining a function",
                "Program flow when calling a function",
                "Parameters and arguments",
                "Debugging with parameters",
                "Palindromes",
                "Palindrome challenge solution",
                "Sentence challenge solution",
                "Functions calling functions",
                "Returning values",
                "get_integer Challenge solution",
                "Sum even or odd numbers in a range",
                "Returning None",
                "Functions that perform actions",
                "Handling invalid arguments",
                "width challenge solution",
                "Default parameter values",
                "Keyword arguments",
                "Docstrings",
                "Writing a Docstring",
                "How professional is that!",
                "Solution to Docstrings challenge",
                "Fibonacci Numbers",
                "Writing a fibonacci function",
                "Function annotations and type hints",
                "Function annotations with default values",
                "Solution to banner_text Docstring challenge",
                "A history lesson",
                "Printing in colour",
                "Running your program like a user",
                "Windows Only - Installing pre-release version of colorama",
                "colorama module and virtual environments",
                "Activating a virtual environment",
                "A function to test our HiLo game",
                "Counting correct guesses",
                "Fizz Buzz",
                "Playing Fizz Buzz",
                "Playing Fizz Buzz Solution",
                "Factorial function",
                "*args",
                "colour_print with multiple arguments",
                "Rules for variable number of arguments",
                "Defining different parameter types",
                "Variable number of arguments",
                "Section Summary",
                "End of Remaster"
            ]
        },
        {
            "sectionName": "Python Dictionaries and Sets",
            "unitNames": [
                "Introduction to the Section",
                "Change in the ordering of dictionary keys",
                "Python Dictionaries",
                "Dictionaries Part 2",
                "Dictionaries Part 3",
                "Dictionaries Challenge",
                "More on Dictionaries",
                "The Second Dictionary Challenge",
                "Sets",
                "Python Sets Part 2 and Challenge"
            ]
        },
        {
            "sectionName": "Input and Output (I/O) in Python",
            "unitNames": [
                "Introduction to the Section",
                "Reading and writing text files",
                "Writing Text Files",
                "Appending to Files and Challenge",
                "Writing Binary Files Manually",
                "Using Pickle To Write Binary Files",
                "Shelve",
                "Manipulating Data With Shelve",
                "Updating With Shelve",
                "Shelve Challenge",
                "Challenge Continued"
            ]
        },
        {
            "sectionName": "Modules and Functions in Python",
            "unitNames": [
                "Introduction to the Section",
                "Modules and import",
                "The standard Python library",
                "WebBrowser Module",
                "Time and DateTime in Python",
                "Time (Continued) and Challenge.",
                "Timezones",
                "Check Path In Windows",
                "Check Path on a Mac",
                "FAQ: Installing packages in IntelliJ IDEA and PyCharm",
                "Installing the pytz module (Windows/Mac/Linux)",
                "Using Timezones",
                "More on Timezones",
                "Timezone Challenge",
                "Introduction to Tkinter",
                "TkInter - Pack Geometry Manager",
                "TkInter - Grid Geometry Manager",
                "Advanced GUI Example Part 1",
                "Advanced GUI Example Part 2",
                "Advanced GUI Example Part 3",
                "Tkinter Challenge",
                "Functions in Python",
                "Functions Part 2",
                "Functions Part 3",
                "Parabola - More on Functions",
                "Scope in Functions",
                "Fix Function and Draw Circles",
                "Enhanced Circles and Challenge",
                "Blackjack Setup",
                "Load Cards",
                "Deal Cards",
                "Global Variables",
                "Global Keyword",
                "Test Blackjack Game",
                "Blackjack Challenge",
                "Importing Techniques",
                "Underscores in Python code",
                "Namespaces, more on Scope and Recursion",
                "Recursion with OS Module and Filesystem and Nonlocal keyword",
                "Nonlocal keyword, Free and LEGB"
            ]
        },
        {
            "sectionName": "Object Oriented Python",
            "unitNames": [
                "Object Orientated Programming and Classes",
                "Instances, Constructors, Self and more",
                "Class Attributes",
                "Methods Part 1",
                "Methods Part 2",
                "Non Public and Mangling",
                "DocStrings and Raw Literals",
                "Album class and More on DocStrings",
                "Artist class and import Albums",
                "Load data and Write Checkfile",
                "Compare Files and Algorithm Flowcharts",
                "Implement Revised Load_Data Algorithm",
                "Write OOP Version",
                "Getters and Properties",
                "Remove Circular References Challenge",
                "Getters and Setters",
                "Data Attributes and Properties",
                "Alternate Syntax for Properties",
                "Inheritance",
                "Subclasses and Overloading",
                "Calling Super Methods",
                "Changing Behavior of Methods",
                "Overriding Methods",
                "Inheritance Challenge",
                "Polymorphism",
                "Duck Test",
                "Composition",
                "Composition Continued",
                "Test Code and Challenge",
                "Aggregation"
            ]
        },
        {
            "sectionName": "Using Databases in Python",
            "unitNames": [
                "Introduction to Databases",
                "Database Terminology",
                "Sqlite3 Install on Windows",
                "Sqlite3 Install on a Mac",
                "SQLite3 Install on Ubuntu Linux",
                "Introduction to SQLite",
                "More with SQL using SQLite",
                "Querying data with Sqlite",
                "Order by and Joins",
                "More complex Joins",
                "Wildcards and Views",
                "Housekeeping and the Challenge",
                "SQL in Python",
                "Connections, Cursors and Transactions",
                "SQL Injection Attacks",
                "Placeholders and Parameter Substitution",
                "Exceptions",
                "Exceptions Challenge",
                "Exceptions Continued",
                "Raising Exceptions",
                "More on Exceptions",
                "Custom Exceptions",
                "Rolling back Transactions",
                "Adding Database code to the Account Class",
                "GUI Database Editing Overview",
                "Ultimate Edition Database View",
                "Problems with Community Edition database plugin",
                "Update Deposit and Withdrawal Methods",
                "Displaying Time in Different Timezones",
                "SQLite3 strftime Function",
                "Challenge",
                "Problems Storing Timezones",
                "Rolling Back Transactions",
                "Simple Database Browser",
                "Scrollbars",
                "Star Args",
                "Kwargs",
                "More on KWArgs",
                "Scrollable Listbox",
                "Populating a Listbox from a Database",
                "Show Songs from Album",
                "The DataListbox Class Code",
                "Linking our DataListBoxes",
                "Linking our DataListBoxes Continued",
                "DataListbox Challenge"
            ]
        },
        {
            "sectionName": "Generators, Comprehensions and Lambda Expressions",
            "unitNames": [
                "Introduction",
                "Generators and Yield",
                "Next and Ranges",
                "Generator Examples - Fibonacci numbers and Calculating Pi",
                "The os.walk Generator",
                "Searching the Filesystem",
                "Reading Mp3 Tags",
                "List Comprehensions",
                "List Comprehensions and Side-Effects",
                "Challenge Solutions",
                "Conditional Comprehensions",
                "Conditional Expressions",
                "Challenges",
                "Challenge 1 Solution",
                "Challenge 2 Solution",
                "Nested Comprehensions",
                "Nested Comprehensions Challenge",
                "The timeit Module",
                "More on timeit",
                "timeit Continued and Challenge",
                "timeit Challenge",
                "Map Intro",
                "Map Challenge Completion",
                "The Filter Function",
                "The Reduce Function",
                "any and all",
                "Named Tuples",
                "any and all with Comprehensions",
                "Section currently being added to regularly"
            ]
        },
        {
            "sectionName": "Course Remaster in Progress",
            "unitNames": [
                "Introduction",
                "What is a dictionary?",
                "Iterating over a dictionary",
                "Adding items to a dictionary",
                "Changing values in a dictionary",
                "Removing items from a dictionary",
                "Using `in` with a dictionary",
                "Dictionary menu challenge solution",
                "Using a list with a dictionary",
                "Adding items to a dictionary",
                "Smart fridge",
                "What's for tea?",
                "Using several dictionaries together",
                "Checking the pantry",
                "Checking quantities - choosing a data structure",
                "Checking quantities - the code",
                "Solution: Create a shopping list challenge",
                "Wrong decisions don't have to be fatal",
                "The setdefault method",
                "Character counter",
                "APIs and a mobile phone demo",
                "The `dict` documentation",
                "The remaining `dict` methods",
                "The dict `update` method",
                "The dict `values` method",
                "References to mutable objects",
                "Shallow copy",
                "Shallow copy step-by-step",
                "Deep copy",
                "Simple deep copy solution",
                "Hash functions",
                "A really bad hashing function",
                "Hash tables",
                "Completing our simple dictionary implementation",
                "Hash functions and security"
            ]
        },
        {
            "sectionName": "ARCHIVED-Introduction",
            "unitNames": [
                "Introduction to the course"
            ]
        },
        {
            "sectionName": "ARCHIVED-Python Setup for Windows",
            "unitNames": [
                "Introduction",
                "Install Python on Windows",
                "IDLE On Windows with a cool demo app!",
                "Installing IntelliJ on Windows",
                "Configuring IntelliJ and Pycharm on Windows",
                "Free 90 Day Extended Trial of IntelliJ Ultimate Edition Now Available",
                "Move to next section!"
            ]
        },
        {
            "sectionName": "ARCHIVED-Python Setup for Mac",
            "unitNames": [
                "Introduction",
                "Downloading And Installing Python On Mac OS X",
                "FAQ: SSL: CERTIFICATE_VERIFY_FAILED error on Mac",
                "IDLE on Mac OS X with a cool demo app!",
                "Installing Intellij on Mac",
                "Configuring IntelliJ and Pycharm on Mac",
                "Free 90 Day Extended Trial of IntelliJ Ultimate Edition Now Available",
                "Move to next section!"
            ]
        },
        {
            "sectionName": "ARCHIVED-Python Setup for Linux",
            "unitNames": [
                "Introduction",
                "Downloading And Installing Python On Ubuntu Linux",
                "IDLE on Ubuntu Linux with a cool demo app!",
                "Installing Intellij on Linux",
                "Configuring IntelliJ and Pycharm on Linux",
                "Free 90 Day Extended Trial of IntelliJ Ultimate Edition Now Available"
            ]
        },
        {
            "sectionName": "ARCHIVED-The Basics of Python",
            "unitNames": [
                "Your Programming Careers Questions Answered",
                "Important Videos To Watch on Youtube",
                "Introduction",
                "Getting To Know Python",
                "Printing text",
                "Printing the result of a calculation",
                "Understanding More About Python",
                "Printing tabs",
                "Storing Items In Variables",
                "Integer division",
                "More About Variables And Strings",
                "String Formatting - Displaying Numbers And Strings",
                "Quiz: The Basics of Python"
            ]
        },
        {
            "sectionName": "ARCHIVED-Program Flow Control in Python",
            "unitNames": [
                "Introduction",
                "An Introduction To Program Flow Control",
                "Test Conditions With If, ElIf & Else",
                "Using if with strings",
                "More Advanced If, ElIf & Else Processing",
                "Simple condition",
                "Challenge - If Then Else",
                "For Loops",
                "For loop",
                "Extending For Loops",
                "Extracting capitals",
                "For loop with step",
                "Understanding Continue, Break And Else",
                "Break",
                "Continue",
                "Augmented Assignment",
                "augmented assignment in a loop",
                "Challenge - Program Flow - Part 1",
                "Challenge - Program Flow - Part 2",
                "While Loops",
                "Challenge - While Loop"
            ]
        },
        {
            "sectionName": "ARCHIVED-Lists, Ranges & Tuples in Python",
            "unitNames": [
                "Introduction",
                "Lists In Python",
                "More About Lists",
                "Challenge - Lists",
                "Understanding Iterators",
                "Understanding and using Ranges",
                "More About Ranges",
                "Tuples",
                "More On Tuples",
                "Lists, Ranges and Tuples"
            ]
        },
        {
            "sectionName": "ARCHIVED-The Binary number system explained",
            "unitNames": [
                "Introduction to the Section",
                "Binary Basics",
                "What is binary",
                "Hexadecimal and Octal and the Challenge"
            ]
        },
        {
            "sectionName": "Extra Information - Source code, and other stuff",
            "unitNames": [
                "Source code for all Programs",
                "Bonus Lecture and Information"
            ]
        }
    ]
}