{
    "field": {
        "name": "programming-languages",
        "courses": []
    },
    "course": {
        "title": "C# Intermediate: Classes, Interfaces and OOP",
        "subtitle": "An in-depth, step-by-step guide to classes, interfaces and object-oriented programming (OOP) with C#",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/383576_fd27_3.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/383576_fd27_3.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/383576_fd27_3.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "Very good explanations and very clear. The idea that is not necessary to call John a chef as long as the attributes of John are fulfilled by any other person is very good presented in regards of loose coupling. :)",
            "rating": 5
        },
        {
            "body": "Mosh is very knowledgeable and his lecture is well organized. I've been taking several classes. Onething I don't like about his lecture is, he mentioned Resharper way too many times. Lots of us don't want to purchase it. His repetition about how to use it etc. is really annoying. I wish he stop talking about it.",
            "rating": 2.5
        },
        {
            "body": "I have an industry experience of 14 years as a software testing engineer, but never tried to deal with code! as i was afraid of it all these years because i was always felt that code is super complex to understand and that is the reason why i was away from it\n\nBut, Mosh teachings changed my perception on coding and made my life easy in dealing with coding and now i am more interested in learning more coding concepts and more languages, all credits goes to Mosh! :)\n\nThank you a lot Mosh\n\nLoads of love",
            "rating": 5
        },
        {
            "body": "I like how this course covered the topics and way of the explanation. however it would better If there were more tests and more challenges. in general this course is the best for beginners like me.",
            "rating": 4.5
        },
        {
            "body": "The course was worth going over a few times to really understand the material. It is dense and well paced. The level of detail is amazing.",
            "rating": 5
        },
        {
            "body": "His lecture are good. But he does the marketing for his other courses and endorse the re-sharper(He mentions the word hundreds of times).\n\nIt's annoying and diverting.",
            "rating": 4
        },
        {
            "body": "The Beginner was ok. But as for intermediate, as some of the rating mentioned.. it is not easy to follow because Mosh introduces new things with not much of information that you constantly have to pause and search for what you don't understand. I now realized that I should have listened to the others in the bad comments..",
            "rating": 1
        },
        {
            "body": "Only just starting the intermediate course. Finished the Beginners Course so moving on. The beginners course was very good.. The instructor Mosh has a very good approach. Also, not having solutions to the exercises was a good move, I had to really think about what had been demonstrated earlier and how that could be applied to the exercise. I marked down the course after I had completed it due to the section on Interfaces. This really lets the course down, it feels like it was very much last minute and rushed through. It could have been explained much better in my opinion. I still think Mosh is a good instructor and will purchase the next course...",
            "rating": 3
        },
        {
            "body": "I really fell in love with Mosh's way of teaching. He just not only simplifies the concepts, but also suggests the don'ts in order to be a great developer. He even inspires one to learn more and more.",
            "rating": 5
        },
        {
            "body": "Mosh is great at breaking down complex concepts into simpler terms. After going through this course, I finally understand why we use interfaces and the value they provide!",
            "rating": 5
        },
        {
            "body": "This was a great course and perfect for advancing my understanding of object oriented programming. Mosh explains concepts in a way that is simple to understand and reiterates important points throughout the course.",
            "rating": 5
        },
        {
            "body": "Mosh you rock man! Thank you for putting this together, I am gaining so much insight from your teaching!\n\nI love the detailed examples of how things work!",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Marius Turcu",
            "email": "mariusturcu@gmail.com",
            "password": "mariusturcu",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kyle Lee",
            "email": "kylelee@gmail.com",
            "password": "kylelee",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Shankar Narayana P",
            "email": "shankarnarayanap@gmail.com",
            "password": "shankarnarayanap",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Mina Tavangar",
            "email": "minatavangar@gmail.com",
            "password": "minatavangar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Fernando Huamancaja",
            "email": "fernandohuamancaja@gmail.com",
            "password": "fernandohuamancaja",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dushyanth BR",
            "email": "dushyanthbr@gmail.com",
            "password": "dushyanthbr",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Raymond Kim",
            "email": "raymondkim@gmail.com",
            "password": "raymondkim",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Andy",
            "email": "andy@gmail.com",
            "password": "andy",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Anirudh Yendamuri",
            "email": "anirudhyendamuri@gmail.com",
            "password": "anirudhyendamuri",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Galen Casstevens",
            "email": "galencasstevens@gmail.com",
            "password": "galencasstevens",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "John Gellert",
            "email": "johngellert@gmail.com",
            "password": "johngellert",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Leif",
            "email": "leif@gmail.com",
            "password": "leif",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Mosh Hamedani",
        "email": "moshhamedani@gmail.com",
        "password": "moshhamedani",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Hi!&nbsp;My name is Mosh (Moshfegh)&nbsp;Hamedani! I'm a passionate software engineer with two decades of experience and I've taught over 3 million people who to code or how to become professional software engineers through my YouTube channel and online courses. </p><p>My goal is to make software engineering fun and accessible to everyone. That's why my courses are simple, pragmatic and free of BS. </p>"
    }
}