{
    "field": {
        "name": "data-science",
        "courses": []
    },
    "course": {
        "title": "Machine Learning A-Z™: Hands-On Python & R In Data Science",
        "subtitle": "Learn to create Machine Learning Algorithms in Python and R from two Data Science experts. Code templates included.",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/950390_270f_3.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/950390_270f_3.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/950390_270f_3.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "Behind complex mathematics and statistics, this course gives a very intuitive and comprehensive explanation about all of the subjects and gives some blueprints to analyze several problems. Really good set of tools! Thank you!",
            "rating": 4
        },
        {
            "body": "I knew nothing about ML and AI before starting this course. Now, I am very confident in solving problems. Looking for an advanced course now. Kirill and Hadelin are awesome",
            "rating": 5
        },
        {
            "body": "This course is really good. I've learned how machine learning and Deep learning work with nice examples. There is no much mathematical derivations and explanations. But this course is very fruitful for beginners.",
            "rating": 4
        },
        {
            "body": "After going through courses on other platforms I realized that this course builds your foundation in Machine learning and not just tells you how to use the libs.",
            "rating": 5
        },
        {
            "body": "I think it's a good overview of a huge topic. I feel I am very far from being a Data Scientist, but at least I can understands the big picture and discuss AI/ML/NN in polite company without looking stupid ;)",
            "rating": 5
        },
        {
            "body": "Lots of content and that part is great. Sometimes I was not able to match the results shown in the tutorial. Many people had the same problems but getting a clear response back in the Q&A section seems to be an issue.",
            "rating": 3.5
        },
        {
            "body": "This course is superb. Having completed the earlier R Programming courses from Kirill Eremenko, I obtained a fairly basic handle on the core R language (having no experience beforehand), and felt ML would be a good next challenge. I committed to complete the entire course - which is quite comprehensive - and I'm quite glad I did as I now feel as if I have enough of a handle on building up these models and can at least speak intelligently about them. The coding skills of Hadelin de Ponteves are quite impressive and there were many little tricks and takeaways that can be applied elsewhere in your work. I do have one important complaint and that is regarding working with the H2o platform in the ANN lecture. There are many, many complaints on this topic which have not been addressed by the author(s). I came to the solution after much research and it involves installing a compatible version of Java JDK on your machine. The documentation is found on the H2o website. As of today, H2o does not support the most recent version of Java (15) so you will need to download an earlier version from the Java archive. Installing/uninstalling is a bit of a pain, but good luck.",
            "rating": 5
        },
        {
            "body": "I think this is the best value for money I have ever received in my Life till now. The course price was so ridiculously low compared to the amazing classes it had. Great work guys. Kudos to Hadelin I noticed that in the entire course he has not uttered a tentative ummmm or stumbled anywhere. Simply unbelievable stamina from him and the concept explanation by Kirill!!! Thanks a million.",
            "rating": 5
        },
        {
            "body": "It was very insightful and extensive. The only problems that i faced were that my queries weren't solved when i posted them. So if you could work on that, it would be perfect!!!\n\nThank You",
            "rating": 4.5
        },
        {
            "body": "I really enjoyed this course. This course is really good for learning how to write machine learning codes in python and R. Especially, I liked how the instructors explained each and every part of the code.",
            "rating": 5
        },
        {
            "body": "Highly Recommended,\n\nHonestly, this is an amazing course. I had limited knowledge of coding but I did not feel much difficulty in understanding the concepts. All the models are explained properly to the point which is needed for application.\n\nGreat resources, good explanation.\n\nI have taken 3 more courses in addition to this. Hope it will be as amazing as this course.\n\nThank you SDS. Krill and Hadlin :)",
            "rating": 5
        },
        {
            "body": "I have no words. This is probably the best course I've ever taken on Udemy so far. The instructors are great and they always manage to make complex topics simple.\n\nShout out to them and thanks for this course.",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "José Guillermo Obando Maradiaga",
            "email": "joséguillermoobandomaradiaga@gmail.com",
            "password": "joséguillermoobandomaradiaga",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Prasanth Nutheti",
            "email": "prasanthnutheti@gmail.com",
            "password": "prasanthnutheti",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Solai Nesan",
            "email": "solainesan@gmail.com",
            "password": "solainesan",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Anuj Gupta",
            "email": "anujgupta@gmail.com",
            "password": "anujgupta",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Luca Passani",
            "email": "lucapassani@gmail.com",
            "password": "lucapassani",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Jeff Colbeck",
            "email": "jeffcolbeck@gmail.com",
            "password": "jeffcolbeck",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Andre Munoz",
            "email": "andremunoz@gmail.com",
            "password": "andremunoz",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kamal Acharya",
            "email": "kamalacharya@gmail.com",
            "password": "kamalacharya",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Adarsh Tripathy",
            "email": "adarshtripathy@gmail.com",
            "password": "adarshtripathy",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Barsha Thakur",
            "email": "barshathakur@gmail.com",
            "password": "barshathakur",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Maniteja Mujigela",
            "email": "manitejamujigela@gmail.com",
            "password": "manitejamujigela",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Thergiakis Eftychios",
            "email": "thergiakiseftychios@gmail.com",
            "password": "thergiakiseftychios",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Kirill Eremenko",
        "email": "kirilleremenko@gmail.com",
        "password": "kirilleremenko",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>My name is Kirill Eremenko and I am super-psyched that you are reading this!</p><p>Professionally, I am a Data Science management consultant with over five years of experience in finance, retail, transport and other industries. I was trained by the best analytics mentors at Deloitte Australia and today I leverage Big Data to drive business strategy, revamp customer experience and revolutionize existing operational processes.</p><p>From my courses you will straight away notice how I combine my real-life experience and academic background in Physics and Mathematics to deliver professional step-by-step coaching in the space of Data Science. I am also passionate about public speaking, and regularly present on Big Data at leading Australian universities and industry events.</p><p>To sum up, I am absolutely and utterly passionate about Data Science and I am looking forward to sharing my passion and knowledge with you!</p>"
    }
}