{
    "field": {
        "name": "data-science",
        "courses": []
    },
    "course": {
        "title": "Artificial Intelligence A-Z™: Learn How To Build An AI",
        "subtitle": "Combine the power of Data Science, Machine Learning and Deep Learning to create powerful AI for Real-World applications!",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/1219332_bdd7.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/1219332_bdd7.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/1219332_bdd7.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "The course is amazing!!! It has content that is amazing and great. I am really new in Artificial Intelligence and yet through the course I was able to grasp as much as I could. I am very excited to be on this adventure in the space of AI, things are very interesting. I look forward to learn many other interesting AIs. Great course, thank you . Keep it up.",
            "rating": 5
        },
        {
            "body": "This gave me some knowledge in artificial intelligence and helped me to know some concepts in it .. :-)",
            "rating": 4.5
        },
        {
            "body": "A great overview and examples of what AI can be used for - and what it can do. A lot of external references are given to expand your learning opportunities.",
            "rating": 5
        },
        {
            "body": "WELL, TOO LITTLE INFORMATION\n\nLESSONS PLACED IN WRONG ORDER\n\nTHE DEEP LEARNING CHAPTER SHOULD HAVE COME BEFORE THE PRACTICES",
            "rating": 1.5
        },
        {
            "body": "This is a good course. The theory part is especially very good and the tutor exactly knows what he is doing. The first AI, to build the self-driving car, was quite a difficult one to start with, considering no experience in the field. But eventually, you'll get along. The second one, Doom, was absolutely awesome and that is the one I enjoyed the most. That feeling when I saw my AI beat Doom is unexplainable :D. The third one, Breakout, is way too difficult, even the tutor mentioned that it is a bonus.\n\nOne feedback I'd like to give is that u could include a small intro to Pytorch and the functions of the same used to make the AIs in the course. Since this course has no requirements (but actually requires knowing PyTorch basics), the above could have been included.\n\nAnd explaining the structure of the AI beforehand dramatically before moving on to coding can make the coding part more intuitive, especially when starting off and not having any idea of what's ahead.\n\nAnd this course has a good support team. Never had to wait for more than a day for a reply. There are many topics that more than 20 people are equally doubtful about, so rather than asking the same question again and replying for the same, I'd recommend including the same in the course.\n\nNevertheless, the course was good overall. I took this course as a starter, and now I know the key areas I have to focus on to get a strong foundation in the field. And can boast about making an AI beat Doom. :D",
            "rating": 4
        },
        {
            "body": "Had lot of takeway from this course. Thank you guys!!..The way theory and coding part explained was understand-full.\n\nHighlight part was \"A3C\" you guys made it very simple to understand. Thanks again!..",
            "rating": 5
        },
        {
            "body": "The course breaks down the concepts and applications at a level a beginner can understand. However, the programming is outdated and becomes very frustrating to learn how to implement the code when you encounter so many problems and need to troubleshoot constantly to make it work.",
            "rating": 2
        },
        {
            "body": "I would say this course is fine but not that amazing. It will give you the right intuition and kickstart about understanding and working of AI but it won't make you confident enough on using or building your own AI. It has really good in detail theory part but implementation could have made simpler and easy. At some points so many concepts come up and you just lose interest and try to pace up with the code without understanding what's actually happening. I will consider it as more of a guide than a course to learn AI. But instructor has actually put a lot of efforts that can be seen. Secondly in Doom game project, if you're running windows 10 then probably either you have to go for a dual boot or use a virtual machine to run your training model which is something I actually don't like... There should have been something which should be compatible with all kinds or not if all atleast (Windows+Mac+Linux) OS. Thank you very much for this course!",
            "rating": 3
        },
        {
            "body": "The theory part was absolutely wonderful, I grasped every concept properly. I didn't like the coding part very much since it felt kind of rushed and also too complicated. Also, the course needs updating since many packages used in the course are outdated, especially for Doom module since it is no more available in the package. Maybe replace it with other game. But overall, I liked the course but I would really like to see it being updated.",
            "rating": 3
        },
        {
            "body": "This is a great course. The last part of CNN is more enlightening than the rest. But this course helped me to understand AI. Thank you.",
            "rating": 4.5
        },
        {
            "body": "Good introduction and thorough code, but would have liked more details explained, specifically the math involved. Also would have liked a better explanation on back propagation.",
            "rating": 3.5
        },
        {
            "body": "Starting the course you learn a lot because they explain everything, but in the second module they just explain the code. The code matter but right those libraries and call don't work anymore.\n\nI had a lot of issues trying to run the code. Pls update the course or provide us with ready to work virtual machines for every module",
            "rating": 3.5
        }
    ],
    "students": [
        {
            "name": "Lerato Mable Mashamaite",
            "email": "leratomablemashamaite@gmail.com",
            "password": "leratomablemashamaite",
            "role": "s"
        },
        {
            "name": "Harish Ragavendra",
            "email": "harishragavendra@gmail.com",
            "password": "harishragavendra",
            "role": "s"
        },
        {
            "name": "Louis Smith",
            "email": "louissmith@gmail.com",
            "password": "louissmith",
            "role": "s"
        },
        {
            "name": "Denis Noah",
            "email": "denisnoah@gmail.com",
            "password": "denisnoah",
            "role": "s"
        },
        {
            "name": "Sheereen Kallivalappil",
            "email": "sheereenkallivalappil@gmail.com",
            "password": "sheereenkallivalappil",
            "role": "s"
        },
        {
            "name": "Kishore Kumar R",
            "email": "kishorekumarr@gmail.com",
            "password": "kishorekumarr",
            "role": "s"
        },
        {
            "name": "Rodolph Sanon",
            "email": "rodolphsanon@gmail.com",
            "password": "rodolphsanon",
            "role": "s"
        },
        {
            "name": "Shivam Sahil",
            "email": "shivamsahil@gmail.com",
            "password": "shivamsahil",
            "role": "s"
        },
        {
            "name": "Rushikesh Hadole",
            "email": "rushikeshhadole@gmail.com",
            "password": "rushikeshhadole",
            "role": "s"
        },
        {
            "name": "Youping Zhang",
            "email": "youpingzhang@gmail.com",
            "password": "youpingzhang",
            "role": "s"
        },
        {
            "name": "Sias Combrinck",
            "email": "siascombrinck@gmail.com",
            "password": "siascombrinck",
            "role": "s"
        },
        {
            "name": "Wbert Castro Vera",
            "email": "wbertcastrovera@gmail.com",
            "password": "wbertcastrovera",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Hadelin de Ponteves",
        "email": "hadelindeponteves@gmail.com",
        "password": "hadelindeponteves",
        "role": "i",
        "briefIntroduction": "<p>Hadelin is the co-founder and CEO at BlueLife AI, which leverages the power of cutting edge Artificial Intelligence to empower businesses to make massive profits by innovating, automating processes and maximizing efficiency. Hadelin is also an online entrepreneur who has created 70+ top-rated educational e-courses to the world on topics such as Machine Learning, Deep Learning, Artificial Intelligence and Blockchain, which have reached 1M+ students in 210 countries.</p>"
    }
}