{
    "field": {
        "name": "data-science",
        "courses": []
    },
    "course": {
        "title": "Data Science: Natural Language Processing (NLP) in Python",
        "subtitle": "Applications: decrypting ciphers, spam detection, sentiment analysis, article spinners, and latent semantic analysis.",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/753140_f3f3_2.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/753140_f3f3_2.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/753140_f3f3_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "Got to learn new libraries and there functionality. Presenter has made the course interactive by sharing the codes which we can try apply after learning it.",
            "rating": 4
        },
        {
            "body": "It's well organized, in that each section comprises of a sub-top and each sub-top comprises of intro, theory, code and guidance for further learning.\n\nThat said, the effective video duration of the NLP content is ~4.5 hrs. while ~4.5 hrs. is basic instructional material. Not that quantity of learning hours matters, but the extra efforts could be directed towards, say building industrial quality NLP applications (using spaCy).",
            "rating": 4
        },
        {
            "body": "The course is really well explained and detailed with many examples but I would like to see more use cases",
            "rating": 5
        },
        {
            "body": "Simply amazing. Great foundational course to NLP. Just make sure you follow his instruction and try coding yourself",
            "rating": 5
        },
        {
            "body": "The instructor has a deep understanding of the audience. He has designed each section well, and with a very practical application. I had a very good time with this course. Thanks a lot for teaching me NLP.",
            "rating": 5
        },
        {
            "body": "This is a nice course and it brings up grounded approaches and good practices.\n\nWhat it lacks is depth and practical usage.\n\nFor the first, as an example you can easily get multiple times into notation that neural networks of course are better in all parameters than what is being studied here, but you go ahead study it yourself or purchase one more course from the author ))). Sometimes it is even funny\n\nAs for the practical usage, it is nice to put hands on deep learning libraries interface, but it would be much nicer to really build couple of applications that perform the real world action. To start with some model, to improve results by changing model and/or approach, to achieve really good scores and make something working. Here you basically make some that works normal at most, stop at the model selection level and get recommendation to improve it somehow yourself. Ok, not problem. But maybe there should be some benchmarking from author? Maybe exercises shall not be at the beginning, like now \"Code everything yourself after theoretical part, you shall do that\", but after practical part, like \"Now your got your hands on code, so make it better in this and this way and we see later how you performed\"\n\nAlso, it is annoying when source code is updated, but video is not. So when you try to code with author you almost always run into simple errors just because a lot of stuff has changed since than, I mean the sintax. So, the options are to spend time checking libraries' docs to fix the error or to look the source code, which is not nice.",
            "rating": 3
        },
        {
            "body": "I give the ratting after full course complication. Some basic are defined very well. but if you are look ML that course not for that. E.g. segmentation and lemmatization defined only in 3 minute video. sentiment deduction defined only for single words.",
            "rating": 1
        },
        {
            "body": "It is a good lecture and practical. I need more help in the programming details.",
            "rating": 3.5
        },
        {
            "body": "It would be great to include more in depths of sentiment analysis, example the aspect based sentiment analysis\n\nI love all the tips given",
            "rating": 3.5
        },
        {
            "body": "The content for the course was a good intro to what NLP is and what kind of problems you can solve with NLP, but the lectures are very dry. So it will help to be very self-motivated to learn from this class.",
            "rating": 3
        },
        {
            "body": "The sequence of lectures built nicely on one another. Each section started with a basic intuition followed by theory explanation and code implementation with Python. The coding solidified concepts and help with learning and capturing the lessons. The course makes a complex topic look simple and easy!",
            "rating": 5
        },
        {
            "body": "The worst course I ve taken in the last 2 years. The explanations are very poor, almost no coding, but a looot of talking. No logic in the structure of the course and in the material itself, jumping from difficult topics to first-to-learn ones. It looks like the author wants to make happy everybody: newbies and experts, but in the end it is not suitable for either of them.",
            "rating": 2
        }
    ],
    "students": [
        {
            "name": "shruchin b",
            "email": "shruchinb@gmail.com",
            "password": "shruchinb",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Neelkanth Mehta",
            "email": "neelkanthmehta@gmail.com",
            "password": "neelkanthmehta",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Matias Romo",
            "email": "matiasromo@gmail.com",
            "password": "matiasromo",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Bowen Chen",
            "email": "bowenchen@gmail.com",
            "password": "bowenchen",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Edward Yim",
            "email": "edwardyim@gmail.com",
            "password": "edwardyim",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Viktor Semenov",
            "email": "viktorsemenov@gmail.com",
            "password": "viktorsemenov",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lazy Programmer Inc.",
            "email": "lazyprogrammerinc.@gmail.com",
            "password": "lazyprogrammerinc.",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kumud Raj",
            "email": "kumudraj@gmail.com",
            "password": "kumudraj",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lazy Programmer Inc.",
            "email": "lazyprogrammerinc.@gmail.com",
            "password": "lazyprogrammerinc.",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Suryasatriya Trihandaru",
            "email": "suryasatriyatrihandaru@gmail.com",
            "password": "suryasatriyatrihandaru",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lazy Programmer Inc.",
            "email": "lazyprogrammerinc.@gmail.com",
            "password": "lazyprogrammerinc.",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Ng Gim Pei",
            "email": "nggimpei@gmail.com",
            "password": "nggimpei",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Ian Lim",
            "email": "ianlim@gmail.com",
            "password": "ianlim",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Aashish Jha",
            "email": "aashishjha@gmail.com",
            "password": "aashishjha",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Marina Pliusnina",
            "email": "marinapliusnina@gmail.com",
            "password": "marinapliusnina",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lazy Programmer Inc.",
            "email": "lazyprogrammerinc.@gmail.com",
            "password": "lazyprogrammerinc.",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Lazy Programmer Inc.",
        "email": "lazyprogrammerinc.@gmail.com",
        "password": "lazyprogrammerinc.",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Today, I spend most of my time as an artificial intelligence and machine learning engineer with a focus on deep learning, although I have also been known as a data scientist, big data engineer, and full stack software engineer.</p><p>I received my masters degree in computer engineering with a specialization in machine learning and pattern recognition.</p><p>Experience includes&nbsp;online advertising and digital media as both a data scientist (optimizing click and conversion rates)&nbsp;and big data engineer (building data processing pipelines). Some big data technologies I frequently use are Hadoop,&nbsp;Pig, Hive,&nbsp;MapReduce, and Spark.</p><p>I've created deep&nbsp;learning models to predict click-through rate and user behavior, as well as for image and signal processing and modeling text.</p><p>My work in recommendation systems has applied Reinforcement Learning and Collaborative Filtering, and we&nbsp;validated the results using A/B testing.</p><p>I have taught undergraduate and graduate students in data science, statistics, machine learning, algorithms, calculus, computer graphics, and physics for students attending universities such as Columbia University, NYU, Hunter College, and The New School.&nbsp;</p><p>Multiple businesses have benefitted from my web programming expertise. I do all the backend (server), frontend (HTML/JS/CSS), and operations/deployment work. Some of the technologies I've used are: Python, Ruby/Rails, PHP, Bootstrap, jQuery (Javascript), Backbone, and Angular. For storage/databases I've used MySQL, Postgres, Redis, MongoDB, and more.</p>"
    }
}