{
    "field": {
        "name": "game-development",
        "courses": []
    },
    "course": {
        "title": "Unreal Engine 4: How to Develop Your First Two Games",
        "subtitle": "Epic Games-Approved: learn the Unreal Editor, master the gameplay framework, and use Blueprint to program without coding",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1035484_22c9.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1035484_22c9.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1035484_22c9.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "Teaches almost everything you need to know in order to get started on a game of your own. Explains well each section, and most of the code still runs in the UE 4.17.2.",
            "rating": 5
        },
        {
            "body": "I very much enjoyed the course. The course is exactly as advertised. You are going to build a couple of games and learn the basics of the engine in a follow-along setting. I would have liked more explaining as to why we are doing what we are doing but again, the scope of the class was to follow along and build the games. I would definitely buy a foundations course from this instructor. Thank you for the great journey. I've been searching for years for a hobby or something to enjoy and be interested in, and I believe this course gave that to me. I enjoy making worlds!",
            "rating": 5
        },
        {
            "body": "this was a very well taught Unreal Engine Course. You may find it a little fast at first but go over the videos twice or thrice if you have to, as the teacher really knows what he's doing and HOW he is doing it is a great take away. i find myself coming back to this course alot when working on my own projects as there is a lot of information in it that applies to real world stuff. the particles set up section and the architectural visualization part in the beginning in particular is hard to find in any other course.\n\nI recommend it highly to any aspiring unreal engine developer.\n\nThank you Chris for a great course.",
            "rating": 5
        },
        {
            "body": "Very good course for beginners. The tutor explained the basics very well. We started off with introduction to the UI, which many find intimidating in Unreal. However, the tutor explained it in a very structured, easy to use and with a case study that helped us to relate to what we were doing.\n\nFrom the very beginning we directly jumped to a 2.5D game development which introduced us to Blueprints in much more details. We learned how to code for event capturing, movements through Blueprints.\n\nThe difficult part I felt during the entire course was the lack of detailed explanations provided for some difficult topics like material manipulation, collision and a few other things which appeared to be simplistically covered and we rushed through them. Another case was with understanding of Animation Montages in the second game example. Those are fairly complex topics, which should have been given due importance with slightly more detailed explanations. We, ourselves, would need to do some additional research on these topics to completely grasp it. This is not essentially bad, as it makes you self reliant and forces you to explore other support channels, something you'd need to use a lot after your course. Also, some of the interface elements appeared different due to the version difference. You will have to struggle and find some of the options, which are visible by default in the older versions - for instance a basic element like Modes Panel.\n\nOne suggestion I would like to give is that at the beginning of each chapter, the tutor can provide a vision of what we are going to achieve by the end of this chapter visually, and not just orally. This would help us to visualize and follow exactly what we are doing and why we are doing. Since this practice was not followed, invariably, you'll have to watch each chapter at least twice - once to understand what is being done, and second to implement and understand why and how its done. Thus, you can easily consider the course duration to be easily over 80 hours!",
            "rating": 4.5
        },
        {
            "body": "This course was a fantastic visual introduction to Unreal Engine 4. It answered a lot of the questions I had about visual design and programming in the engine. I often slowed the videos down to 0.75 speed to make it easier to follow the instructions. When there were errors in the videos, usually caused by updates to the Unreal Engine that changed functionality, the instructor was active in the Q&A section and helpful. I really enjoyed this course!",
            "rating": 4.5
        },
        {
            "body": "Great to build real functioning products, but would have liked it more if time was taken to explain more as to \"why\" things are the way they are. Also, I understand that Epic Games has a very \"strict\" game style that they expect you to follow with Unreal. If you don't follow it, Unreal will be a real pain. It would have been great if this class went into the expected structure of a game Unreal is build for and some of the programming semantics. This would have helped guide the reasoning behind certain choices and also editor workflows.",
            "rating": 3.5
        },
        {
            "body": "Labeled as a beginner course I think this is a bit too fast in parts of the course and without going and explaining on the way whats is thinking behind and goal behind some actions, overhaul detailed course and it got into a lot of useful stuff for not just this games but any game.",
            "rating": 4
        },
        {
            "body": "Some parts of the course the full detail was not shown and caused some errors but other than that it was very helpful.",
            "rating": 4.5
        },
        {
            "body": "He covers a lot of ground. I actually completed the entire course which is rare for me. I believe this course helped address (to some degree) both by known unknowns and unknown unknowns.\n\nUE4 is massive, but I feel ready to really dig into my own projects. I believe I have enough of a vocabulary now to find answers to my own questions and quickly apply it to my projects w/o watching 5 YouTube videos first :-)\n\nI recommend this course for beginners. However, like others have commented on this course, there are many instances where I felt like certain topics were glossed over. That's really, really frustrating for a noob.\n\nAnother thing that was a bit frustrating was when he would start inserting BP nodes, and I'm thinking \"where are we going with this\"? I know Chris knows where he's going but as a learner, I like to know where I'm being led.\n\nOverall a good course. Good job.",
            "rating": 3.5
        },
        {
            "body": "I have to admit that the consistency error in chapter 25 did throw me off and it might not have or did contribute to me not finding my error faster. It got frustrated sure and i posted on the Q&A board with all my blueprints in maybe a pissy way however i got the help i need in good time. The rest of the coarse has been great so far. I have no problem following along and have been inspired in the process. All in all this has been the way to go for me instead simply You tubing. The reason being that i never so far have not gotten 35 minutes into a tutorial and had the instructor tell me that he has created this whole other asset in another tutorial that we should just know how to make to complete the tutorial. From the very beginning you create every asset that you will use in the project besides Meshes which are provided. I would recommend this to anyone who is not afraid of work and knowing how the sausage is made.\n\nBe healthy and have fun!",
            "rating": 4
        },
        {
            "body": "This was a good course and takes you through quite a bit. Compliments well some of the other intro courses I've been taking. I took this course when it was already 3 years old and the Unreal Engine has changed a bit since that time. Some of the lessons won't seem to track with what your UE editor looks like. BE SURE TO CHECK THE COMMENTS that accompany each lesson in the event you seem lost. In most cases a more recent update is in there and will save you much hair-pulling. In the later lessons the instructor moves fairly quickly around parts of the UI. If you're having trouble keeping up along the way I recommend watching the lesson straight through and then going back through it to work along with it.",
            "rating": 4.5
        },
        {
            "body": "Chris is great at explaining and goes at a really good pace.\n\nIt is also good that he replies to the questions regarding bugs since that helped me out quite a bit.",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Kristian Ekdahl",
            "email": "kristianekdahl@gmail.com",
            "password": "kristianekdahl",
            "role": "s"
        },
        {
            "name": "Zachary Wauer",
            "email": "zacharywauer@gmail.com",
            "password": "zacharywauer",
            "role": "s"
        },
        {
            "name": "Tony Mbatia",
            "email": "tonymbatia@gmail.com",
            "password": "tonymbatia",
            "role": "s"
        },
        {
            "name": "Ameesh Dave",
            "email": "ameeshdave@gmail.com",
            "password": "ameeshdave",
            "role": "s"
        },
        {
            "name": "Cullen Douglas",
            "email": "cullendouglas@gmail.com",
            "password": "cullendouglas",
            "role": "s"
        },
        {
            "name": "Microbob µ",
            "email": "microbobµ@gmail.com",
            "password": "microbobµ",
            "role": "s"
        },
        {
            "name": "Nikola",
            "email": "nikola@gmail.com",
            "password": "nikola",
            "role": "s"
        },
        {
            "name": "Aaryan UE4",
            "email": "aaryanue4@gmail.com",
            "password": "aaryanue4",
            "role": "s"
        },
        {
            "name": "T J",
            "email": "tj@gmail.com",
            "password": "tj",
            "role": "s"
        },
        {
            "name": "Daniel Wasserott",
            "email": "danielwasserott@gmail.com",
            "password": "danielwasserott",
            "role": "s"
        },
        {
            "name": "John Kammer",
            "email": "johnkammer@gmail.com",
            "password": "johnkammer",
            "role": "s"
        },
        {
            "name": "Enzo Rodriguez",
            "email": "enzorodriguez@gmail.com",
            "password": "enzorodriguez",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Christopher Murphy",
        "email": "christophermurphy@gmail.com",
        "password": "christophermurphy",
        "role": "i",
        "briefIntroduction": "<p>Chris Murphy is an Evangelist for Epic Games and founder of Pub Games, an independent Australian game developer, with game development credits across PC, Vive, Oculus, PS4, iOS and Android. Chris has over 10 years of experience with Unreal Engine, a Bachelor of Computer Science and a Bachelor of Multimedia, culminating in a broad skillset across a range of game development disciplines. Chris’ role as Evangelist for Epic Games is to help independent game developers build successful games with Unreal Engine 4 through support, training and education.</p>"
    }
}