{
    "field": {
        "name": "game-development",
        "courses": []
    },
    "course": {
        "title": "The Ultimate Guide to 2D Mobile Game Development with Unity",
        "subtitle": "Created in partnership with Unity Technologies: Master C#, Unity Ads, 2D mobile game development, and publishing",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1595156_f4b8_2.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1595156_f4b8_2.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1595156_f4b8_2.jpg",
        "discountPrice": 13.99,
        "originalPrice": 149.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "Course was very helpful altogether. I really liked using abstract classes for creating enemies. I wish there were more gameplay mechanics stuff and creating additional level would be a big plus. That would make the course feel much more authentic.",
            "rating": 4.5
        },
        {
            "body": "It was awesome and quit perceivable. It could be a little bit of a difficulty if your unity version is different from the course. But still you will find and learn amazing thing throughout this game. If you can look a little deeper you will find some tiny glitches in the game, which you have to solve going forward.",
            "rating": 4.5
        },
        {
            "body": "This is the 3rd course with Jonathan I've enrolled in because he's an effective and engaging instructor. Highly recommended!\n\nMy one issue is that we covered publishing a game without sound or a Win condition. I just assumed adding the sound effects included in the assets would be covered.",
            "rating": 4.5
        },
        {
            "body": "Amazing course! Instructor is very clear and the challenges are well designed to allow for experimentation and help you learn the fundamentals.",
            "rating": 5
        },
        {
            "body": "I did a course on another platform covering similar tools in Unity like the tile palette. This course so far exceeds my expectations. I am proud to say that a month after purchasing the course, that I'm finally finished and can stand up from my desk with new skills.",
            "rating": 5
        },
        {
            "body": "It was really good however a bit slow in regards of going back and forward in the code. It seemed to be done but then you had to go back and modify it again and again. It became almost repetitive at one point.",
            "rating": 3.5
        },
        {
            "body": "I really enjoyed this course. I had a few hiccups, but the knowledge provided in the course allowed me to apply root cause analysis and figure out on my own where I was wrong. I also got great use out of the questions forum and the people were exceptionally helpful. I highly recommend this to anyone wanting to learn coding and game development.",
            "rating": 5
        },
        {
            "body": "This is a nice explain and course at all! I've finished it with Unity 2020, no problem just somewhere Unity's code is obsolete, but it's ez to fix with Google",
            "rating": 4.5
        },
        {
            "body": "Overall, I'd say this course is a bit of a mixed bag. Whether or not it's helpful to you will depend very much on what experience you already have with Unity 2D development.\n\nI've never worked with Unity before, so I think it was a helpful tutorial for me because it seems like it started at the very beginning of game development in Unity. If you already know how to make a 2D game in Unity though, you probably won't get much out of this tutorial.\n\nPersonally, I selected this one specifically because I was interested in the aspects that are unique to Android development. But the majority of the course is just general game development. Android isn't even introduced until the very end of the course and there's not much to it. I would have liked to see more mobile topics covered, especially how to store data (settings, progess, etc) on Android devices and how to create a level progression screen.\n\nI'm not a fan of the course's format, particularly the \"challenges\". I've done many courses that have a challenge element to it, but this is the first course I've taken where the challenge is to use something that hasn't even been introduced yet in the course. Typically, they would show how to do it first and then introduce a challenge to do the same thing on your own. Instead, you are expected to Google the answers for the challenges, which is something that the teacher does in the videos himself.\n\nRepetition is a big problem in this course too. A large portion of the lessons is the same repeated easy task, like slicing sprites or creating animations. There's no value in repeatedly showing the process. Instead, it just seems like filler content to make the overall course length appear longer on the Udemy listing. I'd rather see a game with just 1 or 2 characters and more of the time used to learn new things.\n\nAnother big issue I have with this course is that the instructor has abandoned it, leaving the Q&A up to the Discord community. Fortunately, the existing Q&A content on the course was able to fix any problems that came up in the course. The problems weren't really on the instructor's side, it was just issues with stuff being updated and changed.\n\nLike I said, it's a mixed bag. I'd probably only recommend it to people who have never used Unity before or those who have an extremely small amount of experience. You definitely need a basic understanding of C# or a similar language. If I wasn't a completely new person to Unity myself, my rating would probably be dramatically lower than 3 stars. However, since I can't lie and say that I walked away with nothing from this course, I'll give it an average 3 stars. It definitely could have been better.",
            "rating": 3
        },
        {
            "body": "This course is exactly as I expected it opened the new doorways for me, additional tools in my arsenal. However, when I saw the promo video of this course I noticed that there is a big giant armored enemy AI and I was excited about it and I think that part is not in this course any more or may be removed. Nevertheless, I learned enough to crack this enemy AI sorcery Thanks to the Instructor.",
            "rating": 5
        },
        {
            "body": "Jonathan is a good teacher and I learned a lot. I would have scored this course even higher if someone from the course was keeping up with the questions that students were asking. If you continue to offer this course then someone needs to continue to keep up with the questions being asked.",
            "rating": 3.5
        },
        {
            "body": "This course is not an \"Ultimate\" guide for anything. Throughout the course it makes constant reference to another course by the same author. You are instructed to do your own challenge and then have to undo it because the course has a specific way of doing things.\n\nThe level is done for you, the tools are all asset imports, many of which are no longer valid options.\n\nThe code logic taught is to simply hard code everything from UI positions to classes. The only section I found useful was setting up the Enemy class for inheritance, but then the author has you barely make use of it.\n\nI'd recommend Youtube tutorials for game development, as this barely mentions Mobile at all and it's a bare bones game tutorial at best with some free assets.",
            "rating": 1
        }
    ],
    "students": [
        {
            "name": "Petar",
            "email": "petar@gmail.com",
            "password": "petar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Azhar Qureshi",
            "email": "azharqureshi@gmail.com",
            "password": "azharqureshi",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Aaron Grincewicz",
            "email": "aarongrincewicz@gmail.com",
            "password": "aarongrincewicz",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Gilberto Felipe Pinho",
            "email": "gilbertofelipepinho@gmail.com",
            "password": "gilbertofelipepinho",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dominique Dos Santos",
            "email": "dominiquedossantos@gmail.com",
            "password": "dominiquedossantos",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Juan Mendoza",
            "email": "juanmendoza@gmail.com",
            "password": "juanmendoza",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Adam Beck",
            "email": "adambeck@gmail.com",
            "password": "adambeck",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dmitrii Konstantinov",
            "email": "dmitriikonstantinov@gmail.com",
            "password": "dmitriikonstantinov",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Wesley Branton",
            "email": "wesleybranton@gmail.com",
            "password": "wesleybranton",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Mohit Jobra",
            "email": "mohitjobra@gmail.com",
            "password": "mohitjobra",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Jim Braunreuther",
            "email": "jimbraunreuther@gmail.com",
            "password": "jimbraunreuther",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Joseph Crandal",
            "email": "josephcrandal@gmail.com",
            "password": "josephcrandal",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Jonathan Weinberger",
        "email": "jonathanweinberger@gmail.com",
        "password": "jonathanweinberger",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Hi! I'm Jon.&nbsp;I'm a<strong></strong>&nbsp;self-taught software engineer&nbsp;with over&nbsp;eight years&nbsp;of&nbsp;experience,&nbsp;and the author of&nbsp;<em>Learn Unity Programming with C#</em>.&nbsp;I've developed several&nbsp;Unity games for Cartoon Network, Adult Swim, the casino industry, and various indie game companies. I've&nbsp;also developed real world enterprise augmented reality applications&nbsp;for companies like GE, Coca-Cola, and ThyssenKrupp. I got my start in programming when I was 16 years old, developing private game servers for a popular MMO. When I decided to look at game development as a career, I struggled to find content that didn't just spoon-feed me the answers. After countless hours of learning concepts and trying to figure out the logic behind everything myself, I decided to start my own YouTube series that teaches developers to code from scratch through interactive challenges. It quickly became popular within the Unity community, and my educational career became a reality. I have a&nbsp;passion for teaching, and I love watching my students go from zero to hero, with some of them even landing big time game development jobs with companies like Oculus and Cartoon Network! Several of my students have gone on to create their own amazing titles and even start their own indie game studios! My favorite thing about programming is when you're developing a feature and the logic for how to solve a problem just \"clicks.\" That \"eureka\" moment&nbsp;is what I strive to teach all my students!<br></p><p>I am the Authorized Unity Instructor,&nbsp;working in partnership with Unity Technologies to create C# programming courses in the Unity engine for developers&nbsp;of all levels.&nbsp; The goal of this collaboration between Unity and Udemy is to make the learning curve of getting into programming less daunting, and helping experienced developers fine tune their skills.&nbsp; Currently, two courses created in partnership with Unity are available on Udemy, with two more in the works!&nbsp; Stay tuned for the latest and greatest Authorized Unity Courses!</p>"
    }
}