{
    "field": {
        "name": "game-development",
        "courses": []
    },
    "course": {
        "title": "Unreal Engine 4: How to Develop Your First Two Games",
        "subtitle": "Epic Games-Approved: learn the Unreal Editor, master the gameplay framework, and use Blueprint to program without coding",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1035484_22c9.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1035484_22c9.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1035484_22c9.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "An excellent course, explained really well! The difficulty increases gradually, and Chris really knows the best practices, compared to other instructors of Unreal Engine, where they just get the job done, but in a more messy way. Amazing course!",
            "rating": 5
        },
        {
            "body": "Really good course to start learning Unreal Engine 4. Covers all aspects of Unreal Engine, from blueprints, to level design to User Interface and animations.",
            "rating": 4
        },
        {
            "body": "Christopher Murphy presented this course in a clear an concise manner and the course provided me with a lot of good tips, tricks and ideas for my own projects.",
            "rating": 5
        },
        {
            "body": "Thanks to the course, I became self-employed and financially independent as a video game developer. The course is great!",
            "rating": 5
        },
        {
            "body": "Very good course for beginners. The tutor explained the basics very well. We started off with introduction to the UI, which many find intimidating in Unreal. However, the tutor explained it in a very structured, easy to use and with a case study that helped us to relate to what we were doing.\n\nFrom the very beginning we directly jumped to a 2.5D game development which introduced us to Blueprints in much more details. We learned how to code for event capturing, movements through Blueprints.\n\nThe difficult part I felt during the entire course was the lack of detailed explanations provided for some difficult topics like material manipulation, collision and a few other things which appeared to be simplistically covered and we rushed through them. Another case was with understanding of Animation Montages in the second game example. Those are fairly complex topics, which should have been given due importance with slightly more detailed explanations. We, ourselves, would need to do some additional research on these topics to completely grasp it. This is not essentially bad, as it makes you self reliant and forces you to explore other support channels, something you'd need to use a lot after your course. Also, some of the interface elements appeared different due to the version difference. You will have to struggle and find some of the options, which are visible by default in the older versions - for instance a basic element like Modes Panel.\n\nOne suggestion I would like to give is that at the beginning of each chapter, the tutor can provide a vision of what we are going to achieve by the end of this chapter visually, and not just orally. This would help us to visualize and follow exactly what we are doing and why we are doing. Since this practice was not followed, invariably, you'll have to watch each chapter at least twice - once to understand what is being done, and second to implement and understand why and how its done. Thus, you can easily consider the course duration to be easily over 80 hours!",
            "rating": 4.5
        },
        {
            "body": "The teaching style was very quick at times and I was hoping for a little more explanation as to why some sequence of events worked. If someone with no previous knowledge of Unreal tried this course I think they would give up quite easily. It would have been more helpful if after each sequence of functions explain from start to finish why it worked. Still learned lots about particle systems and blueprints just slow it down a little.",
            "rating": 3
        },
        {
            "body": "Speech of the instructor is a bit fast and Blurprints needs to be very well explained from the scratch so that even absolute beginners like me can easily understand. But I like the content covered in this course so far after being through with 50% of the course. May be a separate blueprint course for absolute beginners by the same instructor can help in easy understanding.",
            "rating": 3
        },
        {
            "body": "Great to build real functioning products, but would have liked it more if time was taken to explain more as to \"why\" things are the way they are. Also, I understand that Epic Games has a very \"strict\" game style that they expect you to follow with Unreal. If you don't follow it, Unreal will be a real pain. It would have been great if this class went into the expected structure of a game Unreal is build for and some of the programming semantics. This would have helped guide the reasoning behind certain choices and also editor workflows.",
            "rating": 3.5
        },
        {
            "body": "Some parts of the course the full detail was not shown and caused some errors but other than that it was very helpful.",
            "rating": 4.5
        },
        {
            "body": "This was a good course but I found it to be lacking. I really liked the instructor, his delivery, and how he didn't tend to go too slowly (though he would often go way too fast) but the course didn't teach quite as much as I would have liked. Many corners were cut and I don't feel this course was as valuable as other beginner courses. It also uses an outdated version of the editor and the instructor never updated the lectures with any kind of information to compensate. He's also not very active when it comes to answering student's questions. Still, study is study and it's worth having as part of self learning UE4 curricula.",
            "rating": 3.5
        },
        {
            "body": "Labeled as a beginner course I think this is a bit too fast in parts of the course and without going and explaining on the way whats is thinking behind and goal behind some actions, overhaul detailed course and it got into a lot of useful stuff for not just this games but any game.",
            "rating": 4
        },
        {
            "body": "Needs Blueprint images attached for reference and checking, possibly with breakdown documentation.",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "George Balasis",
            "email": "georgebalasis@gmail.com",
            "password": "georgebalasis",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Simon Duchaine",
            "email": "simonduchaine@gmail.com",
            "password": "simonduchaine",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Richard Pettitt",
            "email": "richardpettitt@gmail.com",
            "password": "richardpettitt",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Jari K",
            "email": "jarik@gmail.com",
            "password": "jarik",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ameesh Dave",
            "email": "ameeshdave@gmail.com",
            "password": "ameeshdave",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Alex Lawrence",
            "email": "alexlawrence@gmail.com",
            "password": "alexlawrence",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ankit Dighe",
            "email": "ankitdighe@gmail.com",
            "password": "ankitdighe",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Microbob µ",
            "email": "microbobµ@gmail.com",
            "password": "microbobµ",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Aaryan Khairha",
            "email": "aaryankhairha@gmail.com",
            "password": "aaryankhairha",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Kyle Burton",
            "email": "kyleburton@gmail.com",
            "password": "kyleburton",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Nikola",
            "email": "nikola@gmail.com",
            "password": "nikola",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Marc Shephard",
            "email": "marcshephard@gmail.com",
            "password": "marcshephard",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Christopher Murphy",
        "email": "christophermurphy@gmail.com",
        "password": "christophermurphy",
        "role": "i",
        "briefIntroduction": "<p>Chris Murphy is an Evangelist for Epic Games and founder of Pub Games, an independent Australian game developer, with game development credits across PC, Vive, Oculus, PS4, iOS and Android. Chris has over 10 years of experience with Unreal Engine, a Bachelor of Computer Science and a Bachelor of Multimedia, culminating in a broad skillset across a range of game development disciplines. Chris’ role as Evangelist for Epic Games is to help independent game developers build successful games with Unreal Engine 4 through support, training and education.</p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Arch Viz - Getting to know the editor basics",
            "unitNames": [
                "Introduction",
                "Toolset Overview and using the Geometry Tools",
                "Static Meshes and Materials",
                "Creating A Basic Room",
                "Detailing The Room",
                "Lighting an Environment (Part A)",
                "Lighting an Environment (Part B)",
                "Post Processing (Part A)",
                "Post Processing (Part B)",
                "Using Sequencer to Make Videos",
                "Finishing Touches (Part A)",
                "Finishing Touches (Part B)"
            ]
        },
        {
            "sectionName": "Developing a game of Pinball",
            "unitNames": [
                "Pinball - Introduction to Blueprint",
                "Using Traces",
                "Pinball - Overlaps",
                "Pinball - Lights",
                "Pinball - Flippers",
                "Pinball - User Interaction & Player Controllers",
                "Pinball - Plunger",
                "Pinball - Spawning and Delegates",
                "Pinball - Gamemode",
                "Pinball - UI",
                "Pinball - Developing a Scoring System (Part A)",
                "Pinball - Developing a Scoring System (Part B)",
                "Pinball - Entering and Displaying High Scores",
                "Pinball - Developing a Main Menu",
                "Pinball - Working with Splines",
                "Pinball - Child Actors (Part A)",
                "Pinball - Child Actors (Part B)",
                "Pinball - Event Dispatchers",
                "Pinball - Morph Targets",
                "Pinball - Adding Music and Sound",
                "Pinball - Dynamic Audio Components",
                "Pinball - Physics Interactions",
                "Pinball - Force Direction Volumes",
                "Pinball - Adding Tilt",
                "Pinball - Final Touches Part 1",
                "Pinball - Adding Decals (Part 1)",
                "Pinball - Adding Decals (Part 2)",
                "Pinball - UI Animations and Final Touches",
                "Pinball - Custom Fonts",
                "Pinball - Final Touches Part 2",
                "Pinball - Particle Effect Finalisation"
            ]
        },
        {
            "sectionName": "Developing a Survival Game",
            "unitNames": [
                "Survival Game - Introduction",
                "Landscapes - Creating a landscape",
                "Landscapes - Sculpting tools",
                "Landscapes - Painting tools",
                "Landscapes - Advanced landscape painting",
                "Landscapes - Material distance blending",
                "Landscapes - Creating landscape materials",
                "Landscapes - Material Tessellation",
                "Landscapes - Grass tool",
                "Landscapes - Foliage tool",
                "Survival Game - Building our base landscape",
                "Adding Assets -  Basic layout",
                "Adding Assets - Castle interior",
                "Adding Assets - Castle walls (Part A)",
                "Adding Assets - Castle walls (Part B)",
                "Adding Assets - Castle exterior",
                "Adding Assets - Accelerated completion",
                "Survival Game - Lighting and Post Processing",
                "Survival Game - Setting up a simple character AI",
                "Survival Game - Setting up a character mesh",
                "Survival Game - Character animation",
                "Survival Game - Setting up animation states",
                "Survival Game - Initial player setup",
                "Survival Game - Player movement input",
                "Survival Game - Simple attack animations",
                "Survival Game - Combo attack animations",
                "Survival Game - Adding weaponry",
                "Survival Game - Dealing damage",
                "Survival Game - AI Agression",
                "Survival Game - Hit reactions",
                "Survival Game - Magic effects",
                "Survival Game - Magic projectile",
                "Survival Game - Basic magic attack",
                "Survival Game - Magic attack polish",
                "Survival Game - Basic game logic",
                "Survival Game - Spawning enemies",
                "Survival Game - Creating new enemy types",
                "Survival Game - Adding health bars",
                "Survival Game - Pickups",
                "Survival Game - Wave notifications",
                "Survival Game - Death cameras",
                "Survival Game - Packaging your build"
            ]
        }
    ]
}