{
    "field": {
        "name": "game-development",
        "courses": []
    },
    "course": {
        "title": "RPG Core Combat Creator: Learn Intermediate Unity C# Coding",
        "subtitle": "Build Combat for Role Playing Game (RPG) in Unity. Tutorials Cover Code Architecture & Video Game Design.",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/1110626_255b_2.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/1110626_255b_2.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/1110626_255b_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "I did learn a lot so I do like this course. For some reason though, it is never mentioned to turn on Is Kinematic on the player's Rigidbody, which leads to wonky mishaps. I left a comment about it in a video, but hopefully it is put in a video in this course so others can learn about it.",
            "rating": 4.5
        },
        {
            "body": "I just finished this course some days ago and thought to leave a feedback here. If you know basics of Unity & C# and looking for some Intermediate course then go for this one. Their support is pro-active.\n\nThe best thing I learnt from this course is writing a clean code.\n\nThanks for this course Gamedev .tv team.\n\nKeep making more good courses like this.",
            "rating": 5
        },
        {
            "body": "I really enjoyed this course, it is packed with content and every aspect is well explained. Now I feel that I have a solid code base to build my RPG upon.",
            "rating": 5
        },
        {
            "body": "Well, first of all Rick. I will put this out that I love Rick. His bubbly personality makes his lectures quite fun to watch and he just makes it fun and puts a big smile across my face. So time passes by when he teaches. My favorite part would be the design spreadsheet when Rick says \"here is the spreadsheet. Boom. Bye\" that I think was one of the best Rick moments.\n\nNext, though Sam is a new addition he fits into Ben's shoes quite nicely. I liked his lectures not as much Rick's though. His lectures do seem a bit of a drag sometimes but at certain times he blew my mind as when I learned that Interfaces can be used to revert Dependencies and remove dependency cycles. I thought they were useless when I learned about them in my college lectures. Thank you Sam!! For blowing my mind. Also this is a bit of personal advice/bias, so do take this with a pinch of salt, but do try to spice up your lectures with probably how you screwed up in code (if you do) before recording a lecture so that we also get a chuckle and learn oh yeah that could happen toooo so that 12 mins and above lectures don't feel boring.\n\nAlso thank you for using Vscode as I would have no idea how to edit scripts without Visual Studio on linux.\n\nAlso I missed Ben dearly. It would nice if he showed up as a cameo. I would have thrown my hands in the air in exhilaration.\n\nBrain is an amazing Teaching Assistant. He answered all of my stupid questions as well showed me the way to things that I wanted to put in my game that were out of the scope of this course.\n\nFinal Verdict.\n\nIf the basic unity course was Mass Effect, then this course was Mass Effect 2. A masterpiece. (Not sure if the analogy worked though.) The basic course too was a masterpiece. But this felt more expansive. And last but not the least, Thank you!!",
            "rating": 5
        },
        {
            "body": "Another amazing course from the GameDev.tv team! I started with GameDev.tv awhile back when I was in college and since have been working as a Software Engineer. I finally had some time to pick up this course again and I love the revamp! Rick does an amazing job of sharing his game design knowledge and experience. Sam provides an excellent end-to-end solution, explanation, and coding challenges to get you set up for combat, movement, and a lot of other features for the RPG game! You can sense the passion behind each instructor as they provide clear and precise examples to every feature and line of code. The best thing about these courses is the challenges and I encourage students to use them even as an experienced software engineer the challenges keep me on my toes. Great work team and I look forward to picking up another course very shortly!",
            "rating": 5
        },
        {
            "body": "GameDev where should I even start? you great! you really do and I really happy to be part of this course and learn more. I have a lot of your courses and all of them are great! I would like from you to read this one carefully, I put a lot of effort on this review not for nothing, for the better. ❤️?\n\nWhen I started the course it was really understandable, easy, and flowing, but unfortunately I found it quite unfriendly as I moving forward, here is why. Don't get me wrong this course is great, but somethings are a little bit overwhelming because of the explanation, for example: I asked and mentioned it a lot but I thing that if you would put more effort explaining about the dictionary part (The lookUpTable) it could be great. It was really frustrating that I could not understand it, So I just gave up and leave the course for about a month. The challenges are a bit unclear, Please give us more clues that we can use, or explain a little bit more what are we really trying to do (I really struggled with understanding what we are trying to do while Sam gave me the challenges, so I had to guess... and hope that it is right). The help in the Q&A was great though, Shout out to Brian that was there just in time, and he is really trying to help and understand the problem.\n\nI learned a lot from this course and I became from a beginner programmer to more advanced and it even pushed me to learn more about the programming world thanks to you guys, please take notice about what I've said. Thank you. Great work!",
            "rating": 4
        },
        {
            "body": "It is a really good course. Sam doesn't wait around for you so be ready to hit pause from time to time if you are working along. The support is great when you get stuck or have a question.",
            "rating": 4.5
        },
        {
            "body": "Awesome Course ! The teaching is really very great, never felt that any thing is rushed throughout the course. Thanks you GameDev.tv, Sam and Rick for such a nice course.",
            "rating": 5
        },
        {
            "body": "This course is the perfect blend of good tips and bad practices... The challenges were not challenging at all, and for goodness sake it isn't a \"micro-challenge\" to write one line of script. I can't say I didn't learn anything, but I found the style and pace of the lessons to be lacking.\n\nWas this review helpful?\n\nReport\n\nSam Pattuzzi\n\nInstructor response\n•\na month ago\n\nI'm sorry you found the challenges too easy. We have a blend of different abilities and many find the challenges too hard. We don't want to demotivate folks who are finding it tricky. You can always go above and beyond by expanding on the mechanics in ways not shown in the course. There is no end to the level of challenge you can set for yourself.",
            "rating": 3
        },
        {
            "body": "This was a high-value course in my quest to expand my knowledge of Unity3d and C#. From start to finish I was always happy with the progression of the course (we even added progression to the game). I hope to utilize the knowledge gained to create and release my own indie some time. Hats off to the creators (if you wear a non-stick wig, be careful when tipping your hat off, there is a real possibility the wig could slip).",
            "rating": 5
        },
        {
            "body": "Half way mark so far so good. Like how easy it is to make weapon and enemy super quick and easy. The save system is easy to understand. like how that its actually using Binary instead of the vary limited unity player prefs. Like how it use a object type so you can save lots of different object like bool, float, ints, strings, ect. cant wait to see how it works with quests and inventory. Not a fan of the click base game however the way you have the course set up you can easily make the controls and game play however you want. I like how you explain Game architecture in a easy and clear way. I hope to see more Game design patterns in the future. I like this set up better then the old version. a lot less refactoring with more focus on they \"why's\" you chose the way you went with the game.",
            "rating": 4
        },
        {
            "body": "Brilliant course. Honestly can't believe how much i've learnt. I've been dabbling with unity for years, after taking this course the overall design and structure of my games has improved dramatically. I can finally work towards shipping a complete project.",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Christopher Steitz",
            "email": "christophersteitz@gmail.com",
            "password": "christophersteitz",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Gagandeep",
            "email": "gagandeep@gmail.com",
            "password": "gagandeep",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ron Green",
            "email": "rongreen@gmail.com",
            "password": "rongreen",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ritvik Upadhyay",
            "email": "ritvikupadhyay@gmail.com",
            "password": "ritvikupadhyay",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Justin Schmidt",
            "email": "justinschmidt@gmail.com",
            "password": "justinschmidt",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Tikokito",
            "email": "tikokito@gmail.com",
            "password": "tikokito",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ron Hatfield",
            "email": "ronhatfield@gmail.com",
            "password": "ronhatfield",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Kanishk Dhindsa",
            "email": "kanishkdhindsa@gmail.com",
            "password": "kanishkdhindsa",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Christopher Firman",
            "email": "christopherfirman@gmail.com",
            "password": "christopherfirman",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Sam Pattuzzi",
            "email": "sampattuzzi@gmail.com",
            "password": "sampattuzzi",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "mr n",
            "email": "mrn@gmail.com",
            "password": "mrn",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Dudley Mogensen",
            "email": "dudleymogensen@gmail.com",
            "password": "dudleymogensen",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Theodoros Sphikas",
            "email": "theodorossphikas@gmail.com",
            "password": "theodorossphikas",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "GameDev.tv Team",
            "email": "gamedev.tvteam@gmail.com",
            "password": "gamedev.tvteam",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Ben Tristem",
        "email": "bentristem@gmail.com",
        "password": "bentristem",
        "role": "i",
        "briefIntroduction": "<p>Hi, I'm Ben. I have a degree in computing from Imperial College London, and a physics diploma from the Open University.&nbsp; </p><p>I started working for myself at the age of 15, and never looked back. I explored careers as varied as being a commercial pilot, stunt-man, rock climbing instructor, and more. None of these provided a continued challenge, and stable income in the same way technology does.&nbsp; </p><p>After building and selling a home computer support business, I became an angel investor and business mentor here in Cambridge UK. I fell in love with teaching game development through one of my investments, and I now spend all of my time sharing my passion with people like you.&nbsp; </p><p>I can't wait to help you experience the fulfilment, and financial freedom, that having a deep understanding of technology brings.&nbsp; </p><p>So why not start learning to make games with me and my team now? </p><p>See you soon!&nbsp; </p><p>Ben</p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Introduction & Setup",
            "unitNames": [
                "Welcome To The Course",
                "Coupon For Original Course Content",
                "Install Unity 2018.3",
                "Install Visual Studio Code",
                "Not Making Intellisense?",
                "Quick Game Design Overview",
                "Architectural Overview",
                "Community & Support"
            ]
        },
        {
            "sectionName": "Basic Movement",
            "unitNames": [
                "Section Overview - Basic Movement",
                "Create A Simple Sandbox",
                "Move Using Nav Mesh Agent",
                "Refining Your Nav Mesh",
                "Introduction To Raycasting",
                "Implement Click-To-Move",
                "Quiz - Basic Movement #1",
                "Create A Fixed Follow Camera",
                "Animation Blend Trees",
                "Match Animation To Movement",
                "Basic Movement Tweaks",
                "Project Folder Structure",
                "Quiz - Basic Movement #2"
            ]
        },
        {
            "sectionName": "High Level Game Design",
            "unitNames": [
                "Section Intro - High Level Design",
                "1.5 Page Game Design Document",
                "The Player Experience",
                "First Draft Of Your GDD",
                "Quiz - High Level Design #1"
            ]
        },
        {
            "sectionName": "Basic Combat",
            "unitNames": [
                "Section Overview - Basic Combat",
                "Separating The Control Layer",
                "Namespaces To See Dependencies",
                "Raycasting For Components",
                "Implementing Action Priority",
                "Move Within Range",
                "Cancelling Combat With Movement",
                "Quiz - Basic Combat #1",
                "Decoupling Dependency Cycles",
                "Dependency Inversion With Interfaces",
                "Add Attack Animation",
                "Trigger Animation In Code",
                "Throttling Our Attacks",
                "Taking Damage",
                "Nested Prefabs And Variants",
                "Using Prefab Variants",
                "Quiz - Basic Combat #2",
                "Any State Animations",
                "Trigger Death Animation",
                "Stop Attacking Already",
                "Look Them In The Eyes",
                "Ignore Dead Enemies",
                "Bugs? What Bugs?",
                "Quiz - Basic Combat #3"
            ]
        },
        {
            "sectionName": "Enemy AI",
            "unitNames": [
                "Section Overview - Enemy AI",
                "Calculating AI Chase Distance",
                "Swappable Control Systems",
                "Disable Control When Dead",
                "Visualising With Gizmos",
                "AI Guarding Behaviour",
                "Quiz - Enemy AI #1",
                "That's Some Suspicious Behaviour",
                "Visualising Waypoints",
                "Waypoint Loops",
                "Patrolling Behaviour",
                "Dwelling At Waypoints",
                "Quiz - Enemy AI #2"
            ]
        },
        {
            "sectionName": "First Moment",
            "unitNames": [
                "Section Overview - First Moment",
                "Design A Moment",
                "Sketch Your Moment",
                "Tips To Improve Workflow",
                "Craft The Environment",
                "Hits-To-Kill Design Metric",
                "Quiz - First Moment #1",
                "Tweak Enemy Patrol",
                "Cinemachine Follow Camera",
                "Make Cinematic Sequence",
                "Trigger Cinemachine Cut Scene",
                "The Observer Pattern In C#",
                "Player Input In Cutscenes",
                "Quiz - First Moment #2"
            ]
        },
        {
            "sectionName": "Scene Management",
            "unitNames": [
                "Section Overview - Scene Management",
                "Make A Second Scene",
                "Scene Loading Portals",
                "How Coroutines Work",
                "Wait For Scene To Load",
                "Player Spawn Point",
                "Cross Scene References",
                "Canvas Groups For Fading",
                "Quiz - Scene Management #1",
                "Nested Coroutines For Fading",
                "Avoiding The Singleton Pattern",
                "Quiz - Scene Management #2"
            ]
        },
        {
            "sectionName": "Saving Asset Pack",
            "unitNames": [
                "Section Overview: Saving Asset Pack",
                "The Saving System Overview",
                "Triggering Saving And Loading",
                "Saveable Components And GameObjects",
                "Challenge: Saveable Health",
                "Checkpoints Between Scenes",
                "Loading The Saved Scene",
                "Quiz - Saving Asset Pack",
                "BONUS: Capturing Multiple Parameters",
                "BONUS: Runtime Objects"
            ]
        },
        {
            "sectionName": "Saving System",
            "unitNames": [
                "Skip Or Continue",
                "Section Overview: Saving System",
                "Save System Design",
                "Overview Of Binary Serialization",
                "File Paths In C#",
                "Understanding Unicode",
                "Filestream Read And Write In C#",
                "Converting To Binary In C#",
                "Quiz - Saving System #1",
                "BinaryFormatter For Serialization",
                "Saveable Entities",
                "Generating UUIDs In C#",
                "Editing SerializedFields",
                "Serializing With SaveableEntities",
                "Saving Multiple Scenes - Part 1",
                "Saving Multiple Scenes - Part 2",
                "Checkpoints Between Scenes",
                "ISaveable Components",
                "Quiz - Saving System #2",
                "Deduplicating UUIDs",
                "Restoring Health",
                "Reloading The Last Scene",
                "Fading Before Scene Load",
                "Quiz - Saving System #3"
            ]
        },
        {
            "sectionName": "Simple Weapons",
            "unitNames": [
                "Section Overview: Simple Weapons",
                "Equip A Weapon",
                "Animator Override Controller",
                "Creating Scriptable Objects",
                "Unarmed As A Weapon",
                "Basic Weapon Pickup",
                "Quiz - Simple Weapons #1",
                "Left Handed Weapons",
                "Make A Weapon Projectile",
                "Shoot Projectiles",
                "Damage From Projectiles",
                "Trails & Prefab Variants",
                "Quiz - Simple Weapons #2",
                "Destroy Old Weapon",
                "Improve Projectile Behaviour",
                "Fireball Weapon & Pickup",
                "Fireball Particle System",
                "Projectile Impact Effect",
                "Quiz - Simple Weapons #3",
                "Destroy The Unwanted",
                "Resetting The Default Animator",
                "Dynamic Resource Loading",
                "Saving Weapon Choice",
                "Pickup Respawning",
                "Quiz - Simple Weapons #4"
            ]
        },
        {
            "sectionName": "Character Stats",
            "unitNames": [
                "Progression Design",
                "Progression Scriptable Object",
                "Looking Up The Health Stat",
                "Debug Health Display",
                "Enemy Health Display",
                "Awarding Experience Points",
                "Editing Scriptable Object Files",
                "Quiz - Character Stats #1",
                "Finding A Stat By Enum",
                "Saving Experience Points",
                "Displaying Experience",
                "Performant Lookups With Dictionaries",
                "Levelling Up",
                "Displaying The Level",
                "Squashing Health Bugs",
                "Events And Delegates",
                "Delegates And Actions For Leveling Up",
                "Saving Race Conditions",
                "Level Up Events And Particle Effects",
                "Damage Progression",
                "Quiz - Character Stats #2",
                "Extensible Modifier System",
                "Percentage Modifiers",
                "Data Hazards And Race Conditions",
                "Hunting Down Race Conditions",
                "Awake vs Start",
                "Lazy Initialisation",
                "Progression Stats Spreadsheet",
                "Quiz - Character Stats #3"
            ]
        },
        {
            "sectionName": "Final Polish",
            "unitNames": [
                "Configurable Cursors",
                "Cursors And UI",
                "Generic Raycastable Components",
                "Cursor Type With IRaycastable",
                "Raycast Sorting",
                "Raycasting To A NavMesh",
                "Calculating A NavMesh Path",
                "Quiz - Final Polish #1",
                "In Game UI",
                "Text Fading Animation",
                "Spawning Damage Text",
                "Using Unity Events",
                "Updating The Damage Text Value",
                "Unity Events With Parameters",
                "Health Bar UI",
                "Updating The Health Bar Scale",
                "Disabling Empty Health Bars",
                "Quiz - Final Polish #2",
                "Fixing The Fader",
                "Coroutine Race Conditions",
                "Camera Facing LateUpdate Fix",
                "Sound Effects And UnityEvents",
                "Quiz - Final Polish #3",
                "Weapon Prefab Refactor",
                "Fighter To Weapon Communication",
                "Boom Microphone Audio Listener",
                "Health Pickup Hack",
                "Visual Polish Audit",
                "Visual Polish Part 1",
                "Visual Polish - Macro Details",
                "Visual Polish - Micro Details",
                "Quiz - Final Polish #4",
                "Combat Moment Fine Tuning",
                "Bug: Attacking Distant Enemies",
                "Enemy AI Agro",
                "Enemy Mob Mechanics",
                "Bug: Shooting Over Water",
                "You've Finished The Course!"
            ]
        },
        {
            "sectionName": "Continuing Your GameDev Journey",
            "unitNames": [
                "Bonus Lecture - Our Other Courses"
            ]
        }
    ]
}