{
    "field": {
        "name": "game-development",
        "courses": []
    },
    "course": {
        "title": "The Ultimate Guide to 2D Mobile Game Development with Unity",
        "subtitle": "Created in partnership with Unity Technologies: Master C#, Unity Ads, 2D mobile game development, and publishing",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1595156_f4b8_3.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1595156_f4b8_3.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1595156_f4b8_3.jpg",
        "discountPrice": 13.99,
        "originalPrice": 149.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "The assets for this course are great (and freely available from Unity without purchasing it) but the course material is lacking for me. For one thing, it doesn't make use of all the assets and cover all aspects of game development, the most notable exclusion being audio. Following the course exactly without any deviation, will result in something very buggy and very underwhelming. This will lead to bad habits in your development process going forwards, so take the time to understand and correct the mistakes if you want to be any good. It's rated for intermediate level but it's beginner level at best. I was definitely hoping for something more advanced than what was provided. Having said all that, it isn't all bad and it works well as a base guide to game development (ultimate, not so much). Also, because it is lacking in a lot of areas, it does encourage you to do your own research and alter it to get a more polished result, but only if you are willing to put in the extra effort. I was able to build on it, correct most of the issues and create what I feel was a decent demo game but it took a lot of additional work and research outside of the course itself. Overall, I did actually enjoy the course and did learn a lot, even though that was more from doing my own research than the course itself. However, I can't rate it too highly due to it not delivering what it's title suggests. This is a \"Beginners Guide to 2D Mobile Game Development\" at best.",
            "rating": 2.5
        },
        {
            "body": "Jon is an amazing instructor, his course are top level. Thank you ! Eddie",
            "rating": 5
        },
        {
            "body": "This is an excellent course that teaches a great breadth of critical concepts quickly and efficiently. It doesn't hold your hand often, but it serves as an excellent crash course into the basics of Unity/C#, animating, and publishing. Jonathan is clearly competent and passionate about the content and the class is smartly organized and well-conceived start-to-finish.\n\nI would give it 5 stars except there are a two key sections that are deprecated due to versioning (2017? course); specifically the mobile input controls and Unity Ads sections need to be updated. For me personally, I believe those obstacles are actually better in the long run for anyone serious about developing, but since they're part of the core promises of the course I would ask they be updated for a 5-star review.",
            "rating": 4.5
        },
        {
            "body": "This is the best instructor by a long shot. I was able to complete the full course using Unity version 2020.1.6f1",
            "rating": 5
        },
        {
            "body": "Course was very helpful altogether. I really liked using abstract classes for creating enemies. I wish there were more gameplay mechanics stuff and creating additional level would be a big plus. That would make the course feel much more authentic.",
            "rating": 4.5
        },
        {
            "body": "Amazing course! Instructor is very clear and the challenges are well designed to allow for experimentation and help you learn the fundamentals.",
            "rating": 5
        },
        {
            "body": "As a beginner to game development this was a good course. Very clearly presented with broadly applicable content. I feel fairly comfortable going off to develop my own games with Unity now. Some sections are starting to get out of date with the latest Unity and Play Store updates, but fixes were easy to find online.\n\nThere were a couple of downsides:\n\n(1) The game you create isn't a finished article. There is no guide for the player completing the level, adding more levels, what to do when the player dies, adding game settings or adding game audio. Arguably with the skills you learn you should be able to achieve these things on your own, but it would be useful to have some explanation in the course.\n\n(2) The course is geared toward building a game with computer device user input, which is then converted to mobile user input using buttons & toggles. Perhaps there's a good reason for it, but as a Mobile Game Dev course but it would have been helpful to learn more about the functions used for mobile device input.",
            "rating": 3.5
        },
        {
            "body": "Alright, I was very conflicted on rating this 3 stars because I really liked the first \"Ultimate Guide to Game Development\" and the \"Ultimate Guide to C#\" but this one just felt kind of...rushed? That's not to say it was a bad course by any means, it does teach new tricks to help acclimate people into more challenging coding tasks, my biggest gripe is that some aspects of the game are left unfinished and up to the user to figure it out for themselves. If this was intentional then I understand that people can't rely on courses forever and they need to learn on their own, it just would have been nice to have the option. I feel like this course just needs an update to tie up some loose ends like the flame sword, and the key to the castle, and the boots of flight, as well as the audio. Once again, this was not a bad course! It managed to hold my attention until the end, just felt like it could have been better.",
            "rating": 3
        },
        {
            "body": "Straight up - this course is not as good as Jon's introductory course to Game-Dev in Unity.\n\nGranted, it covers more advanced topics and methods, but I feel as though these topics aren't explored and justified as much as is needed in order for you to know why and when you should use them.",
            "rating": 3
        },
        {
            "body": "The teacher often confuses himself with the code, leave things bugged, implements no audio, nor completes the level programming. By the time the course finished, there's no way for the player to end the game, not even dies if he falls off the platform.",
            "rating": 1
        },
        {
            "body": "This course was not teaching as much as I hoped for. Especially since it is called the \"ultimate\" Guide for MOBILE Game Development.\n\nReasons for this bad review:\n\n- You spend most of the course time adjusting sprites and creating animations. This is nothing I would expect to \"learn\" from a MOBILE devlopment guide.\n\n- The course is focusing on desktop movement code and not mobile. In the end when we go for the mobile Code, it is using only a Unity Standard Asset and is explaining not at all how this is working. This means I actually learned NOTHING about developing mobile code in this course.\n\n- Many in this course referenced packages are no longer working. This course is over 2 years old and was not updated once.\n\n- Also in the Unity Ads Section you learn how to use an obsolete and no longer working approach. This means also this section is no longer useful.\n\n- Lastly on a lot of occasions the selected approach from the tutor to fix certain unwanted behaviour were only \"ugly quickfixes\". No one is perfect and there are arguably a lot of solutions to coding problems but in some cases the tutor only showed easy workaround and sold them as solutions.\n\nI dont reccomend to buy this course and I hope Unity is changing its rating as \"Unity approved course\" as this course is simply outdated.",
            "rating": 1
        },
        {
            "body": "There are tons of bugs and some parts are very difficult to follow and there is not a helpful community.",
            "rating": 2
        }
    ],
    "students": [
        {
            "name": "Alan Liebenberg",
            "email": "alanliebenberg@gmail.com",
            "password": "alanliebenberg",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Eduardo Ortega",
            "email": "eduardoortega@gmail.com",
            "password": "eduardoortega",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Steven May",
            "email": "stevenmay@gmail.com",
            "password": "stevenmay",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Juan",
            "email": "juan@gmail.com",
            "password": "juan",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Petar",
            "email": "petar@gmail.com",
            "password": "petar",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Gilberto Felipe Pinho",
            "email": "gilbertofelipepinho@gmail.com",
            "password": "gilbertofelipepinho",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Adam Playle",
            "email": "adamplayle@gmail.com",
            "password": "adamplayle",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Derek Sayeghe",
            "email": "dereksayeghe@gmail.com",
            "password": "dereksayeghe",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Edan Hogan Duff",
            "email": "edanhoganduff@gmail.com",
            "password": "edanhoganduff",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Gustavo Branco Gonçalves",
            "email": "gustavobrancogonçalves@gmail.com",
            "password": "gustavobrancogonçalves",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Stefan Sutterlüty",
            "email": "stefansutterlüty@gmail.com",
            "password": "stefansutterlüty",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Furkan Ulugün",
            "email": "furkanulugün@gmail.com",
            "password": "furkanulugün",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Jonathan Weinberger",
        "email": "jonathanweinberger@gmail.com",
        "password": "jonathanweinberger",
        "role": "i",
        "briefIntroduction": "<p>Hi! I'm Jon.&nbsp;I'm a<strong></strong>&nbsp;self-taught software engineer&nbsp;with over&nbsp;eight years&nbsp;of&nbsp;experience,&nbsp;and the author of&nbsp;<em>Learn Unity Programming with C#</em>.&nbsp;I've developed several&nbsp;Unity games for Cartoon Network, Adult Swim, the casino industry, and various indie game companies. I've&nbsp;also developed real world enterprise augmented reality applications&nbsp;for companies like GE, Coca-Cola, and ThyssenKrupp. I got my start in programming when I was 16 years old, developing private game servers for a popular MMO. When I decided to look at game development as a career, I struggled to find content that didn't just spoon-feed me the answers. After countless hours of learning concepts and trying to figure out the logic behind everything myself, I decided to start my own YouTube series that teaches developers to code from scratch through interactive challenges. It quickly became popular within the Unity community, and my educational career became a reality. I have a&nbsp;passion for teaching, and I love watching my students go from zero to hero, with some of them even landing big time game development jobs with companies like Oculus and Cartoon Network! Several of my students have gone on to create their own amazing titles and even start their own indie game studios! My favorite thing about programming is when you're developing a feature and the logic for how to solve a problem just \"clicks.\" That \"eureka\" moment&nbsp;is what I strive to teach all my students!<br></p><p>I am the Authorized Unity Instructor,&nbsp;working in partnership with Unity Technologies to create C# programming courses in the Unity engine for developers&nbsp;of all levels.&nbsp; The goal of this collaboration between Unity and Udemy is to make the learning curve of getting into programming less daunting, and helping experienced developers fine tune their skills.&nbsp; Currently, two courses created in partnership with Unity are available on Udemy, with two more in the works!&nbsp; Stay tuned for the latest and greatest Authorized Unity Courses!</p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Introduction",
            "unitNames": [
                "Promo",
                "Welcome",
                "Unity & Mobile Game Development"
            ]
        },
        {
            "sectionName": "Dungeon Escape",
            "unitNames": [
                "Introduction"
            ]
        },
        {
            "sectionName": "Project Setup",
            "unitNames": [
                "Introduction",
                "Unity 2018.X",
                "New Unity Project",
                "Import Dummy Assets",
                "Course Support (How to get help!)"
            ]
        },
        {
            "sectionName": "Building the Environment",
            "unitNames": [
                "Introduction",
                "Getting Started with TileMap",
                "Painting the Ground",
                "Cavern Palette",
                "Challenge - Vegetation Palette",
                "Challenge Review - Vegetation Palette",
                "Creating Midground Cavern",
                "Creating Farground Caverns",
                "Painting Foreground Items",
                "TileMap 2D Extras Download",
                "Creating Animated Tile Sets",
                "Painting Waterfalls",
                "Prefab Brushes",
                "TileMap Colliders",
                "TileMap 2D Review & Continuation"
            ]
        },
        {
            "sectionName": "Player Setup",
            "unitNames": [
                "Introduction",
                "Import Course Assets into Unity",
                "Asset Overview",
                "Android Ready",
                "Perspective Parallax",
                "Player Setup P.1",
                "Player Setup P.2",
                "Challenge - Player Movement",
                "Challenge Review - Player Movement",
                "Challenge - Player Jumping",
                "Challenge Review - Player Jumping P.1",
                "Challenge Review - Player Jumping P.2",
                "Player Jump Optimized",
                "Challenge - Player Speed",
                "Challenge Review - Player Speed",
                "Player Idle Animation",
                "Player Run Animation Setup",
                "Challenge - Player Run Animation",
                "Challenge Review - Player Run Animation",
                "Challenge - Flip Sprite",
                "Challenge Review - Flip Sprite",
                "Jump Animation Setup",
                "Challenge - Jump Animation",
                "Challenge Review - Jump Animation",
                "Run Jump Transition",
                "Fix Jump Animation",
                "Fix Player Sprite",
                "Attack Animation Setup",
                "Challenge - Attack Animation",
                "Challenge Review - Attack Animation",
                "Challenge - Running Attack Animation",
                "Challenge Review - Running Attack Animation",
                "Sword Arc Animation Setup",
                "Challenge - Sword Arc Animation",
                "Challenge Review - Sword Arc Animation",
                "Attack Animation Cleanup",
                "Challenge - Sword Arc Flip",
                "Challenge Review - Sword Arc Flip",
                "Cinemachine via Unity Packet Manager",
                "Camera Follow",
                "Player Cleanup"
            ]
        },
        {
            "sectionName": "Enemy AI",
            "unitNames": [
                "Introduction",
                "Moss Giant Setup with Idle Animation",
                "Moss Giant Walking Animation Setup",
                "Enemy Design Brief",
                "Enemy Design Discussion",
                "Enemy Class Inheritance",
                "Enemy Abstract Class",
                "Moss Giant AI Setup",
                "Challenge - Moss Giant Movement",
                "Challenge Review - Moss Giant Movement",
                "Challenge - Prevent Moving During Idle Animation",
                "Challenge Review - Prevent Moving During Idle Animation",
                "Challenge - Idle When Target Reached",
                "Challenge Review - Idle When Target Reached",
                "Challenge - Moss Giant Flip",
                "Challenge Review - Moss Giant Flip",
                "Spider Setup",
                "Spider Animation Setup",
                "Spider Animation Tree Setup",
                "Spider Waypoint Setup",
                "Challenge - Spider AI",
                "Challenge Review - Spider AI",
                "Enemy Class Shared Behaviour",
                "Skeleton Setup",
                "Skeleton Animation Setup",
                "Skeleton AI"
            ]
        },
        {
            "sectionName": "Attack System",
            "unitNames": [
                "Introduction",
                "Player Attack Hitbox Setup",
                "Player Attack Script",
                "Sword Layer",
                "Player Attack Enemy Setup",
                "Enemy Hit Animation Setup",
                "IDamageable Interface",
                "Skeleton Damage",
                "Challenge - Skeleton Damage Implementation",
                "Challenge Review - Skeleton Damage Implementation",
                "Challenge - Skeleton Damage Cooldown",
                "Challenge Review - Skeleton Damage Cooldown",
                "Skeleton Hit Animation",
                "Skeleton Freeze After Hit",
                "Skeleton InCombat Mode",
                "Challenge - Skeleton Resume Walk",
                "Challenge Review - Skeleton Resume Walk",
                "Skeleton Attack Setup",
                "Challenge - Skeleton Face Player",
                "Challenge Review - Skeleton Face Player",
                "Skeleton Hitbox Setup",
                "Skeleton Hitbox Layer",
                "Skeleton Attack Complete",
                "Moss Giant Attack Animation Setup",
                "Moss Giant Animator Setup",
                "Moss Giant Attack Complete",
                "Merge Shared Enemy Code",
                "Moss Giant Hitbox",
                "Spider Attack Setup",
                "Spider Animation Event",
                "Challenge - Spider Attack Complete",
                "Challenge Review - Spider Attack Complete",
                "Spider Attack Cleanup",
                "Death Animations Setup",
                "Death Animations Complete"
            ]
        },
        {
            "sectionName": "Loot System",
            "unitNames": [
                "Challenge - Diamond Behaviour",
                "Challenge Review - Diamond Behaviour",
                "Challenge - Loot System",
                "Challenge Review - Loot System",
                "Loot System Fix",
                "Shop Setup",
                "Shop UI",
                "Challenge - Enable Shop",
                "Challenge Review - Enable Shop",
                "UIManager",
                "OnClick Shop Events",
                "Visual Selection Shop System",
                "Challenge - Buy Items From Shop",
                "Challenge Review - Buy Items From Shop",
                "Game Manager",
                "Paint Gems to Collect",
                "HUD Creation",
                "Collect Gems",
                "Challenge - Player Health System",
                "Challenge Review - Player Health System",
                "Preparing Android Play",
                "Cross Platform Input Setup",
                "Android Mobile Touch Complete",
                "Testing in Editor"
            ]
        },
        {
            "sectionName": "Unity Ads",
            "unitNames": [
                "Introduction to Unity Ads",
                "Click Here for 100G",
                "Enable Unity Ads",
                "Rewarded Video Ad Setup",
                "Debugging with Android Studio",
                "Challenge - Reward 100 Gems",
                "Challenge Review - Reward 100 Gems",
                "Unity Dashboard"
            ]
        },
        {
            "sectionName": "Main Menu",
            "unitNames": [
                "Introduction",
                "Main Menu Setup",
                "Challenge - Main Menu Functionality",
                "Challenge Review - Main Menu Functionality",
                "Testing"
            ]
        },
        {
            "sectionName": "Publish to Google Play Store",
            "unitNames": [
                "Introduction",
                "Register Developer Account",
                "Create a Keystore File",
                "Publish to the Google Play Store"
            ]
        },
        {
            "sectionName": "Dungeon Escape: Recap & Review",
            "unitNames": [
                "Introduction"
            ]
        },
        {
            "sectionName": "Conclusion",
            "unitNames": [
                "Conclusion"
            ]
        }
    ]
}