{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Learn and Understand NodeJS",
        "subtitle": "Dive deep under the hood of NodeJS. Learn V8, Express, the MEAN stack, core Javascript concepts, and more.",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/461160_8d87_6.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/461160_8d87_6.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/461160_8d87_6.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "amazing content..",
            "rating": 4.5
        },
        {
            "body": "Anthony is amazing is the second course I am taking with him and I hope he will offer more",
            "rating": 5
        },
        {
            "body": "Very good explanation with examples on Node. I liked the focus on concepts and explanations of what is happening behind the scenes.",
            "rating": 5
        },
        {
            "body": "I enjoyed the course, as someone who is a beginner like me when it comes to NodeJS this course was a great starter for me. I like how the course didn't just tackle through coding NodeJS, but establishing some basic/fundamentals of JavaScript like the 'inheritance'.\n\nThat kind of approach made me appreciate and understood well how NodeJS works under the hood. Honestly, I bought also a different course but with an advance approach and see if I could follow it, but some of it was a bit confusing to me. But know after taking this course I am now have a pretty good understanding and I am ready to take more advance course because of this. Thank you for making such a great course with good content.",
            "rating": 5
        },
        {
            "body": "Course ends abruptly: where is \"Adding a front-end in Angular (Part 2)\"? And despite the fact that this is an extremely outdated course, that was a good experience for me and I learned a lot of new things anyway.",
            "rating": 4
        },
        {
            "body": "Course was very well structured and instructor has focused on core concepts in a very good way. Only reason I have not made it a 5 star is that I was expecting Streams and Custom Middleware implementation to be incorporated into the final project. But very well done overall !!",
            "rating": 4.5
        },
        {
            "body": "O curso se aprofunda bastante em como a tecnologia funciona e explica bem claramente a maioria dos conceitos. Porém infelizmente o curso parece que não foi finalizado, faltaram vários itens para finalizar o projeto final.",
            "rating": 3.5
        },
        {
            "body": "This is fantastic course. It offers incredibly clear explanations of underlying concepts that get glossed over in more \"advanced\" courses. Importantly, Anthony builds for you a mental map that maps closely to Node itself, helping you remember, via understanding, the derivative concepts and techniques that you ultimately implement in real-world applications. The explanation of Node's event emitter alone is already worth ten times the price of the course. I wish Anthony would produce other, similar courses on full-stack development. such as in Vue.",
            "rating": 5
        },
        {
            "body": "The course was really good as it has really built up a nice foundation for me regarding backend development in Node.js the only downpoint for the course was that it isn't updated to the latest version and/or methodologies that Node has added to itself. Regardless of that this course is really good to have a concrete and basic understanding how Node.js works under the hood.",
            "rating": 4.5
        },
        {
            "body": "This guys is properly one of the best instructors out there.\n\nI hate when instructors don't go into depth on a topic....it infuriates me; as I have to go and dig in deeper on a topic, basically paying money to go do extra research...\n\nThis guys really hones in an every topic, leaving no holes in his lecture. well- done.",
            "rating": 5
        },
        {
            "body": "Explained All the Concepts Very Well. This is a very good course. Tony is a great instructor. Thank you Tony for helping the Students, IT Professionals. Stay Blessed.",
            "rating": 4.5
        },
        {
            "body": "it was a nice course, covered many areas I needed and the teaching methods were topnotch.",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "Source Fuse",
            "email": "sourcefuse@gmail.com",
            "password": "sourcefuse",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Zohar Suslovich",
            "email": "zoharsuslovich@gmail.com",
            "password": "zoharsuslovich",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Ananda Pratim Sengupta",
            "email": "anandapratimsengupta@gmail.com",
            "password": "anandapratimsengupta",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Bernhard Paolo Cena",
            "email": "bernhardpaolocena@gmail.com",
            "password": "bernhardpaolocena",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lorenzo Granna",
            "email": "lorenzogranna@gmail.com",
            "password": "lorenzogranna",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Chandra Kiran Narava",
            "email": "chandrakirannarava@gmail.com",
            "password": "chandrakirannarava",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Vinicius Rodrigues de Moraes",
            "email": "viniciusrodriguesdemoraes@gmail.com",
            "password": "viniciusrodriguesdemoraes",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Derek LaMeux",
            "email": "dereklameux@gmail.com",
            "password": "dereklameux",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Harshvardhan Purohit",
            "email": "harshvardhanpurohit@gmail.com",
            "password": "harshvardhanpurohit",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Jeffrey McIntyre",
            "email": "jeffreymcintyre@gmail.com",
            "password": "jeffreymcintyre",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Aashinya",
            "email": "aashinya@gmail.com",
            "password": "aashinya",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Luke Ayaefu",
            "email": "lukeayaefu@gmail.com",
            "password": "lukeayaefu",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Anthony Alicea",
        "email": "anthonyalicea@gmail.com",
        "password": "anthonyalicea",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p style=\"\"> Newly married in Cleveland Ohio, Tony is primarily focused these days on trying to be a good husband. While inexperienced at that, he's quite experienced in all things web. </p> <p style=\"\"> Tony has been programming since he was 12 years old, and got into web sites and web application development at 16. After graduating with a Computer Science degree from Case Western Reserve University, Tony continued with that interest as a Microsoft certified software application developer and architect, database designer, and user interface designer. </p> <p style=\"\"> His experience has ranged across technologies such as HTML5, CSS3, ASP .NET MVC, JavaScript, jQuery, KnockoutJS, AngularJS, NodeJS, LESS, Bootstrap, SQL, Entity Framework and more. </p> <p style=\"\"> He believes strongly that deeply understanding any topic allows you to properly learn it and, even more importantly in a real-world environment, quickly overcome problems. </p> <p style=\"\"> He also has a deep interest in human nature and behavior, and how that impacts human-computer interaction. This interest translated into extending his career into user experience design and usability research. </p> <p style=\"\"> Another link in the chain is his 25 years of experience in public speaking and teaching, both in front of large groups and as a one-on-one private instructor. </p> <p style=\"\"> Putting all these pieces together, he has spent his career listening to a client need, designing a database and software to meet that need, building it, testing it, teaching others how to use it, then improving user experience by watching people actually use it and adjusting accordingly. </p> <p style=\"\"> Tony loves teaching every aspect of what he does, and even more loves teaching in a way that imparts understanding, as opposed to just examples intended to be parroted. He loves that moment when a student 'gets it', and that's what he wants for you when you take one of his courses. </p> <p style=\"\"> He has found that those that learn purely by example, and not by understanding, end up much more limited than they need to be. </p> <p style=\"\"> \"Examples need to be built on top of context, and once you have context, you can not only copy the examples you find, but adjust and improve upon them.\" </p> <p style=\"\"> <strong style=\"\"> He firmly believes that everyone has the ability to develop software, if they are just taught properly. Including you.</strong> </p> <p style=\"\"> <em style=\"\"> \"It is my pleasure and privilege to teach you. I hope you'll come away knowing something you didn't before, understanding at a level deeper than before, and feeling positive that you can accomplish what you've set out to accomplish. Thank you!\"</em> <strong style=\"\">- Tony Alicea</strong> </p> <p style=\"\"> <strong style=\"\">Ask Tony a question, read a post, or follow him around internet.</strong> </p>"
    }
}