{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Angular - The Complete Guide (2020 Edition)",
        "subtitle": "Master Angular 10 (formerly \"Angular 2\") and build awesome, reactive web apps with the successor of Angular.js",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/756150_c033_2.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/756150_c033_2.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/756150_c033_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "This course is so good, very detailed, Max teaches you the very basics to the requirements you need to build a SPA! There is also, Jost, Max's assistant who always answer all your questions. Thank you for the course!",
            "rating": 5
        },
        {
            "body": "This guy is just the best <3 Max will help you understand topics as deep as necessary.\n\nHe also has fun verbal comments :D",
            "rating": 5
        },
        {
            "body": "Basically, this course is great. I split my opinion into 4-star achievement and one star missing.\n\n4-star achievement:\n\nWell organized, most of its content is updated. This course is built in a way that helps the students to practice and internalize the material properly.\n\nHowever:\n\nOne star missing:\n\nThere is no proper introduction for RXJS operators such as map, tap, switchMap, and so on.\n\nThe Angular-Universal section was very bad explained and not updated.\n\nThe last two chapters needed to be presented earlier in this course",
            "rating": 4
        },
        {
            "body": "Max you are rockstar ! Many are shifting now a days to react but there is a solid reason angular exist's and you have done a great job.",
            "rating": 5
        },
        {
            "body": "I really love this course. As a web developer, I learned angular for a while, and this is the most clear and nice course I've ever learned.\n\nAlso I have to say Maximilian is really awesome, those bonus courses really useful, hope to learn more from him!\n\nReally helpful, thanks to Maximilian provides me this Angular complete guide!!!",
            "rating": 5
        },
        {
            "body": "Some parts of the course are still using old versions packages, Feels like, he is just changing the Name of the course only. But overall It is a Great course.",
            "rating": 4.5
        },
        {
            "body": "This course is a comprehensive compendium of knowledge about Angular. Interesting examples, understandable explanation. I recommend this course.",
            "rating": 5
        },
        {
            "body": "Request you dont mix regular concept teaching and course project.\n\nFollow only once. Course project can be added as bonus.\n\nAs the course is progressing concepts teaching also shifyted to course project. one who dont follow course project they cant understand the advanced topics even if you explain very well.",
            "rating": 3
        },
        {
            "body": "It was amazing towards the beginning, but as it got towards the bonus material some of the information might have been a bit too compressed.",
            "rating": 4.5
        },
        {
            "body": "I do appreciate the effort Max puts into these videos but I feel there is to many references to \"there\", \"here\" without clearly showing or saying what \"there\" and \"here\" is. Also, in some occasions there is fast scrolling up and down that is next to impossible to track and follow.\n\nTo many \"of course\", \"and there\", \"and then\" and explanations sometimes get tangled without any reason. In addition, better structuring the course would help, using git repo that is properly organized to track Max's progress would help rather than downloading zip files.",
            "rating": 3
        },
        {
            "body": "This is one is indeed ultimate angular course. I am coming from react, and i need angular for my new job. And this is exactly what i have been looking for. I really liked how Max structured the flow of this course so that we get all downsides and features of different approaches in angular. Additional thanks for ssr bonus lectures i learned a lot thanks to them. As always thanks a lot Max. Will be glad to see new courses from you in advance. Take care.",
            "rating": 5
        },
        {
            "body": "je suis satisfait , malheureusement il n'existe pas une version en français",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "Gulyapas Pkwsr",
            "email": "gulyapaspkwsr@gmail.com",
            "password": "gulyapaspkwsr",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Garamvölgyi Hajnal",
            "email": "garamvölgyihajnal@gmail.com",
            "password": "garamvölgyihajnal",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Haim hadad",
            "email": "haimhadad@gmail.com",
            "password": "haimhadad",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Arvind Nair",
            "email": "arvindnair@gmail.com",
            "password": "arvindnair",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Tianfu Wang",
            "email": "tianfuwang@gmail.com",
            "password": "tianfuwang",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Frontend Cognicor",
            "email": "frontendcognicor@gmail.com",
            "password": "frontendcognicor",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Tomasz Zajac",
            "email": "tomaszzajac@gmail.com",
            "password": "tomaszzajac",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Sivaprasad Somarouthu",
            "email": "sivaprasadsomarouthu@gmail.com",
            "password": "sivaprasadsomarouthu",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Jan van Wickern",
            "email": "janvanwickern@gmail.com",
            "password": "janvanwickern",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dino Buljubasic",
            "email": "dinobuljubasic@gmail.com",
            "password": "dinobuljubasic",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dmitry Stolyarov",
            "email": "dmitrystolyarov@gmail.com",
            "password": "dmitrystolyarov",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Djabali Tarik",
            "email": "djabalitarik@gmail.com",
            "password": "djabalitarik",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Maximilian Schwarzmüller",
        "email": "maximilianschwarzmüller@gmail.com",
        "password": "maximilianschwarzmüller",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p><strong>Experience as (Web) Developer</strong><br></p><p>Starting out at the age of 13 I never stopped learning new programming skills and languages. Early I started creating websites for friends and just for fun as well. Besides web development I also explored Python and other non-web-only&nbsp;languages.&nbsp;This passion has since lasted and lead to my decision of working as a freelance web developer and consultant. The success and fun I have in this job is immense and really keeps that passion burningly alive.</p><p>Starting web development on&nbsp;the backend (PHP with Laravel, NodeJS, Python) I also became more and more of a frontend developer using modern frameworks like React, Angular or VueJS 2 in a lot of projects. I&nbsp;love both worlds nowadays!</p><p>As a self-taught developer I had the chance to broaden my horizon by studying Business Administration where I hold a Master's degree. That enabled me to work in a major strategy consultancy as well as a bank. While learning, that I enjoy development more than these fields, the time in this sector greatly improved my overall experience and skills.</p><p><strong>Experience as Instructor</strong></p><p>As a self-taught professional I really know the hard parts and the difficult topics when learning new or improving on already-known languages. This background and experience enables me to focus on the most relevant key concepts and topics. My track record of many 5-star rated courses, more than 700,000 students on Udemy as well as a successful YouTube channel is the best proof for that.</p><p>Whether working as development instructor or teaching Business Administration I always received great feedback. The most rewarding experience is to see how people find new, better jobs, build awesome web applications, acquire amazing projects or simply enjoy their hobby with the help of my content.</p><p>Together with Manuel Lorenz, I founded Academind to offer the best possible learning experience to our more than 800,000 students.</p>"
    }
}