{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Vue - The Complete Guide (w/ Router, Vuex, Composition API)",
        "subtitle": "Vue.js is an awesome JavaScript Framework for building Frontend Applications! VueJS mixes the Best of Angular + React!",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/995016_ebf4_2.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/995016_ebf4_2.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/995016_ebf4_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "Je ne peux que recommander ce cours : tant sur le fond que sur la forme.\n\nMaximilian est très compréhensible et son cours est très complet : au niveau théorique c'est parfait, mais les occasions de mettre les connaissances en pratique ne manquent pas.",
            "rating": 5
        },
        {
            "body": "Holy moly, I really thought I need to brush up when Vue 3 is released. But Max updated the course... for FREE!\n\nThis is top-notch education right here!",
            "rating": 5
        },
        {
            "body": "¡Excelente curso, excelente instructor! Se nota muchísimo la experiencia y conocimiento del instructor, sabe explicar de forma clara y precisa.",
            "rating": 5
        },
        {
            "body": "Your efforts are incredible. Thanks",
            "rating": 4
        },
        {
            "body": "Maximilian Schwarzmüller is a great teacher to learn. He has amazing knowledge about Web Development and next-gen technologies in Software Development.\n\nHis course is easy to understand and catch up not only by his deep knowledge but also explaining very mindfully.\n\nDespite of some lessons is confused to me, it is not a big deal. I can still handle in my company projects",
            "rating": 4.5
        },
        {
            "body": "This course is excellent! It coveres Vue.js theory in full. Information in all modules is well explained and structured. Though some videos should be updated so to keep the course up to date from the very beginning.\n\nMax is really a great, skilled and experienced instructor explaining everything in a very detailed and understandable way! Thanks! :)",
            "rating": 5
        },
        {
            "body": "Mr. S is an absolutely amazing teacher. He goes in depth into even the smallest details and delves deep into the information, all while keeping the topics interesting and and the lectures engaging. 5/5 stars for sure. PS. His accent is also super cool.",
            "rating": 5
        },
        {
            "body": "As the title of the course already says: it is a very complete dive into Vue. The sections are split up into small and easy to follow lectures. Every section is accompanied by good example applications and one big application that can be very useful as a reference project.\n\nI bought this course a few days before the Vue 3 content was released which was added to the same course.",
            "rating": 5
        },
        {
            "body": "Max explain the material with great patience and detail.\n\nThis course is very professional and deserves only 5 starts!! no less :)",
            "rating": 5
        },
        {
            "body": "easy understanding, great mentor, gud exercises, useful assignments, and a good start for beginners",
            "rating": 5
        },
        {
            "body": "Very in depth look at Vue 2/3 a as well as Vue Router and Vuex. I love how the course was updated as soon as Vue 3 was released.",
            "rating": 5
        },
        {
            "body": "In the updated course I miss the assignments with each lecture. All the explanations are to the point and well structured. Just as a side note, do not expect Max to teach you everything, try and do stuff on your own!",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Laurent Bernabe",
            "email": "laurentbernabe@gmail.com",
            "password": "laurentbernabe",
            "role": "s"
        },
        {
            "name": "Von Yu",
            "email": "vonyu@gmail.com",
            "password": "vonyu",
            "role": "s"
        },
        {
            "name": "Agustín Bollati",
            "email": "agustínbollati@gmail.com",
            "password": "agustínbollati",
            "role": "s"
        },
        {
            "name": "IT- Vinove",
            "email": "it-vinove@gmail.com",
            "password": "it-vinove",
            "role": "s"
        },
        {
            "name": "Dat Tran",
            "email": "dattran@gmail.com",
            "password": "dattran",
            "role": "s"
        },
        {
            "name": "Татьяна",
            "email": "татьяна@gmail.com",
            "password": "татьяна",
            "role": "s"
        },
        {
            "name": "Martin Carberry",
            "email": "martincarberry@gmail.com",
            "password": "martincarberry",
            "role": "s"
        },
        {
            "name": "Patrick Angevare",
            "email": "patrickangevare@gmail.com",
            "password": "patrickangevare",
            "role": "s"
        },
        {
            "name": "Oren Sampson",
            "email": "orensampson@gmail.com",
            "password": "orensampson",
            "role": "s"
        },
        {
            "name": "Raju Moni Borah",
            "email": "rajumoniborah@gmail.com",
            "password": "rajumoniborah",
            "role": "s"
        },
        {
            "name": "Judy-lyly Pham",
            "email": "judy-lylypham@gmail.com",
            "password": "judy-lylypham",
            "role": "s"
        },
        {
            "name": "Kiro Gradovchanski",
            "email": "kirogradovchanski@gmail.com",
            "password": "kirogradovchanski",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Maximilian Schwarzmüller",
        "email": "maximilianschwarzmüller@gmail.com",
        "password": "maximilianschwarzmüller",
        "role": "i",
        "briefIntroduction": "<p><strong>Experience as (Web) Developer</strong><br></p><p>Starting out at the age of 13 I never stopped learning new programming skills and languages. Early I started creating websites for friends and just for fun as well. Besides web development I also explored Python and other non-web-only&nbsp;languages.&nbsp;This passion has since lasted and lead to my decision of working as a freelance web developer and consultant. The success and fun I have in this job is immense and really keeps that passion burningly alive.</p><p>Starting web development on&nbsp;the backend (PHP with Laravel, NodeJS, Python) I also became more and more of a frontend developer using modern frameworks like React, Angular or VueJS 2 in a lot of projects. I&nbsp;love both worlds nowadays!</p><p>As a self-taught developer I had the chance to broaden my horizon by studying Business Administration where I hold a Master's degree. That enabled me to work in a major strategy consultancy as well as a bank. While learning, that I enjoy development more than these fields, the time in this sector greatly improved my overall experience and skills.</p><p><strong>Experience as Instructor</strong></p><p>As a self-taught professional I really know the hard parts and the difficult topics when learning new or improving on already-known languages. This background and experience enables me to focus on the most relevant key concepts and topics. My track record of many 5-star rated courses, more than 700,000 students on Udemy as well as a successful YouTube channel is the best proof for that.</p><p>Whether working as development instructor or teaching Business Administration I always received great feedback. The most rewarding experience is to see how people find new, better jobs, build awesome web applications, acquire amazing projects or simply enjoy their hobby with the help of my content.</p><p>Together with Manuel Lorenz, I founded Academind to offer the best possible learning experience to our more than 800,000 students.</p>"
    }
}