{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "The Complete Web Developer in 2021: Zero to Mastery",
        "subtitle": "Learn to code and become a Web Developer in 2021 with HTML, CSS, Javascript, React, Node.js, Machine Learning & more!",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/1430746_2f43_10.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/1430746_2f43_10.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/1430746_2f43_10.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "I genuinely and whole heartedly cannot explain just how good this course actually is. I dived in head first, completely unsure on what to expect AND with zero experience of programming. Four weeks later, I emerge the other side, not only blown away by how amazing the content was, but with the confidence to create my own web applications. I honestly don't think I can describe just how worthwhile this course is. I'm already signing up for the senior dev course. Thank you, Andrei and Wolfgang.",
            "rating": 5
        },
        {
            "body": "It a good course that touches almost all the fields that is required to be a professional web developer. This course will not give you complete knowledge about everything that is required by the employers, but it will show you the path to reach your destination.",
            "rating": 5
        },
        {
            "body": "this course can change my whole life. so many question i have before purchase this course but at the end i found so much valuable skills that so much expensive than what we pay .\n\nAndrew are really really number one Teacher . Thank you so much",
            "rating": 5
        },
        {
            "body": "Great course that covers all the topics you will need to grasp to get into the world of web development. Great instructor that knows how to teach so that we as the students can take out from it as much as we can!!! <3",
            "rating": 4.5
        },
        {
            "body": "This is not only great course! This is much more: wide society that helps, perfect support, a lot of non-technical information about IT field (so important when you start). It learned how to solve problems not only how to followed the content.\n\nA lot of time, but it worth every minutes.\n\nThanks a lot!",
            "rating": 5
        },
        {
            "body": "The best course to understand how the internet and web applications work, without a doubt Andrei is the best teacher I have known throughout this wonderful world of web development.",
            "rating": 5
        },
        {
            "body": "I personally loved the course, the only downside is HEROKU. Not That Heroku is not Good. But there more efficient and DIFFERENT Cloud Services Like AWS and GCP which should have been taught in the Project. Heroku was so damn simple that I didn't need the tutorial.",
            "rating": 4.5
        },
        {
            "body": "Thank you Andrei and team for this amazing course! I can say this is more than an introduction to web development. It covers a lot that I think it is gearing towards the advanced stage which is great! I won't lie that there were concepts that I don't grasp at first but it taught me to do some work on my own like checking documentations, searching google/stackoverflow to better understand them. Highly recommended!",
            "rating": 5
        },
        {
            "body": "I cannot be more happier that I bought this course, as well as finished it! I like the way Andrei teaches, except had some issues with PostgreSQL, as I was using Windows (would not like to use it on this OS). Detalized, yet still challenging, as so many useful and interesting resources for finding out myself the issues or just reading and learning! Thank you!",
            "rating": 5
        },
        {
            "body": "I liked the course alot, Andrei is a good teacher but what i didnt liked he is never there to help students and students cant help other students in advanced things as they are also students . One more things I didnt liked that he attach articles all the time in his videos and always says that read from attached article. He should discuss in details those things as students comes from different background which is not programming. overall Andrei has a very good knowledge no doubt on it . But he should changed his way of teaching a bit.",
            "rating": 3
        },
        {
            "body": "while going through the course it feels like i am in one-to-one training, the way you teach is absolutely amazing! Thank you so much Andrei.",
            "rating": 5
        },
        {
            "body": "In-depth explanation of course topics. Focuses on the recent and most used skills needed to become a full-stack web developer. Provides a community to connect with other students and open-source projects.",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Nigel Russell",
            "email": "nigelrussell@gmail.com",
            "password": "nigelrussell",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Sulav Khadka",
            "email": "sulavkhadka@gmail.com",
            "password": "sulavkhadka",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dev Shrimali",
            "email": "devshrimali@gmail.com",
            "password": "devshrimali",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lukasz Pytel",
            "email": "lukaszpytel@gmail.com",
            "password": "lukaszpytel",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Anna Kubiak",
            "email": "annakubiak@gmail.com",
            "password": "annakubiak",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Marcos Antonio",
            "email": "marcosantonio@gmail.com",
            "password": "marcosantonio",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Sarthak Kuchhal",
            "email": "sarthakkuchhal@gmail.com",
            "password": "sarthakkuchhal",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Joseph Fabregas Miguel",
            "email": "josephfabregasmiguel@gmail.com",
            "password": "josephfabregasmiguel",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Lasma Poksane",
            "email": "lasmapoksane@gmail.com",
            "password": "lasmapoksane",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Ravi kumar singh",
            "email": "ravikumarsingh@gmail.com",
            "password": "ravikumarsingh",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Prakash Tiwari",
            "email": "prakashtiwari@gmail.com",
            "password": "prakashtiwari",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Cecilia Nucaza-Sy",
            "email": "cecilianucaza-sy@gmail.com",
            "password": "cecilianucaza-sy",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Andrei Neagoie",
        "email": "andreineagoie@gmail.com",
        "password": "andreineagoie",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Andrei is the instructor of the <strong>highest rated Development courses on Udemy as well as&nbsp;one of the fastest&nbsp;growing.&nbsp;</strong>His graduates have&nbsp;moved&nbsp;on to work for&nbsp;some of the biggest tech&nbsp;companies around the world like Apple, Google, Tesla, Amazon, JP Morgan, IBM, UNIQLO etc...&nbsp;He&nbsp;has&nbsp;been working as a senior software developer in&nbsp;Silicon Valley and Toronto for many years,&nbsp;and&nbsp;is now taking all that he has learned,&nbsp;to teach&nbsp;programming skills and&nbsp;to help you&nbsp;discover the amazing career opportunities that being a developer allows in&nbsp;life.&nbsp;</p><p>Having been&nbsp;a self taught programmer,&nbsp;he understands that there is an&nbsp;overwhelming number of online courses, tutorials and books&nbsp;that are overly verbose and inadequate at teaching proper skills.&nbsp;Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp.&nbsp;<strong>Programming skills should be affordable and open to all. An education material&nbsp;should teach real life skills that are current and&nbsp;they should not waste a student's valuable time.</strong>&nbsp;\n\nHaving learned important&nbsp;lessons from working for Fortune 500 companies, tech startups, to even&nbsp;founding his own business, he is now dedicating 100% of his time to&nbsp;teaching others valuable&nbsp;software development skills&nbsp;in order to take control of their life and work in an exciting industry with infinite possibilities.&nbsp;</p><p>Andrei promises you that there are no other courses out there as comprehensive and as well explained.&nbsp;<strong>He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way.</strong>&nbsp;</p><p>Taking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible.&nbsp;&nbsp;\n</p><p><strong>See you inside the courses!</strong></p><p><br></p>"
    }
}