{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "JavaScript: Understanding the Weird Parts",
        "subtitle": "An advanced JavaScript course for everyone! Scope, closures, prototypes, 'this', build your own framework, and more.",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/364426_2991_5.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/364426_2991_5.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/364426_2991_5.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "This course is amazing for anyone who wants to understand the weird syntax of any Javascript framework! It even includes a whole section on building one's own framework with the knowledge covered in previous chapters. I have been craving for someone to tell me why something that happens in Javascript happens the way it does and this course was the answer!! There is some material that is old but the well organized nature of this course helps you understand the language and its mysterious syntax. For everything else, there's Google!",
            "rating": 4.5
        },
        {
            "body": "I bought this course, I think 4 years ago, and I have not finished it because I find it too boring because I only wanted to code fast and everything, that kind of stuff..., but then I gave this course a second look and said to myself, \"Well why not, maybe I will watch it now, I paid for it and I got nothing to lose\". So I reset my progress and started watching this course.., Wow to my surprise, this course is by far the BEST in explaining the concepts of JS.\n\nI did not lose anything but instead, I gain something, a better understanding of JS principles.\n\nIn my opinion, if you find it hard to understand the book \"You don't know JS\", I suggest you watch this course first, then read the books. In this way, you can fully understand the beauty of the JavaScript language.\n\nThank you, Tony!",
            "rating": 5
        },
        {
            "body": "Clear. Concise. Comprehensive. Really helped me to overcome some roadblocks I encountered in my Javascript journey, particularly early on. Instructor is an excellent teacher. Would highly recommend for beginners.",
            "rating": 5
        },
        {
            "body": "This course made me think about JavaScript in a different way. It provided beautiful insight on topics about OOP, functions, execution contexts, lexical environments. The teacher has a big knowledge about JS and helped a lot, helped me to understand the subjects I mentioned above, because of his beautiful way of explaining things. He sounds very confident and clear, and with just a little amount of focus when listening to him, You can understand each topic nicely. I recommend this course to anyone, especially beginners.",
            "rating": 5
        },
        {
            "body": "It was a very informative course. I, even as a beginner, was able to understand the topics so well. It was detailed and explained very beautifully. Thank you.",
            "rating": 5
        },
        {
            "body": "Desde que vi los primeros conceptos en el video inicial se aclararon muchas dudas, gracias por darnos acceso a esa informacion.\n\ny por supuesto quiero agradecer al profesor Anthony Alicea cuyo excelente estilo y pasion por educar nos lleno de profundos conocimientos.",
            "rating": 5
        },
        {
            "body": "Learnt a great deal without any prior knowledge of JS. The best course I have found out there. Very well done Tony, thank you :)",
            "rating": 5
        },
        {
            "body": "Curso bien explicado, con detalles de las cosas que pueden ser complejas y \"obscuras\". Recomendado para principiantes e intermedios.",
            "rating": 5
        },
        {
            "body": "This course is THE BEST course I've ever enrolled on Udemy, without a doubt.\n\nThe concept of this course - \"Don't imitate, understand!\" is something that all programming language learners must appreciate.\n\nI learned javascript a long ago by imitating, and started writing codes here and there sometimes for clients and sometimes for myself. Whenever I encountered an error, I would google it, and find and \"answer\" that I can \"imitate\" to solve the error, without understand what the error actually means and what the solution actually does under the hood.\n\nI only knew WHAT works back then, hence when I confront with something that doesn't, I had no clue what to do. Needed someone to give me solutions.\n\nNow I know WHAT works and HOW that works, as well as WHY in case it doesn't, thanks to this great course.\n\nAnthony's explanation is very straight forward and easy to understand, but more importantly, the way Anthony structured this course is magical.\n\nThis course does not explain ES6+, that's NO BIG DEAL in my opinion. I even think it's on purpose. Introduction of ES6+ does not change the core of the language or how it works under the hood, and as long as you finish this course and understand what Anthony teaches you, I bet you can easily understand ES6 and start using those new features just by reading the documents - because now you can understand those documents by which you were once intimidated !\n\nThis course taught me how EXCITING programming can be! Understanding deep(and maybe 'weird') things is so much fun!\n\nThanks so much Anthony for this great course!",
            "rating": 5
        },
        {
            "body": "I've realised that I've just been scratching the surface of this amazing language. Always knew there was more to JavaScript than I was understanding and now I know there is. Thanks for this excellent course.",
            "rating": 5
        },
        {
            "body": "To be honest, I enjoyed the course but it is outdated. Sorry for poor rating, I will change my rating to five stars if the author updates this course...",
            "rating": 1
        },
        {
            "body": "You are a very good teacher that you can explain difficult concepts very well. Appreciate your effort to make animation to illustrate some of the concepts. The last few section on jQuery is quite difficult and I need to watch it a few times to fully grasp how it works. Still, more examples like this are worthwhile.",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "Yunus Indori",
            "email": "yunusindori@gmail.com",
            "password": "yunusindori",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Mark Christopher Dauz",
            "email": "markchristopherdauz@gmail.com",
            "password": "markchristopherdauz",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "G. M. Muir",
            "email": "g.m.muir@gmail.com",
            "password": "g.m.muir",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "David Pokrajac",
            "email": "davidpokrajac@gmail.com",
            "password": "davidpokrajac",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Neha Jha",
            "email": "nehajha@gmail.com",
            "password": "nehajha",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Jesus Castañeda",
            "email": "jesuscastañeda@gmail.com",
            "password": "jesuscastañeda",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Adolf Furtado",
            "email": "adolffurtado@gmail.com",
            "password": "adolffurtado",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "SpringLabs México",
            "email": "springlabsméxico@gmail.com",
            "password": "springlabsméxico",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Kota Takagi",
            "email": "kotatakagi@gmail.com",
            "password": "kotatakagi",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Mark Needham",
            "email": "markneedham@gmail.com",
            "password": "markneedham",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Mukhtar Ahmad Mukhtar",
            "email": "mukhtarahmadmukhtar@gmail.com",
            "password": "mukhtarahmadmukhtar",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ashley",
            "email": "ashley@gmail.com",
            "password": "ashley",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Anthony Alicea",
        "email": "anthonyalicea@gmail.com",
        "password": "anthonyalicea",
        "role": "i",
        "briefIntroduction": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Newly married in Cleveland Ohio, Tony is primarily focused these days on trying to be a good husband. While inexperienced at that, he's quite experienced in all things web.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Tony has been programming since he was 12 years old, and got into web sites and web application development at 16. After graduating with a Computer Science degree from Case Western Reserve University, Tony continued with that interest as a Microsoft certified software application developer and architect, database designer, and user interface designer.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;His experience has ranged across technologies such as HTML5, CSS3, ASP .NET MVC, JavaScript, jQuery, KnockoutJS, AngularJS, NodeJS, LESS, Bootstrap, SQL, Entity Framework and more.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; He believes strongly that deeply understanding any topic allows you to properly learn it and, even more importantly in a real-world environment, quickly overcome problems.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; He also has a deep interest in human nature and behavior, and how that impacts human-computer interaction. This interest translated into extending his career into user experience design and usability research.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Another link in the chain is his 25 years of experience in public speaking and teaching, both in front of large groups and as a one-on-one private instructor.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Putting all these pieces together, he has spent his career listening to a client need, designing a database and software to meet that need, building it, testing it, teaching others how to use it, then improving user experience by watching people actually use it and adjusting accordingly.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Tony loves teaching every aspect of what he does, and even more loves teaching in a way that imparts understanding, as opposed to just examples intended to be parroted. He loves that moment when a student 'gets it', and that's what he wants for you when you take one of his courses.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;He has found that those that learn purely by example, and not by understanding, end up much more limited than they need to be.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Examples need to be built on top of context, and once you have context, you can not only copy the examples you find, but adjust and improve upon them.\"&nbsp; </p><p>&nbsp; <strong> He firmly believes that everyone has the ability to develop software, if they are just taught properly. Including you.</strong>&nbsp; </p><p>&nbsp; <em> \"It is my pleasure and privilege to teach you. I hope you'll come away knowing something you didn't before, understanding at a level deeper than before, and feeling positive that you can accomplish what you've set out to accomplish. Thank you!\"</em> <strong>- Tony Alicea</strong>&nbsp; </p><p>&nbsp; <strong>Ask Tony a question, read a post, or follow him around internet.</strong>&nbsp; </p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Getting Started",
            "unitNames": [
                "Introduction and The Goal of This Course",
                "Setup",
                "Big Words and Javascript",
                "Watching this Course in High Definition",
                "Understanding, Frameworks, and The Weird Parts"
            ]
        },
        {
            "sectionName": "Execution Contexts and Lexical Environments",
            "unitNames": [
                "Conceptual Aside: Syntax Parsers, Execution Contexts, and Lexical Environments",
                "Conceptual Aside: Name/Value Pairs and Objects",
                "Downloading Source Code for This Course",
                "The Global Environment and The Global Object",
                "The Execution Context - Creation and Hoisting",
                "Conceptual Aside: Javascript and 'undefined'",
                "The Execution Context - Code Execution",
                "Conceptual Aside: Single Threaded, Synchronous Execution",
                "Function Invocation and the Execution Stack",
                "Functions, Context, and Variable Environments",
                "The Scope Chain",
                "Scope, ES6, and let",
                "What About Asynchronous Callbacks?"
            ]
        },
        {
            "sectionName": "Types and Operators",
            "unitNames": [
                "Conceptual Aside: Types and Javascript",
                "Primitive Types",
                "Conceptual Aside: Operators",
                "Operator Precedence and Associativity",
                "Operator Precedence and Associativity Table",
                "Conceptual Aside: Coercion",
                "Comparison Operators",
                "Equality Comparisons Table",
                "Existence and Booleans",
                "Default Values",
                "Framework Aside: Default Values"
            ]
        },
        {
            "sectionName": "Objects and Functions",
            "unitNames": [
                "Objects and the Dot",
                "Objects and Object Literals",
                "Framework Aside: Faking Namespaces",
                "JSON and Object Literals",
                "Functions are Objects",
                "Function Statements and Function Expressions",
                "Conceptual Aside: By Value vs By Reference",
                "Objects, Functions, and 'this'",
                "Conceptual Aside: Arrays - Collections of Anything",
                "'arguments' and spread",
                "Framework Aside: Function Overloading",
                "Conceptual Aside: Syntax Parsers",
                "Dangerous Aside: Automatic Semicolon Insertion",
                "Framework Aside: Whitespace",
                "Immediately Invoked Functions Expressions (IIFEs)",
                "Framework Aside: IIFEs and Safe Code",
                "Understanding Closures",
                "Understanding Closures - Part 2",
                "Framework Aside: Function Factories",
                "Closures and Callbacks",
                "call(), apply(), and bind()",
                "Functional Programming",
                "Functional Programming - Part 2"
            ]
        },
        {
            "sectionName": "Object-Oriented Javascript and Prototypal Inheritance",
            "unitNames": [
                "Conceptual Aside: Classical vs Prototypal Inheritance",
                "Understanding the Prototype",
                "Everything is an Object (or a primitive)",
                "Reflection and Extend"
            ]
        },
        {
            "sectionName": "Building Objects",
            "unitNames": [
                "Function Constructors, 'new', and the History of Javascript",
                "Function Constructors and '.prototype'",
                "Dangerous Aside: 'new' and functions",
                "Conceptual Aside: Built-In Function Constructors",
                "Dangerous Aside: Built-In Function Constructors",
                "Dangerous Aside: Arrays and for..in",
                "Object.create and Pure Prototypal Inheritance",
                "ES6 and Classes"
            ]
        },
        {
            "sectionName": "Odds and Ends",
            "unitNames": [
                "Initialization",
                "'typeof' , 'instanceof', and Figuring Out What Something Is",
                "Strict Mode",
                "Strict Mode Reference"
            ]
        },
        {
            "sectionName": "Examining Famous Frameworks and Libraries",
            "unitNames": [
                "Learning From Other's Good Code",
                "Deep Dive into Source Code: jQuery - Part 1",
                "Deep Dive into Source Code: jQuery - Part 2",
                "Deep Dive into Source Code: jQuery - Part 3"
            ]
        },
        {
            "sectionName": "Let's Build a Framework / Library!",
            "unitNames": [
                "Requirements",
                "Structuring Safe Code",
                "Our Object and Its Prototype",
                "Properties and Chainable Methods",
                "Adding jQuery Support",
                "Good Commenting",
                "Let's Use Our Framework",
                "A Side Note"
            ]
        },
        {
            "sectionName": "BONUS Lectures",
            "unitNames": [
                "TypeScript, ES6, and Transpiled Languages",
                "Transpiled Languages References"
            ]
        },
        {
            "sectionName": "BONUS: Getting Ready for ECMAScript 6",
            "unitNames": [
                "Existing and Upcoming Features",
                "ES6 Features Reference"
            ]
        },
        {
            "sectionName": "Conclusion",
            "unitNames": [
                "Learning to Love the Weird Parts"
            ]
        }
    ]
}