{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Learn and Understand NodeJS",
        "subtitle": "Dive deep under the hood of NodeJS. Learn V8, Express, the MEAN stack, core Javascript concepts, and more.",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/461160_8d87_6.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/461160_8d87_6.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/461160_8d87_6.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "It's a very good course for who would be waiting to know how node works behind the scene, understanding it from an architectural perspective.\n\nThe explanations are very clear and natural to follow.\n\nCongratulations and thanks for this course.",
            "rating": 5
        },
        {
            "body": "amazing content..",
            "rating": 4.5
        },
        {
            "body": "Anthony is amazing is the second course I am taking with him and I hope he will offer more",
            "rating": 5
        },
        {
            "body": "Very good explanation with examples on Node. I liked the focus on concepts and explanations of what is happening behind the scenes.",
            "rating": 5
        },
        {
            "body": "Course ends abruptly: where is \"Adding a front-end in Angular (Part 2)\"? And despite the fact that this is an extremely outdated course, that was a good experience for me and I learned a lot of new things anyway.",
            "rating": 4
        },
        {
            "body": "Course was good, but I felt need more explanation because I am new to nodejs and I didn't get the answer for the questions I posted in forum.",
            "rating": 3.5
        },
        {
            "body": "The course is fantastic, and it would be perfect if it was updated. I had so many question marks about web developing world, and now I have a clear mind about it. The contents of Node.js is very well explained. Thanks, Tony. I enjoyed learning from you.",
            "rating": 4.5
        },
        {
            "body": "Excellent course, objective content and very good explanations. A very positive point of the course is the evident domain of the content by Anthony, who manages to explain node deeply in a didactic comprehensive way. As many others have already commented, the content indeed needs to be updated, but isn't obsolete at all (2020). In my opinion, angular part at the final project was a bit rushed and maybe even unnecessary as it isn't the focus of the course, and it seems that it's unfinished which is odd.\n\nAt the end, I feel that I acquired the knowledge that I was looking for, so I'm very satisfied with it, thanks a lot!",
            "rating": 4.5
        },
        {
            "body": "This course contains very solid ideas and approaches that can be found extremely usefull for begginers and middle developers. It looks more like \"the way of developer in node.js context\" , rather than review of node.js features. Unfortunetly this course a bit outdated and unfinished and the ending is not so good as a begining. Thank you.",
            "rating": 4
        },
        {
            "body": "Nothing wrong with the course, it is very good. I never worked in JS and HTML which makes difficult for me to understand or grasp the content or details provided in the course. Would suggest, few more small applications should have been included on node JS at the end.",
            "rating": 4
        },
        {
            "body": "O curso se aprofunda bastante em como a tecnologia funciona e explica bem claramente a maioria dos conceitos. Porém infelizmente o curso parece que não foi finalizado, faltaram vários itens para finalizar o projeto final.",
            "rating": 3.5
        },
        {
            "body": "Node.js is an interesting topic and this course offers a detailed view of what it is and how it works. The lecturer is knowledgeable and articulate with a wonderful speaking voice.\n\nThere's a lot of information here, along with too much background information right down to the absolute basics of how to change directories using DIR, to what are bits and bytes, or buffers, asynchronous-synchronous, etc, giving endless detours covering elementary concepts you probably already know. It becomes frustrating. The Big Word Alert and Conceptual Asides segments really disrupt the flow being more of a jarring interruption than a helping hand.\n\nIn a way this course feels like a missed opportunity, there's some good information here, but it is outdated and unfinished - the final lecture is labeled as part 1, and has remained so for many years.",
            "rating": 3.5
        }
    ],
    "students": [
        {
            "name": "Giuliano Rezende Oliveira",
            "email": "giulianorezendeoliveira@gmail.com",
            "password": "giulianorezendeoliveira",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Source Fuse",
            "email": "sourcefuse@gmail.com",
            "password": "sourcefuse",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Zohar Suslovich",
            "email": "zoharsuslovich@gmail.com",
            "password": "zoharsuslovich",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Ananda Pratim Sengupta",
            "email": "anandapratimsengupta@gmail.com",
            "password": "anandapratimsengupta",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Lorenzo Granna",
            "email": "lorenzogranna@gmail.com",
            "password": "lorenzogranna",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "LAKSHMIPRIYA R",
            "email": "lakshmipriyar@gmail.com",
            "password": "lakshmipriyar",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Shima Madani",
            "email": "shimamadani@gmail.com",
            "password": "shimamadani",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Marcos Bastos",
            "email": "marcosbastos@gmail.com",
            "password": "marcosbastos",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Alex",
            "email": "alex@gmail.com",
            "password": "alex",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Saichetana",
            "email": "saichetana@gmail.com",
            "password": "saichetana",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Vinicius Rodrigues de Moraes",
            "email": "viniciusrodriguesdemoraes@gmail.com",
            "password": "viniciusrodriguesdemoraes",
            "role": "s",
            "isConfirmed": true
        },
        {
            "name": "Michael Thompson",
            "email": "michaelthompson@gmail.com",
            "password": "michaelthompson",
            "role": "s",
            "isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Anthony Alicea",
        "email": "anthonyalicea@gmail.com",
        "password": "anthonyalicea",
        "role": "i",
        "briefIntroduction": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Newly married in Cleveland Ohio, Tony is primarily focused these days on trying to be a good husband. While inexperienced at that, he's quite experienced in all things web.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Tony has been programming since he was 12 years old, and got into web sites and web application development at 16. After graduating with a Computer Science degree from Case Western Reserve University, Tony continued with that interest as a Microsoft certified software application developer and architect, database designer, and user interface designer.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;His experience has ranged across technologies such as HTML5, CSS3, ASP .NET MVC, JavaScript, jQuery, KnockoutJS, AngularJS, NodeJS, LESS, Bootstrap, SQL, Entity Framework and more.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; He believes strongly that deeply understanding any topic allows you to properly learn it and, even more importantly in a real-world environment, quickly overcome problems.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; He also has a deep interest in human nature and behavior, and how that impacts human-computer interaction. This interest translated into extending his career into user experience design and usability research.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Another link in the chain is his 25 years of experience in public speaking and teaching, both in front of large groups and as a one-on-one private instructor.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Putting all these pieces together, he has spent his career listening to a client need, designing a database and software to meet that need, building it, testing it, teaching others how to use it, then improving user experience by watching people actually use it and adjusting accordingly.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Tony loves teaching every aspect of what he does, and even more loves teaching in a way that imparts understanding, as opposed to just examples intended to be parroted. He loves that moment when a student 'gets it', and that's what he wants for you when you take one of his courses.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;He has found that those that learn purely by example, and not by understanding, end up much more limited than they need to be.&nbsp; </p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"Examples need to be built on top of context, and once you have context, you can not only copy the examples you find, but adjust and improve upon them.\"&nbsp; </p><p>&nbsp; <strong> He firmly believes that everyone has the ability to develop software, if they are just taught properly. Including you.</strong>&nbsp; </p><p>&nbsp; <em> \"It is my pleasure and privilege to teach you. I hope you'll come away knowing something you didn't before, understanding at a level deeper than before, and feeling positive that you can accomplish what you've set out to accomplish. Thank you!\"</em> <strong>- Tony Alicea</strong>&nbsp; </p><p>&nbsp; <strong>Ask Tony a question, read a post, or follow him around internet.</strong>&nbsp; </p>",
        "isConfirmed": true
    },
    "curriculum": [
        {
            "sectionName": "Introduction and Setup",
            "unitNames": [
                "Introduction and the Goal of this Course",
                "Big Words and NodeJS",
                "Watching this Course in High Definition",
                "Conceptual Aside: The Command Line Interface",
                "Command Line References"
            ]
        },
        {
            "sectionName": "V8: The Javascript Engine",
            "unitNames": [
                "Conceptual Aside: Processors, Machine Language, and C++",
                "Javascript Aside: Javascript Engines and The ECMAScript Specification",
                "V8 Under the Hood",
                "Adding Features to Javascript"
            ]
        },
        {
            "sectionName": "The Node Core",
            "unitNames": [
                "Conceptual Aside: Servers and Clients",
                "What Does Javascript Need to Manage a Server?",
                "The C++ Core",
                "The Javascript Core",
                "Downloading Lecture Source Code",
                "Let's Install and Run Some Javascript in Node"
            ]
        },
        {
            "sectionName": "Modules, Exports, and Require",
            "unitNames": [
                "Conceptual Aside: Modules",
                "Javascript Aside: First-Class Functions and Function Expressions",
                "Let's Build a Module",
                "Javascript Aside: Objects and Object Literals",
                "Javascript Aside: Prototypal Inheritance and Function Constructors",
                "Javascript Aside: By Reference and By Value",
                "Javascript Aside: Immediately Invoked Function Expressions (IIFEs)",
                "How Do Node Modules Really Work?: module.exports and require",
                "Javascript Aside: JSON",
                "More on require",
                "Module Patterns",
                "exports vs module.exports",
                "Requiring Native (Core) Modules",
                "Modules and ES6",
                "Web Server Checklist"
            ]
        },
        {
            "sectionName": "Events and the Event Emitter",
            "unitNames": [
                "Conceptual Aside: Events",
                "Javascript Aside: Object Properties, First Class Functions, and Arrays",
                "The Node Event Emitter - Part 1",
                "The Node Event Emitter - Part 2",
                "Javascript Aside: Object.create and Prototypes",
                "Inheriting From the Event Emitter",
                "Javascript Aside: Node, ES6, and Template Literals",
                "Javascript Aside: .call and .apply",
                "Inheriting From the Event Emitter - Part 2",
                "Javascript Aside: ES6 Classes",
                "Inheriting From the Event Emitter - Part 3"
            ]
        },
        {
            "sectionName": "Asynchronous Code, libuv, The Event Loop, Streams, Files, and more…",
            "unitNames": [
                "Javascript Aside: Javascript is Synchronous",
                "Conceptual Aside: Callbacks",
                "libuv, The Event Loop, and Non-Blocking Asynchronous Execution",
                "Conceptual Aside: Streams and Buffers",
                "Conceptual Aside: Binary Data, Character Sets, and Encodings",
                "Buffers",
                "ES6 Typed Arrays",
                "Javascript Aside: Callbacks",
                "Files and fs",
                "Streams",
                "Conceptual Aside: Pipes",
                "Pipes",
                "Web Server Checklist"
            ]
        },
        {
            "sectionName": "HTTP and being a Web Server",
            "unitNames": [
                "Conceptual Aside: TCP/IP",
                "Conceptual Aside: Addresses and Ports",
                "Conceptual Aside: HTTP",
                "http_parser",
                "Let's Build a Web Server in Node",
                "Outputting HTML and Templates",
                "Streams and Performance",
                "Conceptual Aside: APIs and Endpoints",
                "Outputting JSON",
                "Routing",
                "Web Server Checklist"
            ]
        },
        {
            "sectionName": "NPM: the Node Package Manager",
            "unitNames": [
                "Conceptual Aside: Packages and Package Managers",
                "Conceptual Aside: Semantic Versioning (semver)",
                "npm and the npm registry: Other People's Code",
                "init, nodemon, and package.json",
                "npm Global Installation",
                "init, nodemon, and package.json - Part 2",
                "Using Other People's Code"
            ]
        },
        {
            "sectionName": "Express",
            "unitNames": [
                "Installing Express and Making it Easier to Build a Web Server",
                "Routes",
                "Static Files and Middleware",
                "Templates and Template Engines",
                "Querystring and Post Parameters",
                "RESTful APIs and JSON",
                "Structuring an App"
            ]
        },
        {
            "sectionName": "Javascript, JSON, and Databases",
            "unitNames": [
                "Conceptual Aside: Relational Databases and SQL",
                "Node and MySQL",
                "Conceptual Aside: NoSQL and Documents",
                "MongoDB and Mongoose",
                "Web Server Checklist"
            ]
        },
        {
            "sectionName": "The MEAN stack",
            "unitNames": [
                "MongoDB, Express, AngularJS, and NodeJS",
                "AngularJS: Managing the Client",
                "AngularJS: Managing the Client (Part 2)",
                "AngularJS: Managing the Client (Part 3)",
                "Conceptual Aside: Angular 1, Angular 2, React, and more…",
                "Working with The Full Stack (and being a Full Stack Developer) - Part 1"
            ]
        },
        {
            "sectionName": "Let's Build an App! (in record time)",
            "unitNames": [
                "NodeTodo: Software Requirements",
                "Initial Setup",
                "Setting up Mongo and Mongoose",
                "Adding Seed Data",
                "Creating our API",
                "Testing our API",
                "Adding a Front-End in Angular 2 (Part 1)"
            ]
        }
    ]
}