{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "The Complete JavaScript Course 2020: From Zero to Expert!",
        "subtitle": "The modern JavaScript course for everyone! Master JavaScript with projects, challenges and theory. Many courses in one!",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/851712_fc61_6.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/851712_fc61_6.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/851712_fc61_6.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "It is an amazing course, earlier I didn't have the confidence to work on UI but after this course, I have the confidence that I can build and understand the code that is written by any JS developer.",
            "rating": 5
        },
        {
            "body": "Awesome course for beginners ,teaches you more than just Javascript,this course teaches you ,what you would do when you actually end up in a Javascript deeveloper job ,all the practical concpets which are used in the companies are taught ,like babel,webpack ,how to setup a localhost, MVC ,HTML DOM manipulation ,ES6 and many such practical real world concepts are covered rather than just the basic syntax of Javascript which you can study from W3schools also,So this is a must do course for a beginner who wants to be a Javascript developer.",
            "rating": 4.5
        },
        {
            "body": "Very Awesome !! explained the java script the way a programmer should think and program , very good , i loved it",
            "rating": 5
        },
        {
            "body": "Yes content is really awesome and way of teaching is very nice. Generally people get bore in short span of time during courses but this is amazing.",
            "rating": 5
        },
        {
            "body": "Amazing course! Enjoyed making forkify project and in turn learned a whole lot of new concepts in JS.",
            "rating": 5
        },
        {
            "body": "Thank u so much for this amazing flood of knowledge on the topic, really appreciate ur efforts to make coding a real easy hobby.",
            "rating": 4
        },
        {
            "body": "I can say this course is may be the best course for JavaScript on Udemy in many aspects. The way Jonas organizes, explains and helps the student to learn is clear and smooth, unlike many course out there. I wish if he can create a new version or even update this course to more JavaScript concepts and make it a Modular complete Guide, because it lacks many aspects especially the advanced ones.",
            "rating": 4.5
        },
        {
            "body": "This is a very good course it covers the basics part pretty well. Take note, you really have to slow down on the advance parts specially at Section 5. Also those coding challenges are just a pain in the butt so watch out for those :)",
            "rating": 3.5
        },
        {
            "body": "Amazing depth and very good teaching style. Absolutely would recommend it to anyone!",
            "rating": 5
        },
        {
            "body": "This course get a very high rating from me as it's pretty easy to follow.\n\nThis could also be down to the fact that I recently learned python and quite a few of the fundamentals are the same.",
            "rating": 5
        },
        {
            "body": "Jonas has a great way of teaching. He has very intelligently structured the whole course and indeed, anyone could learn JavaScript, and that too in very less time. He moves to the next topic very smoothly, and intelligently interrelates the previous topic.",
            "rating": 5
        },
        {
            "body": "Jonas is a great teacher, who explain concepts the best way that you can imagine. Hands up to the teaching assistants who instantly reply to questions. This is a great course that every JS programmer should consider taking!",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Aakash",
            "email": "aakash@gmail.com",
            "password": "aakash",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Shashank Jain",
            "email": "shashankjain@gmail.com",
            "password": "shashankjain",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Sahil Pathania",
            "email": "sahilpathania@gmail.com",
            "password": "sahilpathania",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Learning Development",
            "email": "learningdevelopment@gmail.com",
            "password": "learningdevelopment",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kundan Thakur",
            "email": "kundanthakur@gmail.com",
            "password": "kundanthakur",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Medlife Dev",
            "email": "medlifedev@gmail.com",
            "password": "medlifedev",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Mounir Belhniyene",
            "email": "mounirbelhniyene@gmail.com",
            "password": "mounirbelhniyene",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Rainer Nocos",
            "email": "rainernocos@gmail.com",
            "password": "rainernocos",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Daniel Tanyi",
            "email": "danieltanyi@gmail.com",
            "password": "danieltanyi",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Chimebere Madukwe",
            "email": "chimeberemadukwe@gmail.com",
            "password": "chimeberemadukwe",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Sartaj Faizi",
            "email": "sartajfaizi@gmail.com",
            "password": "sartajfaizi",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Angella Mabwe",
            "email": "angellamabwe@gmail.com",
            "password": "angellamabwe",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Jonas Schmedtmann",
        "email": "jonasschmedtmann@gmail.com",
        "password": "jonasschmedtmann",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Hi, I'm Jonas! I have been identified as one of Udemy's Top Instructors and all my premium courses have recently earned the best-selling status for outstanding performance and student satisfaction.</p><p>I'm a full-stack web developer and designer with a passion for building beautiful things from scratch. I've been building websites and apps since 2007 and also have a Master's degree in Engineering.</p><p>It was in college where I first discovered my passion for teaching and helping others by sharing all I knew. And that passion brought me to Udemy in 2015, where my students love the fact that I take the time to explain important concepts in a way that everyone can easily understand.</p><p><strong><em>Do you want to learn how to build awesome websites with advanced HTML&nbsp;and CSS?</em></strong></p><p><strong><em>Looking for a complete JavaScript course that takes you from beginner to advanced developer?</em></strong></p><p><strong><em>Or maybe you want to build modern and fast back-end applications with Node.js?</em></strong></p><p>Then don't waste your time with random tutorials or incomplete videos. All my courses are easy-to-follow, all-in-one packages that will take your skills to the next level.</p><p><em>These courses are exactly the courses I wish I had when I was first getting into web development!</em></p><p>So see for yourself, enroll in one of my courses (or all of them :D) and join my 500,000+ happy students today.</p>"
    }
}