{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "The Complete ASP.NET MVC 5 Course",
        "subtitle": "Learn to build fast and secure web applications with ASP.NET MVC 5 - The most popular course with 40,000+ students!",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/806922_6310_3.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/806922_6310_3.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/806922_6310_3.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "The thing made me like this course most is your specify exercise, you are so amazming, I am learning and try my best to complete this course, thank you so much!",
            "rating": 5
        },
        {
            "body": "This has been a really challenging course where I've had to push myself to learn and bridge the gaps.\n\nI would say it isn't exactly a beginner course, it's more of a high level beginner low level intermediate course.",
            "rating": 4.5
        },
        {
            "body": "An excellent course with a lot of knowledge to share and with a good explanation I like Mosh tutorials because he programs focusing on develop extensible applications including a lot of resources. I hope you put the advanced course in udemy and one of blazor.",
            "rating": 5
        },
        {
            "body": "The working with Data section was frustrating. EF should not be introduced at this stage. In my opinion this was bad decision to put EF in this course.",
            "rating": 3.5
        },
        {
            "body": "Great explanations!!! Enjoyed. I also use this as a reference.",
            "rating": 5
        },
        {
            "body": "It was a nice course and covered all the topics. I didn't give a 5 star because of the lack of explanation on exercises. It will be nice to have step by step explanation. Without explanations, when you stuck on some part and check out the real code, you can make mistakes on implementing.",
            "rating": 4
        },
        {
            "body": "I like your way of teaching, It was very helpful to me, by your lecture I know only how to write the program but you didn't teach how the program is internally working, so please focus on that",
            "rating": 5
        },
        {
            "body": "It was extremely good course in terms of content and exercises and material full of technical hands on.",
            "rating": 5
        },
        {
            "body": "Thank you so much, Guru G :). It was an amazing course. The contents and presentations are impressive. Just want to say that deployment section could be better with a live example. thanks again!!!",
            "rating": 4
        },
        {
            "body": "I feel the course started with high quality details on every step taken, and ended with poor details and lots of concepts taken for granted. The two final sections were very hard to follow for an ASP.NET MVC course thats starts with the basics.",
            "rating": 3
        },
        {
            "body": "Very good for beginners, I gave 4.5 - there are minor confusions with what is presented after exercises in later videos and source on github and also there was no lecture addressing fixing previous migrations (meaning those in development), since a newbie can spend a lot of time googling \"I ran update-database on my broken new migration, help\".",
            "rating": 4.5
        },
        {
            "body": "I think Mosh is a great instructor and like his presentation style as well as his outline of the big topic, MVC in this case. I would caution others that following his examples step by step can lead to some mistakes on the student's part. For example, I had a leftover @model statement specifying the random movie view model, and when I first tried to do the section 2 exercise, I got a blizzard of errors that were hard to understand. He should give people a basic setup or send-off for exercises with a \"don't forget\" piece of advice or two. That would not compromise the challenge that he wants the student to face.",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "Doan Ngoc Khanh",
            "email": "doanngockhanh@gmail.com",
            "password": "doanngockhanh",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Robert Sullivan",
            "email": "robertsullivan@gmail.com",
            "password": "robertsullivan",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Luis Fernando Zarazua Aguilar",
            "email": "luisfernandozarazuaaguilar@gmail.com",
            "password": "luisfernandozarazuaaguilar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Xen",
            "email": "xen@gmail.com",
            "password": "xen",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Gregory Howard",
            "email": "gregoryhoward@gmail.com",
            "password": "gregoryhoward",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Ceren Yaşar",
            "email": "cerenyaşar@gmail.com",
            "password": "cerenyaşar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Balajeeraj R",
            "email": "balajeerajr@gmail.com",
            "password": "balajeerajr",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kalyani Shelar",
            "email": "kalyanishelar@gmail.com",
            "password": "kalyanishelar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Gaurav narula",
            "email": "gauravnarula@gmail.com",
            "password": "gauravnarula",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Juan Mateo Decurgez",
            "email": "juanmateodecurgez@gmail.com",
            "password": "juanmateodecurgez",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "HexBlock",
            "email": "hexblock@gmail.com",
            "password": "hexblock",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Tom Diaz",
            "email": "tomdiaz@gmail.com",
            "password": "tomdiaz",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "Mosh Hamedani",
        "email": "moshhamedani@gmail.com",
        "password": "moshhamedani",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Hi!&nbsp;My name is Mosh (Moshfegh)&nbsp;Hamedani! I'm a passionate software engineer with two decades of experience and I've taught over 3 million people who to code or how to become professional software engineers through my YouTube channel and online courses. </p><p>My goal is to make software engineering fun and accessible to everyone. That's why my courses are simple, pragmatic and free of BS. </p>"
    }
}