{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Build Responsive Real World Websites with HTML5 and CSS3",
        "subtitle": "The easiest way to learn modern web design, HTML5 and CSS3 step-by-step from scratch. Design AND code a huge project.",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/437398_46c3_9.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/437398_46c3_9.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/437398_46c3_9.jpg",
        "discountPrice": 12.99,
        "originalPrice": 139.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "This is one of the best HTML5 and CSS3 courses on the Internet.\n\nJonas is an amazing instructor- He explains all the topics really well together with excellent presentations.\n\nYou get to learn valuable knowledge about web development and web design. You'll learn all the theory stuff and then put them into practice on ONE BIG project. After finishing this course, you will understand the process of building a website- from idea/sketch to production.",
            "rating": 5
        },
        {
            "body": "I loved this course. It dove right in to what you need to learn. It taught you the basics of what you need to know for HTML and CSS so that you can start building your own websites right away. What I recommend is to watch bits and pieces of this course and as soon as you learn it, APPLY IT, that way you can commit what you learned to memory.",
            "rating": 5
        },
        {
            "body": "Excellent course to gain working knowledge of HTML and CSS. Very detailed, methodical and step-by-step instructions to build a modern, responsive website from scratch. Lot of useful reference site was mentioned. The codinghero site maintained by the author is useful for real-world development. Was extremely happy with the course since it served my purpose. Few tidbits of JS and Jquery was added but it was easy to follow. The final bonus section on flexbox and css grid was not very useful. Few sections are however outdated and might need to be reworked. The ionicons library previously implemented with css no longer work the way it used to. The ionicons are now JS driven. This requires some changes in few sections. Not very difficult changes though.",
            "rating": 5
        },
        {
            "body": "very excellent course. i got the fuel what i need to star my carrier. but one thing i should mention that when we ask question regarding any problem i didn't get answered regarding my problem. i had to wait for long time. that is frustrating. otherwise this course is very helpful for the beginner students of webdesign.",
            "rating": 4.5
        },
        {
            "body": "This course has covered a lot of useful information for HTML5 and CSS3. However, the instructor should improve his ability to speak English better. Also, he should explain carefully every property of programming language for students, not just go through. Need more improvement for this course by careful explainations of everything !!!!!!!",
            "rating": 2.5
        },
        {
            "body": "The material is quite dated and if you didn't take this course five years ago you're going to run into a lot of issues. Also, Jonas's assistant is quite lax in responding to inquiries regarding issues that arise. The Q&A section states it takes 48 hours to respond but it doesn't take long to realize that responses are done at his leisure. In fact, it's because of my last few interactions with his assistant that I won't be finishing.",
            "rating": 2
        },
        {
            "body": "The course is good. At the time of enrollment my target was for HTML5 and CSS3. Lots of area has been covered in a meaningful way. But some of the part like JQuery was not required. As a fair knowledge of JavaScript is required for that. Without that it becomes meaningless. In place of that it would have been good had other areas of HTML and CSS would have covered. Also at many places reference to eBook has been made which has been missing. It has been answered that in place of eBook website URL has been provided. Could not find all things in the website that has been mentioned. Many referenced websites have changed the way of functioning and some of them don’t even exist now. Hope course should have been updated accordingly. But overall happy for it. Only 2 points. 1. Please update where changes have happened. 2. As for this course rather than other topics (like JQuery, PHP), have more area of HTML and CSS covered in it. (This is not in negative sense please).\n\nThank you for the nice course.",
            "rating": 4
        },
        {
            "body": "A good course to start into to know about the in and out of html and css if you are just a beginner. It will help you get the feel and idea on how to start coding a website. However, the course might be kind of outdated since some of the things that you will learned will be replaced by a better solution and simpler coding commands or they do simply work but in a redundant way, thus you have to find a better solution by researching yourself or in the Q&A some of the time.",
            "rating": 4
        },
        {
            "body": "Great to know about the various concepts of web development and clear cut view of how a webpage is developed as per the customer's expectatitons",
            "rating": 5
        },
        {
            "body": "You Can teach an Old Dog New Tricks!\n\nI was always apprehensive about learning web development in the past.\n\nAfter trying a small nursery course, ‘as I call it’, Jonas’s course came highly rated and regarded in most Google searches for reviews and advice.\n\nThose great ratings were not wrong either. This course is absolutely fantastic.\n\nI love the sections on responsive design for Mobile Phones & Tablets.\n\nSo pleased I chose this course to start me on my way.\n\nThis old dog, (myself), is a 55 year old who should have studied this subject years ago.\n\nHighly recommend this to anyone starting out from scratch.\n\nI am now hooked on every element of the subject and very grateful too.\n\nBravo and Thanks,\n\nFraser.",
            "rating": 5
        },
        {
            "body": "Very Informative and learnt a lot, overwelming at times if new to this but Jonas does a good job to make this course as easy as possible to follow. Thanks!",
            "rating": 4
        },
        {
            "body": "The course is understandable, if you do not have experience like me in HTML, CSs and jS this course will help you understand the basic principles. The only problem is that the course is outdated and that makes you feel frustrated because you are wasted a lot of time trying to solve the problems caused by this outdated course.",
            "rating": 3.5
        }
    ],
    "students": [
        {
            "name": "Itamar Rosenblum",
            "email": "itamarrosenblum@gmail.com",
            "password": "itamarrosenblum",
            "role": "s"
        },
        {
            "name": "Dean Lauvina",
            "email": "deanlauvina@gmail.com",
            "password": "deanlauvina",
            "role": "s"
        },
        {
            "name": "Soumya Kundu",
            "email": "soumyakundu@gmail.com",
            "password": "soumyakundu",
            "role": "s"
        },
        {
            "name": "Dhishna Mahmud",
            "email": "dhishnamahmud@gmail.com",
            "password": "dhishnamahmud",
            "role": "s"
        },
        {
            "name": "Khoi Nguyen",
            "email": "khoinguyen@gmail.com",
            "password": "khoinguyen",
            "role": "s"
        },
        {
            "name": "Scott Kaiser",
            "email": "scottkaiser@gmail.com",
            "password": "scottkaiser",
            "role": "s"
        },
        {
            "name": "Pramod Salunke",
            "email": "pramodsalunke@gmail.com",
            "password": "pramodsalunke",
            "role": "s"
        },
        {
            "name": "Sothy Kettya Kohl",
            "email": "sothykettyakohl@gmail.com",
            "password": "sothykettyakohl",
            "role": "s"
        },
        {
            "name": "Prince Sidharth",
            "email": "princesidharth@gmail.com",
            "password": "princesidharth",
            "role": "s"
        },
        {
            "name": "Fraser Lock-Macardy",
            "email": "fraserlock-macardy@gmail.com",
            "password": "fraserlock-macardy",
            "role": "s"
        },
        {
            "name": "Gavin Lief",
            "email": "gavinlief@gmail.com",
            "password": "gavinlief",
            "role": "s"
        },
        {
            "name": "Jenniffer Montoya",
            "email": "jenniffermontoya@gmail.com",
            "password": "jenniffermontoya",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Jonas Schmedtmann",
        "email": "jonasschmedtmann@gmail.com",
        "password": "jonasschmedtmann",
        "role": "i",
        "briefIntroduction": "<p>Hi, I'm Jonas! I have been identified as one of Udemy's Top Instructors and all my premium courses have recently earned the best-selling status for outstanding performance and student satisfaction.</p><p>I'm a full-stack web developer and designer with a passion for building beautiful things from scratch. I've been building websites and apps since 2007 and also have a Master's degree in Engineering.</p><p>It was in college where I first discovered my passion for teaching and helping others by sharing all I knew. And that passion brought me to Udemy in 2015, where my students love the fact that I take the time to explain important concepts in a way that everyone can easily understand.</p><p><strong><em>Do you want to learn how to build awesome websites with advanced HTML&nbsp;and CSS?</em></strong></p><p><strong><em>Looking for a complete JavaScript course that takes you from beginner to advanced developer?</em></strong></p><p><strong><em>Or maybe you want to build modern and fast back-end applications with Node.js?</em></strong></p><p>Then don't waste your time with random tutorials or incomplete videos. All my courses are easy-to-follow, all-in-one packages that will take your skills to the next level.</p><p><em>These courses are exactly the courses I wish I had when I was first getting into web development!</em></p><p>So see for yourself, enroll in one of my courses (or all of them :D) and join my 500,000+ happy students today.</p>"
    }
}