{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Advanced CSS and Sass: Flexbox, Grid, Animations and More!",
        "subtitle": "The most advanced and modern CSS course on the internet: master flexbox, CSS Grid, responsive design, and so much more.",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1026604_790b_2.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1026604_790b_2.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1026604_790b_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "Nice course, he talks a little slow but that's okay. I watched the whole course in 1.25x lol. Great explaining for most of the things. The example projects were really good. My guy really put effort on this course! Feel free to buy!",
            "rating": 4.5
        },
        {
            "body": "When I started, I did not know anything about CSS except some few terms here and there... Many times it was tough, but now I know a lot in CSS... thanks to Jonas' teaching style and effort he has put in the course, he has made sure that he touches every thing out there and did his best to teach us and I know I have got a very good foundation after completing this course, but still I need to put in hard work to reach a level where it becomes second nature for me. He is really good and taking his course always ensures that we become best in the subject. Looking forward to more newer courses in future from Jonas.",
            "rating": 5
        },
        {
            "body": "One of the highest quality courses I've ever purchased. Thank you, Jonas! You're the man",
            "rating": 5
        },
        {
            "body": "Amazing course from start to end. Jonas keeps you impressed, I can really say this is the best css and even front-end development resource on the internet. The theories are perfect, the projects and big scale and real world. This course helped me like CSS and I no more struggle with archtecture, responsive design, performance.\n\nThank you Jonas",
            "rating": 5
        },
        {
            "body": "Great course. The explanations were done very well. I would recommend this course to anyone from beginner, or someone wishing to refresh their knowledge and skills.",
            "rating": 5
        },
        {
            "body": "I am writing this review while finalizing the 8th section of this course. If you want to really understand CSS, how things work, and why they work the way they do, then this is the course for you! What I specifically liked about this course is its organization, the fact that the instructor does not shy away from explaining the logic and the math behind concepts, and the richness of the proposed projects. I am so glad that I have taken this course and I am satisfied with the immense progress that I have achieved towards my goal.",
            "rating": 5
        },
        {
            "body": "Awesome lecturer as well as awesome course material. Very details explanation and the lecture try do teach as simple as it is to make you understand. He start from simple one and then gradually move onto the complex one. Awesome course, recommended.",
            "rating": 5
        },
        {
            "body": "What an amazing course this was! I thoroughly enjoyed learning it and gaining the bundle of knowledge from it.\n\nThis course contain loads of information and knowledge you can use in building beautiful projects and add values to your portfolio.\n\nFinally, Jonas is a great teacher, explains every small amount of detail and helps clearing your doubt again and again until you understands it. Really worth doing this course and also highly recommends it to everyone. Thanks a lot. Jonas.",
            "rating": 5
        },
        {
            "body": "2020 ... my opinion is .. dont think about it buy the course , amazing projects where we you can apply css/sass flexbox, grid css and get good foundations for bootstrap(know your s..it).",
            "rating": 5
        },
        {
            "body": "I truly love this course, and I also really enjoy how Jonas teaches and passes his knowledge to his students.",
            "rating": 5
        },
        {
            "body": "Great course, very good content, nice projects, all is very well explained, I learn a lot of very useful tricks and best practices. Highly recommend.",
            "rating": 5
        },
        {
            "body": "Thank you so much Jonas sir for such an amazing course...",
            "rating": 4.5
        }
    ],
    "students": [
        {
            "name": "Efe Erdem Bal",
            "email": "efeerdembal@gmail.com",
            "password": "efeerdembal",
            "role": "s"
        },
        {
            "name": "Prasanth Joseph",
            "email": "prasanthjoseph@gmail.com",
            "password": "prasanthjoseph",
            "role": "s"
        },
        {
            "name": "Cameron Taghlabi",
            "email": "camerontaghlabi@gmail.com",
            "password": "camerontaghlabi",
            "role": "s"
        },
        {
            "name": "Ermyas Fekadu",
            "email": "ermyasfekadu@gmail.com",
            "password": "ermyasfekadu",
            "role": "s"
        },
        {
            "name": "Eustace Roach",
            "email": "eustaceroach@gmail.com",
            "password": "eustaceroach",
            "role": "s"
        },
        {
            "name": "Dani Stark",
            "email": "danistark@gmail.com",
            "password": "danistark",
            "role": "s"
        },
        {
            "name": "I Putu Gede Agus Adi Indrawan",
            "email": "iputugedeagusadiindrawan@gmail.com",
            "password": "iputugedeagusadiindrawan",
            "role": "s"
        },
        {
            "name": "Gopal Satam",
            "email": "gopalsatam@gmail.com",
            "password": "gopalsatam",
            "role": "s"
        },
        {
            "name": "Hector Vinicio Lopez Molinares",
            "email": "hectorviniciolopezmolinares@gmail.com",
            "password": "hectorviniciolopezmolinares",
            "role": "s"
        },
        {
            "name": "Alonso Davila",
            "email": "alonsodavila@gmail.com",
            "password": "alonsodavila",
            "role": "s"
        },
        {
            "name": "Jimena Merino",
            "email": "jimenamerino@gmail.com",
            "password": "jimenamerino",
            "role": "s"
        },
        {
            "name": "Annu Verma",
            "email": "annuverma@gmail.com",
            "password": "annuverma",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Jonas Schmedtmann",
        "email": "jonasschmedtmann@gmail.com",
        "password": "jonasschmedtmann",
        "role": "i",
        "briefIntroduction": "<p>Hi, I'm Jonas! I have been identified as one of Udemy's Top Instructors and all my premium courses have recently earned the best-selling status for outstanding performance and student satisfaction.</p><p>I'm a full-stack web developer and designer with a passion for building beautiful things from scratch. I've been building websites and apps since 2007 and also have a Master's degree in Engineering.</p><p>It was in college where I first discovered my passion for teaching and helping others by sharing all I knew. And that passion brought me to Udemy in 2015, where my students love the fact that I take the time to explain important concepts in a way that everyone can easily understand.</p><p><strong><em>Do you want to learn how to build awesome websites with advanced HTML&nbsp;and CSS?</em></strong></p><p><strong><em>Looking for a complete JavaScript course that takes you from beginner to advanced developer?</em></strong></p><p><strong><em>Or maybe you want to build modern and fast back-end applications with Node.js?</em></strong></p><p>Then don't waste your time with random tutorials or incomplete videos. All my courses are easy-to-follow, all-in-one packages that will take your skills to the next level.</p><p><em>These courses are exactly the courses I wish I had when I was first getting into web development!</em></p><p>So see for yourself, enroll in one of my courses (or all of them :D) and join my 500,000+ happy students today.</p>"
    }
}