{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "The Complete Web Developer Course 2.0",
        "subtitle": "Learn Web Development by building 25 websites and mobile apps using HTML, CSS, Javascript, PHP, Python, MySQL & more!",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/764164_de03_2.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/764164_de03_2.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/764164_de03_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "The experience was good. All the things that i have learned till now are easily understandable and compatible. Would love to make a big project using all this knowledge.\n\nThank you for sharing such great knowledge.",
            "rating": 5
        },
        {
            "body": "Very good, simple to understand and follow basic rules of css. By attempting more advanced exercises, if i get stuck then i always come back to this site to follow the ground rules which helps me to understand things better.",
            "rating": 4.5
        },
        {
            "body": "This is a decision I shall never regret.\n\nRob is on point, well explained course.\n\nAlthough I have no previous coding experience I can now try to build a real website. Thanks rob",
            "rating": 5
        },
        {
            "body": "I will definitely recommend this course to any beginner web developer or anyone who just want to build solid basic web development understanding",
            "rating": 5
        },
        {
            "body": "The Course was a great introduction to the many aspects of web development. Rob has picked the right mix of coverage to get someone moving in the directions.\n\nThe content and presentation were great!\n\nMy suggestions are;\n\n1. Create a course notes that could be used as reference as well as cover the intricacies of some of the area, ex. debugging php, python, and schematic view of arriving at MVC project.\n\n2. The final section \"where do you go from here\" could include some tips on setting up students own environment for doing web project on their own machines for practice purpose, which includes a webserver and required IDE.\n\nOverall, the course was great to follow and practice. Learnt a lot!!\n\nRegards, Tapan.",
            "rating": 4.5
        },
        {
            "body": "I enjoyed the course very much, sometimes out of my depth but perhaps if I keep coding things will become easier.",
            "rating": 5
        },
        {
            "body": "All in all I have learned some great skills and managed to create a fully fledged website. There are about 3 or 4 places where a note comes up on screen to say that what is being taught is out of date and to do something else, if you aren't looking at the screen at that point in time (if you are working on what is being said at the time for example) you can end up wasting a few hours, perhaps an audio cue could help. Also would advise taking the exams after completing the course and re-visiting each unit, as for me some of the questions in the exams related to later in the course. I would recommend this course if you are a determined person who can problem solve well (which are skills you need for web development anyway), but think the UX could have been better with refreshed/overhauled content.",
            "rating": 3.5
        },
        {
            "body": "The main reason I took the course is to add jquery, bootstrap, PHP, APIs, and some python to the other skills that I already have so that I can build a complete website.",
            "rating": 4
        },
        {
            "body": "The firsts sections were pretty good, but I couldn't learn much after the bootstrap section. After that section, I'd just followed along because I couldn't understand the process anymore.",
            "rating": 3.5
        },
        {
            "body": "This was my first purchase on Udemy and I have to say I was impressed. I have prior experience working in web development, so some subjects were easier for me than most. I thought Rob's way of teaching was done very well and would recommend his course to anyone starting out in web development. The instructional videos with quizzes and the community are top notch. Thank you, Rob, for your knowledge and I look forward to some of your courses in the future.",
            "rating": 4
        },
        {
            "body": "It was an amazing course.I had no prior knowledge related to web development and after completing this course,I am confident to make websites on my own.The explanations where really helpful throughout the course.",
            "rating": 5
        },
        {
            "body": "I was really pleased with the course and how available the teacher was in the Q&A section. The only thing that was bad in my opinion is that it lacked more challenging quizes related to the sections.",
            "rating": 4
        }
    ],
    "students": [
        {
            "name": "Akash Sehdev",
            "email": "akashsehdev@gmail.com",
            "password": "akashsehdev",
            "role": "s"
        },
        {
            "name": "Aysha Mir",
            "email": "ayshamir@gmail.com",
            "password": "ayshamir",
            "role": "s"
        },
        {
            "name": "Miriam Mutisya",
            "email": "miriammutisya@gmail.com",
            "password": "miriammutisya",
            "role": "s"
        },
        {
            "name": "Easy Scalo",
            "email": "easyscalo@gmail.com",
            "password": "easyscalo",
            "role": "s"
        },
        {
            "name": "Tapan Chakravarty",
            "email": "tapanchakravarty@gmail.com",
            "password": "tapanchakravarty",
            "role": "s"
        },
        {
            "name": "Keith Oliver",
            "email": "keitholiver@gmail.com",
            "password": "keitholiver",
            "role": "s"
        },
        {
            "name": "Suzanne Wood",
            "email": "suzannewood@gmail.com",
            "password": "suzannewood",
            "role": "s"
        },
        {
            "name": "Mahmoud Saadeh",
            "email": "mahmoudsaadeh@gmail.com",
            "password": "mahmoudsaadeh",
            "role": "s"
        },
        {
            "name": "Italo de Souza Silva",
            "email": "italodesouzasilva@gmail.com",
            "password": "italodesouzasilva",
            "role": "s"
        },
        {
            "name": "Brandon Getchel",
            "email": "brandongetchel@gmail.com",
            "password": "brandongetchel",
            "role": "s"
        },
        {
            "name": "Milan Koshy",
            "email": "milankoshy@gmail.com",
            "password": "milankoshy",
            "role": "s"
        },
        {
            "name": "Teddie Liljekvist",
            "email": "teddieliljekvist@gmail.com",
            "password": "teddieliljekvist",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Rob Percival",
        "email": "robpercival@gmail.com",
        "password": "robpercival",
        "role": "i",
        "briefIntroduction": "<p>  \t       Hi! I'm Rob. I have a degree in Mathematics from Cambridge University and you might call me a bit of coding geek.  </p>\n\n<p>  \t       After building websites for friends and family for fun, I soon learned that web development was a very lucrative career choice. I gave up my successful (and sometimes stressful) job as a teacher to work part time and today, couldn't be happier.  </p>\n\n<p>  \t       I'm passionate about teaching kids to code, so every summer I run Code School in the beautiful city of Cambridge. I also run the popular web hosting and design service, Eco Web Hosting which leaves me free to share my secrets with people like you.  </p>\n\n<p>  \t<strong>You wouldn't believe the freedom that being a web developer offers.</strong> Sign up and find out for yourself why so many people are taking and recommending this course.  I genuinely believe it's the best on the market and if you don't agree, I'll happily refund your money.  </p>\n\n<p>  \t       Sign up to my courses and join me in this amazing adventure today.  </p>"
    }
}