{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Python and Django Full Stack Web Developer Bootcamp",
        "subtitle": "Learn to build websites with HTML , CSS , Bootstrap , Javascript , jQuery , Python 3 , and Django!",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-b.udemycdn.com/course/240x135/822444_a6db.jpg",
        "image2xURL": "https://img-b.udemycdn.com/course/480x270/822444_a6db.jpg",
        "image3xURL": "https://img-b.udemycdn.com/course/750x422/822444_a6db.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "Thanks Jose for the in-deep walkthrough web development with Django in python.\n\nI can only provide positive appreciations for this course. well structured, lots of relevant examples and excellent explanation. I recommend this course although further development of skills is needed to be a complete full-stack. Farewell.",
            "rating": 5
        },
        {
            "body": "This course gave me a good grasp on Django and kept me engaged the entire time. Jose is an excellent instructor. Highly recommended for anyone interested in Django.",
            "rating": 4.5
        },
        {
            "body": "Very good course, shame it movies are not updated with new versions of django and python, but it actually forces you to search for yourself through the documentation and webpages, to fix some issues, therefor makes you remember and understand more. Well done and thank you! And this is not a big issue, just few minor changes, so it is pretty awsome to encourage to update yourself with new knowledge",
            "rating": 4.5
        },
        {
            "body": "There is a lot in this course and he covered them all very well. The good part is ,everything he live coded and that make things clear .I feel this course gave me way more knowledge than i paid for this.Thanks a lot jose for publishing this course.",
            "rating": 5
        },
        {
            "body": "With this course i can make my own site, with a lot of tools and options.\n\nThe didactics of the classes are easy to understand, being a great django course.",
            "rating": 5
        },
        {
            "body": "Covered all the basics of django And front end components and also touched some of the advanced topics in Django. After taking this course I was able to do anything in django. I made a video blogging website with help of statckoverflow and my django knowledge and also I made a web app for weather by using Apis. After that I took the courses to advance my django Skills like using rest framework. Rest is not included in this course but ITts the basics you require of django. Its filmed on django 1 but I used Django 3 in my time and there was literally no difference except some minor hiccups which is also covered in course notes.",
            "rating": 5
        },
        {
            "body": "I was able to get a front to back site up and running on PythonAnywhere. So there is a lot of amazing material. However, since the course is old the tech versions are old and it's in the Django part that it becomes a problem. Many frustrating hours spent trying to figure out syntax.\n\nNow it seems that the Django_Course_2.xx has corrected syntax! Especially URL mappings, Bootstrap versions, Glyphicon classes, django import modules, etc.",
            "rating": 4
        },
        {
            "body": "Basically, this course just like 'follow me typing the code'. It doesn't give enough explanation. After all, you need to figure out almost all the theory behind the code by yourself.",
            "rating": 2
        },
        {
            "body": "Material is outdated for newer versions of Django and rest of stuff. There should be clear notifications in videos when the method or working procedure has changed. Also the games programmed in this course like connect four and war card game have major flaws in their code. For some reason the author of this course chooses not to answer any of the questions in Q&A regarding those games so students have to figure out the answer themselves.",
            "rating": 2
        },
        {
            "body": "Lack of explanation in many ways. It's really tedious to watch the tutor type each word during the coding without high level structural guidance. The logic is not clear to me especially in the projects part.\n\nThe Django version is also outdated. There are a lot of updates on the usage but you won't know when you learn along with the course. Not recommend beginner to choice this course.",
            "rating": 1
        },
        {
            "body": "Thanks Jose! The best part is, the course content is well structured and advanced topics were also covered and the explanation was just WOW!!.",
            "rating": 5
        },
        {
            "body": "So, It was both challenging and exiting, Jose an amazing teacher and he and people what responsible for help in Q&A form really doing great job, especially Abu Sayeed!\n\nAnswering to someone question you sad \"Don't lose your patience. Programming means all of problem and problem needed the patience to solve it.\" - what are great words? ... after that, you and some people started to help with solution of that God Damn it Misaka installation problem! That words really helped me out, to stand up and keep going!\n\nSo guys, I am honestly thankful for support, and help!\n\nYou are my heroes!\n\nReally great course full of knowledges and details!",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Michael Keumatio Lontsie",
            "email": "michaelkeumatiolontsie@gmail.com",
            "password": "michaelkeumatiolontsie",
            "role": "s"
        },
        {
            "name": "Micky Baeza",
            "email": "mickybaeza@gmail.com",
            "password": "mickybaeza",
            "role": "s"
        },
        {
            "name": "Jakub Łabowicz",
            "email": "jakubłabowicz@gmail.com",
            "password": "jakubłabowicz",
            "role": "s"
        },
        {
            "name": "Raksha Yadav",
            "email": "rakshayadav@gmail.com",
            "password": "rakshayadav",
            "role": "s"
        },
        {
            "name": "Lucas Búrigo",
            "email": "lucasbúrigo@gmail.com",
            "password": "lucasbúrigo",
            "role": "s"
        },
        {
            "name": "Drishtant Rai",
            "email": "drishtantrai@gmail.com",
            "password": "drishtantrai",
            "role": "s"
        },
        {
            "name": "Joe Joe",
            "email": "joejoe@gmail.com",
            "password": "joejoe",
            "role": "s"
        },
        {
            "name": "Xiang REN",
            "email": "xiangren@gmail.com",
            "password": "xiangren",
            "role": "s"
        },
        {
            "name": "Jani Seppälä",
            "email": "janiseppälä@gmail.com",
            "password": "janiseppälä",
            "role": "s"
        },
        {
            "name": "Aijie Zhao",
            "email": "aijiezhao@gmail.com",
            "password": "aijiezhao",
            "role": "s"
        },
        {
            "name": "Rohit Tandlay",
            "email": "rohittandlay@gmail.com",
            "password": "rohittandlay",
            "role": "s"
        },
        {
            "name": "Nikolay Rudenko",
            "email": "nikolayrudenko@gmail.com",
            "password": "nikolayrudenko",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Jose Portilla",
        "email": "joseportilla@gmail.com",
        "password": "joseportilla",
        "role": "i",
        "briefIntroduction": "<p>&nbsp; Jose Marcial Portilla has a BS and MS in Mechanical Engineering from Santa Clara University and&nbsp;years of&nbsp;experience as a professional instructor and trainer for Data Science and programming. He has publications and patents in various fields such as microfluidics,&nbsp;materials science, and data science technologies. Over the course of his career he has developed a skill set in analyzing data and he hopes to use his experience in teaching and data science to help other people learn the power of programming the&nbsp;ability to analyze data, as well as present the data in clear and beautiful visualizations. Currently he works as the Head of Data Science for Pierian Data Inc.&nbsp;and provides in-person data science and python programming training courses to employees working at top companies, including General Electric, Cigna, The New York Times, Credit Suisse, McKinsey and many more.&nbsp;Feel free to contact him on LinkedIn for more information on in-person training sessions or group training sessions in Las Vegas, NV.</p>"
    }
}