{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Modern JavaScript From The Beginning",
        "subtitle": "Learn and build projects with pure JavaScript (No frameworks or libraries)",
        "descriptions": [],
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1463348_52a4_2.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1463348_52a4_2.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1463348_52a4_2.jpg",
        "discountPrice": 11.99,
        "originalPrice": 129.99,
        "numViews": 0,
        "curriculum": []
    },
    "reviews": [
        {
            "body": "I really enjoyed this course, especially for its practical setting. After this course, you can do a lot independently.",
            "rating": 5
        },
        {
            "body": "Another great class from Brad Traversy. This is the second class of Brad's that I have taken and I have no doubts about taking another. Thanks.",
            "rating": 5
        },
        {
            "body": "Brad is the best of the best instructors. He explains in detail to learn, what do, and how to do it. There are many instructors out there but not as good as Brad. Do what is expected of you in terms of instruction and you will be ahead of a lot other programmers in terms of knowledge.",
            "rating": 5
        },
        {
            "body": "I purchased this course 2 years ago but finally commited to sitting through it from the beginning to the end. I really wanted to sharpen up my JavaScript skills before learning a framework and I'm glad that I took the time to do it. Brad is a great instructor and he explains things very well.",
            "rating": 5
        },
        {
            "body": "This course was great overall. I didn't go for five stars though because there are some areas that I thought were badly explained and I had to go elsewhere for a lot of information (particularly around what prototypes actually are and how promises actually work). Also, it seems that so much of JS is passing parameters into functions, and defining those parameters using arguments wherever that function is called. This distinction between parameters and arguments never actually gets explained on this course: you have to figure it out for yourself. The final two projects were EXTREMELY well explained, and it would have been great if the whole course was explained to this level. Overall though, I'm really happy with what I got out of it.",
            "rating": 4
        },
        {
            "body": "The course is very well executed. It was helpful to me as a beginner, it gave me a better understanding of Javascript. Following the mini-projects in the course gave me the confidence to tackle more complex Javascript projects.",
            "rating": 4.5
        },
        {
            "body": "Brad is a really great instructor. He explains everything so well. I loved this course. Thank you so much for taking time to make this course.",
            "rating": 5
        },
        {
            "body": "Brad knows this material well, and it shows. I'm impressed with his level of knowledge and his innate ability to teach. I'm a professional dev brushing up on my skills, and I can't say enough good things about this instructor. Thank you.",
            "rating": 5
        },
        {
            "body": "Positives:\n\nThis course is pretty extensive in terms of the number of topics covered.\n\nSupport provided for this course is pretty decent.\n\nI like Brad's code along approach, because if you write even 10 lines of code just to test out a concept (and save it), then you are more likely to remember it and you can always come back to it for revisions.\n\nWeaknesses:\n\nToo many loose ends, too much googling and mdn browsing in a course i paid for.\n\nSmall errors in explanation here and there can lead to hours (in one case days) wasted on googling\n\nWhats more, Brad very cunningly tiptoes past the topics he wouldn't or couldn't explain like closures. Yeah a JavaScript course without a mention of closures.\n\nNo word about apply, bind or call functions.\n\nHe used filter function late in lecture 98 in a wrong manner which just by luck worked for the example he was working on. So cannot even expect the explanation there.\n\nIncomplete coverage of the the spread operator.\n\nFor...of loop (without any introduction) was used for the first time in the lecture on sets in section 10.\n\nIn the last section, he just tells to download the webpack+babel setup from his GitHub profile without explaining how he created it.\n\nThe list is too long.",
            "rating": 3.5
        },
        {
            "body": "I struggled learning Javascript coming from a career with no programming skills needed or experience. I tried other videos and online courses and to me, it seemed like they were made from the perspective that people had previous programming experience and wanted to learn how to program with Javascript. The focus was mainly on just how to write functions, arrays, and objects and not seeing any results of this outside of logging things on a console. These lessons for the first time showed me how JS can manipulate the DOM, methods for targeting HTML in a webpage, creating OOP, modules, patterns, and lots more so I finally could see what JS was doing when related to working on webpages for front-end work. The small projects are super helpful, and helped me to really understand the language while both coming together and in the final product. I will definitely be revisiting these videos for practice and test how much more I can do independently as I progress.",
            "rating": 5
        },
        {
            "body": "Fantastic course. Brad is so knowledgeable and a brilliant teacher. The way the course comes together towards the end and draws everything you have is really great. I am definitely feeling more knowledgeable and comfortable with Javascript and it's concepts.",
            "rating": 5
        },
        {
            "body": "It is very good course to learn modern javascript. If you don't know anything about js then you can definitely go with this course.",
            "rating": 5
        }
    ],
    "students": [
        {
            "name": "Adnan Ali",
            "email": "adnanali@gmail.com",
            "password": "adnanali",
            "role": "s"
        },
        {
            "name": "Sean Berry",
            "email": "seanberry@gmail.com",
            "password": "seanberry",
            "role": "s"
        },
        {
            "name": "ronald nats",
            "email": "ronaldnats@gmail.com",
            "password": "ronaldnats",
            "role": "s"
        },
        {
            "name": "James Young",
            "email": "jamesyoung@gmail.com",
            "password": "jamesyoung",
            "role": "s"
        },
        {
            "name": "Banfi Music",
            "email": "banfimusic@gmail.com",
            "password": "banfimusic",
            "role": "s"
        },
        {
            "name": "Morenike Kolawole",
            "email": "morenikekolawole@gmail.com",
            "password": "morenikekolawole",
            "role": "s"
        },
        {
            "name": "Parvathyvd",
            "email": "parvathyvd@gmail.com",
            "password": "parvathyvd",
            "role": "s"
        },
        {
            "name": "Mike K",
            "email": "mikek@gmail.com",
            "password": "mikek",
            "role": "s"
        },
        {
            "name": "Tarun Singh",
            "email": "tarunsingh@gmail.com",
            "password": "tarunsingh",
            "role": "s"
        },
        {
            "name": "Roeh Y Lewit",
            "email": "roehylewit@gmail.com",
            "password": "roehylewit",
            "role": "s"
        },
        {
            "name": "Jonathan Taft",
            "email": "jonathantaft@gmail.com",
            "password": "jonathantaft",
            "role": "s"
        },
        {
            "name": "Ayush Sahu",
            "email": "ayushsahu@gmail.com",
            "password": "ayushsahu",
            "role": "s"
        }
    ],
    "instructor": {
        "name": "Brad Traversy",
        "email": "bradtraversy@gmail.com",
        "password": "bradtraversy",
        "role": "i",
        "briefIntroduction": "<p>Brad Traversy has been&nbsp;programming for around 12 years and teaching for almost 5 years. He is the owner of Traversy Media which is a successful web development YouTube channel and specializes in everything from HTML5 to front end frameworks like Angular as well as server side technologies like Node.js, PHP and Python. Brad has mastered explaining very complex topics in a simple manner that is very understandable. Invest in your knowledge by watching Brad's courses.</p>"
    }
}