{
    "field": {
        "name": "web-development",
        "courses": []
    },
    "course": {
        "title": "Master Microservices with Spring Boot and Spring Cloud",
        "subtitle": "An awesome journey from Restful Web Services ( REST API ) to Microservices with Java, Spring Boot and Spring Cloud",
        "descriptions":  "",
        "reviews": [],
        "students": [],
        "image1xURL": "https://img-a.udemycdn.com/course/240x135/1352468_3d97_7.jpg",
        "image2xURL": "https://img-a.udemycdn.com/course/480x270/1352468_3d97_7.jpg",
        "image3xURL": "https://img-a.udemycdn.com/course/750x422/1352468_3d97_7.jpg",
        "discountPrice": 18.99,
        "originalPrice": 199.99,
        "numViews": 0,
        "curriculum": {}
    },
    "reviews": [
        {
            "body": "Learn lots of things regarding micro services and spring cloud. Thanks Ranga! for this excellent tutorial",
            "rating": 4.5
        },
        {
            "body": "I would like to say thank you for this course. Especially, up to date modification section for updated version. Actually, I have joined for this course because my new project using API at my work place, and this course really helpful to me.",
            "rating": 5
        },
        {
            "body": "Many Spring cloud topics are not covered. The course name should be Spring cloud basics and not - \"Mastering\" microservices with cloud. Also, asked few questions but did not receive any response.",
            "rating": 3
        },
        {
            "body": "I was anxious when I took the course at the beginning thinking I would understand it intact. But the course exceeds my expectation with hands-on coding and understanding from the elementary to important concepts. Thanks for the course and I really enjoyed studying the course.",
            "rating": 5
        },
        {
            "body": "Trainer had very well explained through out the course and the course content was also helpful. It helped me a lot to get more knowledge on Spring Boot and Spring Cloud Course. I'm grateful to the trainers Mahi, Ranga,Helen for all your assistance whenever i raised a query. Especially, many many Thanks to Ranga for the great course especially to assist me and providing with an exposure on lot of concepts.",
            "rating": 4.5
        },
        {
            "body": "Very good explanations , would recommend anybody looking to get started with spring microservices / jpa",
            "rating": 4
        },
        {
            "body": "Instructor is has a good teaching skill and is well versed with spring framework. Video's are short and upto the point.\n\nTitle is misleading... The course is mere introduction to microservices, the core microservices concepts were taught for less than 2 hours. So it lacks depth.\n\nWe can call this course a great introduction to microservices nothing more. Failed to explain different architecture patterns eg. event driven architecture, etc.\n\nFailed to explain the configuration of components like rabbitmq, zuul,etc.\n\nits incomplete, most of the course content appears to be re-purposed videos from previous courses.\n\nYou wouldn't be able to deploy any real world project after this course.",
            "rating": 2.5
        },
        {
            "body": "Examples are good. but need to explain why each component designed in spring boot and what are advantages and what components it replaces currently in market",
            "rating": 3.5
        },
        {
            "body": "It was a great learning experience. I enjoyed the course, it was very detailing. Though I had experience in developing microservices using spring boot, this course helped me to understand the basics in detail. I would recommend this course if you want to understand the basics of spring boot and spring cloud. Thanks Ranga for the amazing course. From my side it is a 5 star.",
            "rating": 5
        },
        {
            "body": "Straight forward lectures. Well presented. Use the dependencies he is using even though it is a little out dated. It will make the course easier to follow.",
            "rating": 5
        },
        {
            "body": "All the concepts together at one place helps us a lot. One issue is that all the codes are not fully updated like few codes are deprecated and not working and giving error and we are clueless how to fix it easily. Needs updated code in Notes section would have been great.",
            "rating": 4
        },
        {
            "body": "I have attended this course after having already studied on my own and worked on most of the topics. The course was very useful to put order in what I have studied and to acquire more confidence in applying this knowledge in the practice and to compare my experience with that of the trainer and other students. I have appreciated the way the course has been prepared, the sequence of the topics, the completeness and the way it is updated following the evolution of the frameworks.",
            "rating": 4.5
        }
    ],
    "students": [
        {
            "name": "Nikunj Soni",
            "email": "nikunjsoni@gmail.com",
            "password": "nikunjsoni",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "May Pyae Sone Nyein Win",
            "email": "maypyaesonenyeinwin@gmail.com",
            "password": "maypyaesonenyeinwin",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Jaykumar Shinde",
            "email": "jaykumarshinde@gmail.com",
            "password": "jaykumarshinde",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Adithya Nadig A R",
            "email": "adithyanadigar@gmail.com",
            "password": "adithyanadigar",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Dhruthi Nooka",
            "email": "dhruthinooka@gmail.com",
            "password": "dhruthinooka",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Rahul K Jain",
            "email": "rahulkjain@gmail.com",
            "password": "rahulkjain",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Pratiek Sanklecha",
            "email": "pratieksanklecha@gmail.com",
            "password": "pratieksanklecha",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Soumya Mishra",
            "email": "soumyamishra@gmail.com",
            "password": "soumyamishra",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Kirthan M Puttegowda",
            "email": "kirthanmputtegowda@gmail.com",
            "password": "kirthanmputtegowda",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Earl Manley",
            "email": "earlmanley@gmail.com",
            "password": "earlmanley",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Zaryab Saiyadain",
            "email": "zaryabsaiyadain@gmail.com",
            "password": "zaryabsaiyadain",
            "role": "s",
"isConfirmed": true
        },
        {
            "name": "Carlo G.",
            "email": "carlog.@gmail.com",
            "password": "carlog.",
            "role": "s",
"isConfirmed": true
        }
    ],
    "instructor": {
        "name": "in28Minutes Official",
        "email": "in28minutesofficial@gmail.com",
        "password": "in28minutesofficial",
        "role": "i",
"isConfirmed": true,
        "briefIntroduction": "<p>Ranga is an <strong>AWS Certified Solutions Architect Associate, AWS Certified Developer Associate and AWS Certified Cloud Practitioner.</strong></p><p>We are teaching <strong>30+&nbsp;Courses</strong> to <strong>450K&nbsp;Learners </strong>on <strong>DevOps</strong>, Cloud ( <strong>AWS</strong>, PCF, GCP,&nbsp;and Azure ), Full Stack (&nbsp; <strong>React</strong>, <strong>Angular</strong> ), <strong>Java</strong> Programming, and Java Frameworks ( Spring, <strong>Spring Boot</strong>, Spring MVC,&nbsp; Hibernate ). </p><p><strong>[LEARNING&nbsp;PATHS 00 to 06 </strong>for DevOps,&nbsp;Full Stack, Cloud,&nbsp; Spring Boot and Java in the<strong> FAQ&nbsp;</strong>below<strong>]</strong></p><p>We use Problem-Solution based Step-By-Step Hands-on Approach With Practical, Real-World Application Examples.</p><p>We have a wide range of courses focused on Spring Boot -&nbsp; Creating APIs and Microservices, Deploying to&nbsp;Cloud ( AWS, Azure, Docker, Kubernetes, Azure ), and Integrating with Full Stack Front end frameworks ( React &amp;&nbsp;Angular ).</p><p><br></p><p><strong>[LEARNING&nbsp;PATHS]</strong></p><p><br></p><p><strong>[LEARNING&nbsp;PATH 00] - DevOps&nbsp; </strong></p><p>Master DevOps with Docker, Kubernetes and Azure DevOps</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 00] - DevOps&nbsp; </strong></p><p>Master DevOps with Docker, Kubernetes and Azure DevOps</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 01] - Spring and Spring Boot Web Applications &amp; API Developer</strong></p><p>Spring Framework Master Class - Learn Spring the Modern Way!</p><p>Learn Spring Boot in 100 Steps - Beginner to Expert</p><p>Master Java Web Services and RESTful API with Spring Boot</p><p>Master Hibernate and JPA with Spring Boot in 100 Steps</p><p>Master Java Unit Testing with Spring Boot &amp; Mockito</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 02] - Full Stack Developer with Spring Boot, React and Angular</strong></p><p>Go Java Full Stack with Spring Boot and React</p><p>Go Java Full Stack with Spring Boot and Angular</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 03] - Cloud Microservices with Spring Boot, Docker &amp; Kubernetes</strong></p><p>Master Microservices with Spring Boot and Spring Cloud</p><p>Master Docker with Java - DevOps for Spring Microservices</p><p>Master Kubernetes with Docker on Google Cloud, AWS &amp; Azure</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 04] - Cloud Developer with Spring Boot, AWS, Azure, and PCF</strong></p><p>Learn AWS - Deploy Java Spring Boot to AWS Elastic Beanstalk</p><p>Master Azure Web Apps - Take Java Spring Boot Apps to Azure</p><p>Master Pivotal Cloud Foundry with Spring Boot Microservices</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 05] - Learn AWS with Microservices, Docker, and Kubernetes</strong></p><p>Learn AWS - Deploy Java Spring Boot to AWS Elastic Beanstalk</p><p>Master AWS Fargate &amp; ECS with Java Spring Boot Microservices</p><p>Master Kubernetes with Docker on Google Cloud, AWS &amp; Azure</p><p><br></p><p><strong>[LEARNING&nbsp;PATH 06] - GET&nbsp;AWS&nbsp;CERTIFIED</strong></p><p>AWS Certified Cloud Practitioner - Step By Step</p><p>AWS Certified Developer Associate&nbsp; - Step By Step</p><p>AWS Certified Solutions Architect Associate - Step By Step</p><p><br></p><p><strong>[OUR&nbsp;BELIEFS]</strong></p><p>Best Courses are interactive and fun.</p><p>Foundations for building high-quality applications are best laid down while learning.</p><p><br></p><p><strong>[OUR&nbsp;APPROACH]</strong></p><p>We use the 80-20 Rule. We discuss 20% of things used 80% of the time in depth. We touch upon other things briefly equipping you with enough knowledge to find out more on your own.</p><p>Problem Solution based Step by Step Hands-on Learning.</p><p><br></p>"
    }
}